Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm

========================================================================

** ELF Header Information

    File Name: D:\keil code\IEC60335_CLASSB-main\IEC60335_CLASSB-main\SWM260_IEC60335\Objects\SWM260_IEC60335.axf

    Machine class: ELFCLASS32 (32-bit)
    Data encoding: ELFDATA2LSB (Little endian)
    Header version: EV_CURRENT (Current version)
    Operating System ABI: none
    ABI Version: 0
    File Type: ET_EXEC (Executable) (2)
    Machine: EM_ARM (ARM)

    Image Entry point: 0x000000c1
    Flags: EF_ARM_HASENTRY + EF_ARM_ABI_FLOAT_SOFT (0x05000202)

    ARM ELF revision: 5 (ABI version 2)

    Conforms to Soft float procedure-call standard

    Built with
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armasm [4d35fa]
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armlink [4d3601]

    Header size: 52 bytes (0x34)
    Program header entry size: 32 bytes (0x20)
    Section header entry size: 40 bytes (0x28)

    Program header entries: 1
    Section header entries: 21

    Program header offset: 180180 (0x0002bfd4)
    Section header offset: 180212 (0x0002bff4)

    Section header string table index: 20

========================================================================

** Program header #0 (PT_LOAD) [PF_X + PF_W + PF_R + PF_ARM_ENTRY]
    Size : 14212 bytes (12728 bytes in file)
    Virtual address: 0x00000000 (Alignment 64)


========================================================================

** Section #1 'ER_IROM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 12676 bytes (alignment 64)
    Address: 0x00000000

    $d.realdata
    RESET
    __Vectors
        0x00000000:    20003408    .4.     DCD    536884232
        0x00000004:    00001a19    ....    DCD    6681
        0x00000008:    00000159    Y...    DCD    345
        0x0000000c:    0000015b    [...    DCD    347
        0x00000010:    00000000    ....    DCD    0
        0x00000014:    00000000    ....    DCD    0
        0x00000018:    00000000    ....    DCD    0
        0x0000001c:    00000000    ....    DCD    0
        0x00000020:    00000000    ....    DCD    0
        0x00000024:    00000000    ....    DCD    0
        0x00000028:    00000000    ....    DCD    0
        0x0000002c:    0000015d    ]...    DCD    349
        0x00000030:    00000000    ....    DCD    0
        0x00000034:    00000000    ....    DCD    0
        0x00000038:    0000015f    _...    DCD    351
        0x0000003c:    000020d5    . ..    DCD    8405
        0x00000040:    00000163    c...    DCD    355
        0x00000044:    00000165    e...    DCD    357
        0x00000048:    00000167    g...    DCD    359
        0x0000004c:    00000169    i...    DCD    361
        0x00000050:    0000016b    k...    DCD    363
        0x00000054:    0000016d    m...    DCD    365
        0x00000058:    0000016f    o...    DCD    367
        0x0000005c:    00000171    q...    DCD    369
        0x00000060:    00000173    s...    DCD    371
        0x00000064:    00000175    u...    DCD    373
        0x00000068:    00000177    w...    DCD    375
        0x0000006c:    00000179    y...    DCD    377
        0x00000070:    0000017b    {...    DCD    379
        0x00000074:    0000017d    }...    DCD    381
        0x00000078:    0000017f    ....    DCD    383
        0x0000007c:    00000181    ....    DCD    385
        0x00000080:    00000183    ....    DCD    387
        0x00000084:    00000185    ....    DCD    389
        0x00000088:    00000187    ....    DCD    391
        0x0000008c:    00000189    ....    DCD    393
        0x00000090:    0000018b    ....    DCD    395
        0x00000094:    0000018d    ....    DCD    397
        0x00000098:    0000018f    ....    DCD    399
        0x0000009c:    00000191    ....    DCD    401
        0x000000a0:    00000193    ....    DCD    403
        0x000000a4:    00000195    ....    DCD    405
        0x000000a8:    00000197    ....    DCD    407
        0x000000ac:    00000199    ....    DCD    409
        0x000000b0:    0000019b    ....    DCD    411
        0x000000b4:    0000019d    ....    DCD    413
        0x000000b8:    0000019f    ....    DCD    415
        0x000000bc:    000001a1    ....    DCD    417
    $t
    !!!main
    __Vectors_End
    __main
        0x000000c0:    f000f802    ....    BL       __scatterload ; 0xc8
        0x000000c4:    f000f837    ..7.    BL       __rt_entry ; 0x136
    !!!scatter
    __scatterload
    __scatterload_rt2
    __scatterload_rt2_thumb_only
        0x000000c8:    a00c        ..      ADR      r0,{pc}+0x34 ; 0xfc
        0x000000ca:    c830        0.      LDM      r0!,{r4,r5}
        0x000000cc:    3808        .8      SUBS     r0,r0,#8
        0x000000ce:    1824        $.      ADDS     r4,r4,r0
        0x000000d0:    182d        -.      ADDS     r5,r5,r0
        0x000000d2:    46a2        .F      MOV      r10,r4
        0x000000d4:    1e67        g.      SUBS     r7,r4,#1
        0x000000d6:    46ab        .F      MOV      r11,r5
    __scatterload_null
        0x000000d8:    4654        TF      MOV      r4,r10
        0x000000da:    465d        ]F      MOV      r5,r11
        0x000000dc:    42ac        .B      CMP      r4,r5
        0x000000de:    d101        ..      BNE      0xe4 ; __scatterload_null + 12
        0x000000e0:    f000f829    ..).    BL       __rt_entry ; 0x136
        0x000000e4:    467e        ~F      MOV      r6,pc
        0x000000e6:    3e0f        .>      SUBS     r6,r6,#0xf
        0x000000e8:    cc0f        ..      LDM      r4!,{r0-r3}
        0x000000ea:    46b6        .F      MOV      lr,r6
        0x000000ec:    2601        .&      MOVS     r6,#1
        0x000000ee:    4233        3B      TST      r3,r6
        0x000000f0:    d000        ..      BEQ      0xf4 ; __scatterload_null + 28
        0x000000f2:    1afb        ..      SUBS     r3,r7,r3
        0x000000f4:    46a2        .F      MOV      r10,r4
        0x000000f6:    46ab        .F      MOV      r11,r5
        0x000000f8:    4333        3C      ORRS     r3,r3,r6
        0x000000fa:    4718        .G      BX       r3
    $d
        0x000000fc:    00003018    .0..    DCD    12312
        0x00000100:    00003048    H0..    DCD    12360
    $t
    !!handler_copy
    __scatterload_copy
        0x00000104:    3a10        .:      SUBS     r2,r2,#0x10
        0x00000106:    d302        ..      BCC      0x10e ; __scatterload_copy + 10
        0x00000108:    c878        x.      LDM      r0!,{r3-r6}
        0x0000010a:    c178        x.      STM      r1!,{r3-r6}
        0x0000010c:    d8fa        ..      BHI      __scatterload_copy ; 0x104
        0x0000010e:    0752        R.      LSLS     r2,r2,#29
        0x00000110:    d301        ..      BCC      0x116 ; __scatterload_copy + 18
        0x00000112:    c830        0.      LDM      r0!,{r4,r5}
        0x00000114:    c130        0.      STM      r1!,{r4,r5}
        0x00000116:    d501        ..      BPL      0x11c ; __scatterload_copy + 24
        0x00000118:    6804        .h      LDR      r4,[r0,#0]
        0x0000011a:    600c        .`      STR      r4,[r1,#0]
        0x0000011c:    4770        pG      BX       lr
    .ARM.Collect$$libinit$$00000000
    __rt_lib_init
        0x0000011e:    b51f        ..      PUSH     {r0-r4,lr}
    .ARM.Collect$$libinit$$00000002
    .ARM.Collect$$libinit$$00000004
    .ARM.Collect$$libinit$$00000005
    __rt_lib_init_fp_1
    __rt_lib_init_heap_2
    __rt_lib_init_preinit_1
        0x00000120:    9800        ..      LDR      r0,[sp,#0]
        0x00000122:    9901        ..      LDR      r1,[sp,#4]
        0x00000124:    f000fd3b    ..;.    BL       _init_alloc ; 0xb9e
    .ARM.Collect$$libinit$$0000000A
    .ARM.Collect$$libinit$$0000000C
    .ARM.Collect$$libinit$$0000000E
    .ARM.Collect$$libinit$$00000011
    .ARM.Collect$$libinit$$00000013
    .ARM.Collect$$libinit$$00000015
    .ARM.Collect$$libinit$$00000017
    .ARM.Collect$$libinit$$00000019
    .ARM.Collect$$libinit$$0000001B
    .ARM.Collect$$libinit$$0000001D
    .ARM.Collect$$libinit$$0000001F
    .ARM.Collect$$libinit$$00000021
    .ARM.Collect$$libinit$$00000023
    .ARM.Collect$$libinit$$00000024
    __rt_lib_init_atexit_1
    __rt_lib_init_clock_1
    __rt_lib_init_fp_trap_1
    __rt_lib_init_getenv_1
    __rt_lib_init_heap_1
    __rt_lib_init_lc_collate_1
    __rt_lib_init_lc_ctype_1
    __rt_lib_init_lc_monetary_1
    __rt_lib_init_lc_numeric_1
    __rt_lib_init_lc_time_1
    __rt_lib_init_rand_1
    __rt_lib_init_signal_1
    __rt_lib_init_stdio_2
    __rt_lib_init_user_alloc_1
        0x00000128:    f000fb00    ....    BL       _initio ; 0x72c
    .ARM.Collect$$libinit$$00000025
    .ARM.Collect$$libinit$$0000002C
    .ARM.Collect$$libinit$$0000002E
    .ARM.Collect$$libinit$$00000030
    .ARM.Collect$$libinit$$00000032
    .ARM.Collect$$libinit$$00000033
    __rt_lib_init_alloca_1
    __rt_lib_init_argv_1
    __rt_lib_init_cpp_1
    __rt_lib_init_exceptions_1
    __rt_lib_init_return
    __rt_lib_init_stdio_1
        0x0000012c:    bd1f        ..      POP      {r0-r4,pc}
    .ARM.Collect$$libshutdown$$00000000
    __rt_lib_shutdown
        0x0000012e:    b510        ..      PUSH     {r4,lr}
    .ARM.Collect$$libshutdown$$00000002
    .ARM.Collect$$libshutdown$$00000004
    .ARM.Collect$$libshutdown$$00000005
    __rt_lib_shutdown_cpp_1
    __rt_lib_shutdown_fini_1
    __rt_lib_shutdown_stdio_2
        0x00000130:    f000fb68    ..h.    BL       _terminateio ; 0x804
    .ARM.Collect$$libshutdown$$00000006
    .ARM.Collect$$libshutdown$$00000009
    .ARM.Collect$$libshutdown$$0000000C
    .ARM.Collect$$libshutdown$$0000000E
    .ARM.Collect$$libshutdown$$00000011
    .ARM.Collect$$libshutdown$$00000012
    __rt_lib_shutdown_fp_trap_1
    __rt_lib_shutdown_heap_1
    __rt_lib_shutdown_return
    __rt_lib_shutdown_signal_1
    __rt_lib_shutdown_stdio_1
    __rt_lib_shutdown_user_alloc_1
        0x00000134:    bd10        ..      POP      {r4,pc}
    .ARM.Collect$$rtentry$$00000000
    .ARM.Collect$$rtentry$$00000002
    .ARM.Collect$$rtentry$$00000004
    __rt_entry
    __rt_entry_presh_1
    __rt_entry_sh
        0x00000136:    f000fbca    ....    BL       __user_setup_stackheap ; 0x8ce
        0x0000013a:    4611        .F      MOV      r1,r2
    .ARM.Collect$$rtentry$$00000009
    .ARM.Collect$$rtentry$$0000000A
    __rt_entry_li
    __rt_entry_postsh_1
        0x0000013c:    f7ffffef    ....    BL       __rt_lib_init ; 0x11e
    .ARM.Collect$$rtentry$$0000000C
    .ARM.Collect$$rtentry$$0000000D
    __rt_entry_main
    __rt_entry_postli_1
        0x00000140:    f002fc42    ..B.    BL       main ; 0x29c8
        0x00000144:    f000fcda    ....    BL       exit ; 0xafc
    .ARM.Collect$$rtexit$$00000000
    __rt_exit
        0x00000148:    b403        ..      PUSH     {r0,r1}
    .ARM.Collect$$rtexit$$00000002
    .ARM.Collect$$rtexit$$00000003
    __rt_exit_ls
    __rt_exit_prels_1
        0x0000014a:    f7fffff0    ....    BL       __rt_lib_shutdown ; 0x12e
    .ARM.Collect$$rtexit$$00000004
    __rt_exit_exit
        0x0000014e:    bc03        ..      POP      {r0,r1}
        0x00000150:    f000feb8    ....    BL       _sys_exit ; 0xec4
    .text
    .emb_text
    Reset_Handler
    _maybe_terminate_alloc
        0x00000154:    4816        .H      LDR      r0,[pc,#88] ; [0x1b0] = 0xc1
        0x00000156:    4700        .G      BX       r0
    NMI_Handler
        0x00000158:    e7fe        ..      B        NMI_Handler ; 0x158
    HardFault_Handler
        0x0000015a:    e7fe        ..      B        HardFault_Handler ; 0x15a
    SVC_Handler
        0x0000015c:    e7fe        ..      B        SVC_Handler ; 0x15c
    PendSV_Handler
        0x0000015e:    e7fe        ..      B        PendSV_Handler ; 0x15e
        0x00000160:    e7fe        ..      B        0x160 ; PendSV_Handler + 2
    UART0_Handler
        0x00000162:    e7fe        ..      B        UART0_Handler ; 0x162
    TIMR0_Handler
        0x00000164:    e7fe        ..      B        TIMR0_Handler ; 0x164
    SPI0_Handler
        0x00000166:    e7fe        ..      B        SPI0_Handler ; 0x166
    UART1_Handler
        0x00000168:    e7fe        ..      B        UART1_Handler ; 0x168
    UART2_Handler
        0x0000016a:    e7fe        ..      B        UART2_Handler ; 0x16a
    TIMR1_Handler
        0x0000016c:    e7fe        ..      B        TIMR1_Handler ; 0x16c
    DMA_Handler
        0x0000016e:    e7fe        ..      B        DMA_Handler ; 0x16e
    PWM0_Handler
        0x00000170:    e7fe        ..      B        PWM0_Handler ; 0x170
    BTIMR0_Handler
        0x00000172:    e7fe        ..      B        BTIMR0_Handler ; 0x172
    TIMR2_Handler
        0x00000174:    e7fe        ..      B        TIMR2_Handler ; 0x174
    TIMR3_Handler
        0x00000176:    e7fe        ..      B        TIMR3_Handler ; 0x176
    WDT_Handler
        0x00000178:    e7fe        ..      B        WDT_Handler ; 0x178
    I2C4_Handler
        0x0000017a:    e7fe        ..      B        I2C4_Handler ; 0x17a
    UART3_Handler
        0x0000017c:    e7fe        ..      B        UART3_Handler ; 0x17c
    ADC0_Handler
        0x0000017e:    e7fe        ..      B        ADC0_Handler ; 0x17e
    BTIMR1_Handler
        0x00000180:    e7fe        ..      B        BTIMR1_Handler ; 0x180
    GPIOA9_GPIOC6_Handler
        0x00000182:    e7fe        ..      B        GPIOA9_GPIOC6_Handler ; 0x182
    GPIOA6_GPIOC7_Handler
        0x00000184:    e7fe        ..      B        GPIOA6_GPIOC7_Handler ; 0x184
    GPIOA7_GPIOC8_Handler
        0x00000186:    e7fe        ..      B        GPIOA7_GPIOC8_Handler ; 0x186
    GPIOA8_GPIOC9_Handler
        0x00000188:    e7fe        ..      B        GPIOA8_GPIOC9_Handler ; 0x188
    GPIOA10_GPIOC10_Handler
        0x0000018a:    e7fe        ..      B        GPIOA10_GPIOC10_Handler ; 0x18a
    GPIOA13_GPIOC12_Handler
        0x0000018c:    e7fe        ..      B        GPIOA13_GPIOC12_Handler ; 0x18c
    GPIOA12_GPIOC13_Handler
        0x0000018e:    e7fe        ..      B        GPIOA12_GPIOC13_Handler ; 0x18e
    GPIOA11_GPIOC14_Handler
        0x00000190:    e7fe        ..      B        GPIOA11_GPIOC14_Handler ; 0x190
    XTALSTOPDET_GPIOC0_Handler
        0x00000192:    e7fe        ..      B        XTALSTOPDET_GPIOC0_Handler ; 0x192
    BTIMR2_GPIOB12_Handler
        0x00000194:    e7fe        ..      B        BTIMR2_GPIOB12_Handler ; 0x194
    PWM1_GPIOA1_Handler
        0x00000196:    e7fe        ..      B        PWM1_GPIOA1_Handler ; 0x196
    PWM2_UART4_Handler
        0x00000198:    e7fe        ..      B        PWM2_UART4_Handler ; 0x198
    BOD_PWMHALT_Handler
        0x0000019a:    e7fe        ..      B        BOD_PWMHALT_Handler ; 0x19a
    PWM3_GPIOB_ACMP_Handler
        0x0000019c:    e7fe        ..      B        PWM3_GPIOB_ACMP_Handler ; 0x19c
    SPI1_HALL_GPIOD_Handler
        0x0000019e:    e7fe        ..      B        SPI1_HALL_GPIOD_Handler ; 0x19e
    BTIMR3_RTC_Handler
        0x000001a0:    e7fe        ..      B        BTIMR3_RTC_Handler ; 0x1a0
    $d
        0x000001a2:    0000        ..      DCW    0
    $t
    __user_initial_stackheap
        0x000001a4:    4803        .H      LDR      r0,[pc,#12] ; [0x1b4] = 0x20000230
        0x000001a6:    4904        .I      LDR      r1,[pc,#16] ; [0x1b8] = 0x20003408
        0x000001a8:    4a02        .J      LDR      r2,[pc,#8] ; [0x1b4] = 0x20000230
        0x000001aa:    4b04        .K      LDR      r3,[pc,#16] ; [0x1bc] = 0x20003008
        0x000001ac:    4770        pG      BX       lr
    $d
        0x000001ae:    0000        ..      DCW    0
        0x000001b0:    000000c1    ....    DCD    193
        0x000001b4:    20000230    0..     DCD    536871472
        0x000001b8:    20003408    .4.     DCD    536884232
        0x000001bc:    20003008    .0.     DCD    536883208
    $t
    .text
    STL_RunTimeCPUTest
        0x000001c0:    b4f0        ..      PUSH     {r4-r7}
        0x000001c2:    485a        ZH      LDR      r0,[pc,#360] ; [0x32c] = 0x20000040
        0x000001c4:    6801        .h      LDR      r1,[r0,#0]
        0x000001c6:    1cc9        ..      ADDS     r1,r1,#3
        0x000001c8:    6001        .`      STR      r1,[r0,#0]
        0x000001ca:    4859        YH      LDR      r0,[pc,#356] ; [0x330] = 0x340
        0x000001cc:    6801        .h      LDR      r1,[r0,#0]
        0x000001ce:    6800        .h      LDR      r0,[r0,#0]
        0x000001d0:    4288        .B      CMP      r0,r1
        0x000001d2:    d154        T.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000001d4:    4857        WH      LDR      r0,[pc,#348] ; [0x334] = 0x344
        0x000001d6:    6801        .h      LDR      r1,[r0,#0]
        0x000001d8:    6800        .h      LDR      r0,[r0,#0]
        0x000001da:    4288        .B      CMP      r0,r1
        0x000001dc:    d14f        O.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000001de:    2101        .!      MOVS     r1,#1
        0x000001e0:    4853        SH      LDR      r0,[pc,#332] ; [0x330] = 0x340
        0x000001e2:    6802        .h      LDR      r2,[r0,#0]
        0x000001e4:    6800        .h      LDR      r0,[r0,#0]
        0x000001e6:    4290        .B      CMP      r0,r2
        0x000001e8:    d149        I.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000001ea:    4852        RH      LDR      r0,[pc,#328] ; [0x334] = 0x344
        0x000001ec:    6802        .h      LDR      r2,[r0,#0]
        0x000001ee:    6800        .h      LDR      r0,[r0,#0]
        0x000001f0:    4290        .B      CMP      r0,r2
        0x000001f2:    d144        D.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000001f4:    2202        ."      MOVS     r2,#2
        0x000001f6:    484e        NH      LDR      r0,[pc,#312] ; [0x330] = 0x340
        0x000001f8:    6803        .h      LDR      r3,[r0,#0]
        0x000001fa:    6800        .h      LDR      r0,[r0,#0]
        0x000001fc:    4298        .B      CMP      r0,r3
        0x000001fe:    d13e        >.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000200:    484c        LH      LDR      r0,[pc,#304] ; [0x334] = 0x344
        0x00000202:    6803        .h      LDR      r3,[r0,#0]
        0x00000204:    6800        .h      LDR      r0,[r0,#0]
        0x00000206:    4298        .B      CMP      r0,r3
        0x00000208:    d139        9.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000020a:    2303        .#      MOVS     r3,#3
        0x0000020c:    4848        HH      LDR      r0,[pc,#288] ; [0x330] = 0x340
        0x0000020e:    6804        .h      LDR      r4,[r0,#0]
        0x00000210:    6800        .h      LDR      r0,[r0,#0]
        0x00000212:    42a0        .B      CMP      r0,r4
        0x00000214:    d133        3.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000216:    4847        GH      LDR      r0,[pc,#284] ; [0x334] = 0x344
        0x00000218:    6804        .h      LDR      r4,[r0,#0]
        0x0000021a:    6800        .h      LDR      r0,[r0,#0]
        0x0000021c:    42a0        .B      CMP      r0,r4
        0x0000021e:    d12e        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000220:    2404        .$      MOVS     r4,#4
        0x00000222:    4843        CH      LDR      r0,[pc,#268] ; [0x330] = 0x340
        0x00000224:    6805        .h      LDR      r5,[r0,#0]
        0x00000226:    6800        .h      LDR      r0,[r0,#0]
        0x00000228:    42a8        .B      CMP      r0,r5
        0x0000022a:    d128        (.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000022c:    4841        AH      LDR      r0,[pc,#260] ; [0x334] = 0x344
        0x0000022e:    6805        .h      LDR      r5,[r0,#0]
        0x00000230:    6800        .h      LDR      r0,[r0,#0]
        0x00000232:    42a8        .B      CMP      r0,r5
        0x00000234:    d123        #.      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000236:    2505        .%      MOVS     r5,#5
        0x00000238:    483d        =H      LDR      r0,[pc,#244] ; [0x330] = 0x340
        0x0000023a:    6806        .h      LDR      r6,[r0,#0]
        0x0000023c:    6800        .h      LDR      r0,[r0,#0]
        0x0000023e:    42b0        .B      CMP      r0,r6
        0x00000240:    d11d        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000242:    483c        <H      LDR      r0,[pc,#240] ; [0x334] = 0x344
        0x00000244:    6806        .h      LDR      r6,[r0,#0]
        0x00000246:    6800        .h      LDR      r0,[r0,#0]
        0x00000248:    42b0        .B      CMP      r0,r6
        0x0000024a:    d118        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000024c:    2606        .&      MOVS     r6,#6
        0x0000024e:    4838        8H      LDR      r0,[pc,#224] ; [0x330] = 0x340
        0x00000250:    6807        .h      LDR      r7,[r0,#0]
        0x00000252:    6800        .h      LDR      r0,[r0,#0]
        0x00000254:    42b8        .B      CMP      r0,r7
        0x00000256:    d112        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000258:    4836        6H      LDR      r0,[pc,#216] ; [0x334] = 0x344
        0x0000025a:    6807        .h      LDR      r7,[r0,#0]
        0x0000025c:    6800        .h      LDR      r0,[r0,#0]
        0x0000025e:    42b8        .B      CMP      r0,r7
        0x00000260:    d10d        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000262:    2707        .'      MOVS     r7,#7
        0x00000264:    4832        2H      LDR      r0,[pc,#200] ; [0x330] = 0x340
        0x00000266:    6800        .h      LDR      r0,[r0,#0]
        0x00000268:    4680        .F      MOV      r8,r0
        0x0000026a:    4540        @E      CMP      r0,r8
        0x0000026c:    d107        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000026e:    4831        1H      LDR      r0,[pc,#196] ; [0x334] = 0x344
        0x00000270:    6800        .h      LDR      r0,[r0,#0]
        0x00000272:    4680        .F      MOV      r8,r0
        0x00000274:    4540        @E      CMP      r0,r8
        0x00000276:    d102        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000278:    2008        .       MOVS     r0,#8
        0x0000027a:    4680        .F      MOV      r8,r0
        0x0000027c:    e001        ..      B        CPUTstCont ; 0x282
        0x0000027e:    f000fedf    ....    BL       FailSafePOR ; 0x1040
    CPUTstCont
        0x00000282:    482b        +H      LDR      r0,[pc,#172] ; [0x330] = 0x340
        0x00000284:    6800        .h      LDR      r0,[r0,#0]
        0x00000286:    4681        .F      MOV      r9,r0
        0x00000288:    4548        HE      CMP      r0,r9
        0x0000028a:    d1f8        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000028c:    4829        )H      LDR      r0,[pc,#164] ; [0x334] = 0x344
        0x0000028e:    6800        .h      LDR      r0,[r0,#0]
        0x00000290:    4681        .F      MOV      r9,r0
        0x00000292:    4548        HE      CMP      r0,r9
        0x00000294:    d1f3        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000296:    2009        .       MOVS     r0,#9
        0x00000298:    4681        .F      MOV      r9,r0
        0x0000029a:    4825        %H      LDR      r0,[pc,#148] ; [0x330] = 0x340
        0x0000029c:    6800        .h      LDR      r0,[r0,#0]
        0x0000029e:    4682        .F      MOV      r10,r0
        0x000002a0:    4550        PE      CMP      r0,r10
        0x000002a2:    d1ec        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002a4:    4823        #H      LDR      r0,[pc,#140] ; [0x334] = 0x344
        0x000002a6:    6800        .h      LDR      r0,[r0,#0]
        0x000002a8:    4682        .F      MOV      r10,r0
        0x000002aa:    4550        PE      CMP      r0,r10
        0x000002ac:    d1e7        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
