Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x000002ae:    200a        .       MOVS     r0,#0xa
        0x000002b0:    4682        .F      MOV      r10,r0
        0x000002b2:    481f        .H      LDR      r0,[pc,#124] ; [0x330] = 0x340
        0x000002b4:    6800        .h      LDR      r0,[r0,#0]
        0x000002b6:    4683        .F      MOV      r11,r0
        0x000002b8:    4558        XE      CMP      r0,r11
        0x000002ba:    d1e0        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002bc:    481d        .H      LDR      r0,[pc,#116] ; [0x334] = 0x344
        0x000002be:    6800        .h      LDR      r0,[r0,#0]
        0x000002c0:    4683        .F      MOV      r11,r0
        0x000002c2:    4558        XE      CMP      r0,r11
        0x000002c4:    d1db        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002c6:    200b        .       MOVS     r0,#0xb
        0x000002c8:    4683        .F      MOV      r11,r0
        0x000002ca:    4819        .H      LDR      r0,[pc,#100] ; [0x330] = 0x340
        0x000002cc:    6800        .h      LDR      r0,[r0,#0]
        0x000002ce:    4684        .F      MOV      r12,r0
        0x000002d0:    4560        `E      CMP      r0,r12
        0x000002d2:    d1d4        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002d4:    4817        .H      LDR      r0,[pc,#92] ; [0x334] = 0x344
        0x000002d6:    6800        .h      LDR      r0,[r0,#0]
        0x000002d8:    4684        .F      MOV      r12,r0
        0x000002da:    4560        `E      CMP      r0,r12
        0x000002dc:    d1cf        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002de:    200c        .       MOVS     r0,#0xc
        0x000002e0:    4684        .F      MOV      r12,r0
        0x000002e2:    4815        .H      LDR      r0,[pc,#84] ; [0x338] = 0x283
        0x000002e4:    2901        .)      CMP      r1,#1
        0x000002e6:    d1ca        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002e8:    2a02        .*      CMP      r2,#2
        0x000002ea:    d1c8        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002ec:    2b03        .+      CMP      r3,#3
        0x000002ee:    d1c6        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002f0:    2c04        .,      CMP      r4,#4
        0x000002f2:    d1c4        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002f4:    2d05        .-      CMP      r5,#5
        0x000002f6:    d1c2        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002f8:    2e06        ..      CMP      r6,#6
        0x000002fa:    d1c0        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x000002fc:    2f07        ./      CMP      r7,#7
        0x000002fe:    d1be        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000300:    2008        .       MOVS     r0,#8
        0x00000302:    4540        @E      CMP      r0,r8
        0x00000304:    d1bb        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000306:    2009        .       MOVS     r0,#9
        0x00000308:    4548        HE      CMP      r0,r9
        0x0000030a:    d1b8        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000030c:    200a        .       MOVS     r0,#0xa
        0x0000030e:    4550        PE      CMP      r0,r10
        0x00000310:    d1b5        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000312:    200b        .       MOVS     r0,#0xb
        0x00000314:    4558        XE      CMP      r0,r11
        0x00000316:    d1b2        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x00000318:    200c        .       MOVS     r0,#0xc
        0x0000031a:    4560        `E      CMP      r0,r12
        0x0000031c:    d1af        ..      BNE      0x27e ; STL_RunTimeCPUTest + 190
        0x0000031e:    4807        .H      LDR      r0,[pc,#28] ; [0x33c] = 0x20000080
        0x00000320:    6801        .h      LDR      r1,[r0,#0]
        0x00000322:    1ec9        ..      SUBS     r1,r1,#3
        0x00000324:    6001        .`      STR      r1,[r0,#0]
        0x00000326:    bcf0        ..      POP      {r4-r7}
        0x00000328:    2001        .       MOVS     r0,#1
        0x0000032a:    4770        pG      BX       lr
    $d
        0x0000032c:    20000040    @..     DCD    536870976
        0x00000330:    00000340    @...    DCD    832
        0x00000334:    00000344    D...    DCD    836
        0x00000338:    00000283    ....    DCD    643
        0x0000033c:    20000080    ...     DCD    536871040
    .text
    conAA
        0x00000340:    aaaaaaaa    ....    DCD    2863311530
    con55
        0x00000344:    55555555    UUUU    DCD    1431655765
    con80
        0x00000348:    80000000    ....    DCD    2147483648
    conA8
        0x0000034c:    aaaaaaa8    ....    DCD    2863311528
    con54
        0x00000350:    55555554    TUUU    DCD    1431655764
    $t
    STL_StartUpCPUTest
        0x00000354:    b470        p.      PUSH     {r4-r6}
        0x00000356:    2000        .       MOVS     r0,#0
        0x00000358:    b2c0        ..      UXTB     r0,r0
        0x0000035a:    3000        .0      ADDS     r0,#0
        0x0000035c:    d168        h.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000035e:    d467        g.      BMI      0x430 ; STL_StartUpCPUTest + 220
        0x00000360:    3801        .8      SUBS     r0,#1
        0x00000362:    d565        e.      BPL      0x430 ; STL_StartUpCPUTest + 220
        0x00000364:    3002        .0      ADDS     r0,#2
        0x00000366:    d363        c.      BCC      0x430 ; STL_StartUpCPUTest + 220
        0x00000368:    d062        b.      BEQ      0x430 ; STL_StartUpCPUTest + 220
        0x0000036a:    d461        a.      BMI      0x430 ; STL_StartUpCPUTest + 220
        0x0000036c:    4870        pH      LDR      r0,[pc,#448] ; [0x530] = 0x348
        0x0000036e:    6800        .h      LDR      r0,[r0,#0]
        0x00000370:    1800        ..      ADDS     r0,r0,r0
        0x00000372:    d75d        ].      BVC      0x430 ; STL_StartUpCPUTest + 220
        0x00000374:    486f        oH      LDR      r0,[pc,#444] ; [0x534] = 0x20000040
        0x00000376:    6801        .h      LDR      r1,[r0,#0]
        0x00000378:    1cc9        ..      ADDS     r1,r1,#3
        0x0000037a:    6001        .`      STR      r1,[r0,#0]
        0x0000037c:    486e        nH      LDR      r0,[pc,#440] ; [0x538] = 0x340
        0x0000037e:    6801        .h      LDR      r1,[r0,#0]
        0x00000380:    6800        .h      LDR      r0,[r0,#0]
        0x00000382:    4288        .B      CMP      r0,r1
        0x00000384:    d154        T.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000386:    486d        mH      LDR      r0,[pc,#436] ; [0x53c] = 0x344
        0x00000388:    6801        .h      LDR      r1,[r0,#0]
        0x0000038a:    6800        .h      LDR      r0,[r0,#0]
        0x0000038c:    4288        .B      CMP      r0,r1
        0x0000038e:    d14f        O.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000390:    2101        .!      MOVS     r1,#1
        0x00000392:    4869        iH      LDR      r0,[pc,#420] ; [0x538] = 0x340
        0x00000394:    6802        .h      LDR      r2,[r0,#0]
        0x00000396:    6800        .h      LDR      r0,[r0,#0]
        0x00000398:    4290        .B      CMP      r0,r2
        0x0000039a:    d149        I.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000039c:    4867        gH      LDR      r0,[pc,#412] ; [0x53c] = 0x344
        0x0000039e:    6802        .h      LDR      r2,[r0,#0]
        0x000003a0:    6800        .h      LDR      r0,[r0,#0]
        0x000003a2:    4290        .B      CMP      r0,r2
        0x000003a4:    d144        D.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003a6:    2202        ."      MOVS     r2,#2
        0x000003a8:    4863        cH      LDR      r0,[pc,#396] ; [0x538] = 0x340
        0x000003aa:    6803        .h      LDR      r3,[r0,#0]
        0x000003ac:    6800        .h      LDR      r0,[r0,#0]
        0x000003ae:    4298        .B      CMP      r0,r3
        0x000003b0:    d13e        >.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003b2:    4862        bH      LDR      r0,[pc,#392] ; [0x53c] = 0x344
        0x000003b4:    6803        .h      LDR      r3,[r0,#0]
        0x000003b6:    6800        .h      LDR      r0,[r0,#0]
        0x000003b8:    4298        .B      CMP      r0,r3
        0x000003ba:    d139        9.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003bc:    2303        .#      MOVS     r3,#3
        0x000003be:    485e        ^H      LDR      r0,[pc,#376] ; [0x538] = 0x340
        0x000003c0:    6804        .h      LDR      r4,[r0,#0]
        0x000003c2:    6800        .h      LDR      r0,[r0,#0]
        0x000003c4:    42a0        .B      CMP      r0,r4
        0x000003c6:    d133        3.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003c8:    485c        \H      LDR      r0,[pc,#368] ; [0x53c] = 0x344
        0x000003ca:    6804        .h      LDR      r4,[r0,#0]
        0x000003cc:    6800        .h      LDR      r0,[r0,#0]
        0x000003ce:    42a0        .B      CMP      r0,r4
        0x000003d0:    d12e        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003d2:    2404        .$      MOVS     r4,#4
        0x000003d4:    4858        XH      LDR      r0,[pc,#352] ; [0x538] = 0x340
        0x000003d6:    6805        .h      LDR      r5,[r0,#0]
        0x000003d8:    6800        .h      LDR      r0,[r0,#0]
        0x000003da:    42a8        .B      CMP      r0,r5
        0x000003dc:    d128        (.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003de:    4857        WH      LDR      r0,[pc,#348] ; [0x53c] = 0x344
        0x000003e0:    6805        .h      LDR      r5,[r0,#0]
        0x000003e2:    6800        .h      LDR      r0,[r0,#0]
        0x000003e4:    42a8        .B      CMP      r0,r5
        0x000003e6:    d123        #.      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003e8:    2505        .%      MOVS     r5,#5
        0x000003ea:    4853        SH      LDR      r0,[pc,#332] ; [0x538] = 0x340
        0x000003ec:    6806        .h      LDR      r6,[r0,#0]
        0x000003ee:    6800        .h      LDR      r0,[r0,#0]
        0x000003f0:    42b0        .B      CMP      r0,r6
        0x000003f2:    d11d        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003f4:    4851        QH      LDR      r0,[pc,#324] ; [0x53c] = 0x344
        0x000003f6:    6806        .h      LDR      r6,[r0,#0]
        0x000003f8:    6800        .h      LDR      r0,[r0,#0]
        0x000003fa:    42b0        .B      CMP      r0,r6
        0x000003fc:    d118        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000003fe:    2606        .&      MOVS     r6,#6
        0x00000400:    484d        MH      LDR      r0,[pc,#308] ; [0x538] = 0x340
        0x00000402:    6807        .h      LDR      r7,[r0,#0]
        0x00000404:    6800        .h      LDR      r0,[r0,#0]
        0x00000406:    42b8        .B      CMP      r0,r7
        0x00000408:    d112        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000040a:    484c        LH      LDR      r0,[pc,#304] ; [0x53c] = 0x344
        0x0000040c:    6807        .h      LDR      r7,[r0,#0]
        0x0000040e:    6800        .h      LDR      r0,[r0,#0]
        0x00000410:    42b8        .B      CMP      r0,r7
        0x00000412:    d10d        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000414:    2707        .'      MOVS     r7,#7
        0x00000416:    4848        HH      LDR      r0,[pc,#288] ; [0x538] = 0x340
        0x00000418:    6800        .h      LDR      r0,[r0,#0]
        0x0000041a:    4680        .F      MOV      r8,r0
        0x0000041c:    4540        @E      CMP      r0,r8
        0x0000041e:    d107        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000420:    4846        FH      LDR      r0,[pc,#280] ; [0x53c] = 0x344
        0x00000422:    6800        .h      LDR      r0,[r0,#0]
        0x00000424:    4680        .F      MOV      r8,r0
        0x00000426:    4540        @E      CMP      r0,r8
        0x00000428:    d102        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000042a:    2008        .       MOVS     r0,#8
        0x0000042c:    4680        .F      MOV      r8,r0
        0x0000042e:    e001        ..      B        CPUTstCont ; 0x434
        0x00000430:    f000fe06    ....    BL       FailSafePOR ; 0x1040
    CPUTstCont
        0x00000434:    4840        @H      LDR      r0,[pc,#256] ; [0x538] = 0x340
        0x00000436:    6800        .h      LDR      r0,[r0,#0]
        0x00000438:    4681        .F      MOV      r9,r0
        0x0000043a:    4548        HE      CMP      r0,r9
        0x0000043c:    d1f8        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000043e:    483f        ?H      LDR      r0,[pc,#252] ; [0x53c] = 0x344
        0x00000440:    6800        .h      LDR      r0,[r0,#0]
        0x00000442:    4681        .F      MOV      r9,r0
        0x00000444:    4548        HE      CMP      r0,r9
        0x00000446:    d1f3        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000448:    2009        .       MOVS     r0,#9
        0x0000044a:    4681        .F      MOV      r9,r0
        0x0000044c:    483a        :H      LDR      r0,[pc,#232] ; [0x538] = 0x340
        0x0000044e:    6800        .h      LDR      r0,[r0,#0]
        0x00000450:    4682        .F      MOV      r10,r0
        0x00000452:    4550        PE      CMP      r0,r10
        0x00000454:    d1ec        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000456:    4839        9H      LDR      r0,[pc,#228] ; [0x53c] = 0x344
        0x00000458:    6800        .h      LDR      r0,[r0,#0]
        0x0000045a:    4682        .F      MOV      r10,r0
        0x0000045c:    4550        PE      CMP      r0,r10
        0x0000045e:    d1e7        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000460:    200a        .       MOVS     r0,#0xa
        0x00000462:    4682        .F      MOV      r10,r0
        0x00000464:    4834        4H      LDR      r0,[pc,#208] ; [0x538] = 0x340
        0x00000466:    6800        .h      LDR      r0,[r0,#0]
        0x00000468:    4683        .F      MOV      r11,r0
        0x0000046a:    4558        XE      CMP      r0,r11
        0x0000046c:    d1e0        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000046e:    4833        3H      LDR      r0,[pc,#204] ; [0x53c] = 0x344
        0x00000470:    6800        .h      LDR      r0,[r0,#0]
        0x00000472:    4683        .F      MOV      r11,r0
        0x00000474:    4558        XE      CMP      r0,r11
        0x00000476:    d1db        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000478:    200b        .       MOVS     r0,#0xb
        0x0000047a:    4683        .F      MOV      r11,r0
        0x0000047c:    482e        .H      LDR      r0,[pc,#184] ; [0x538] = 0x340
        0x0000047e:    6800        .h      LDR      r0,[r0,#0]
        0x00000480:    4684        .F      MOV      r12,r0
        0x00000482:    4560        `E      CMP      r0,r12
        0x00000484:    d1d4        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000486:    482d        -H      LDR      r0,[pc,#180] ; [0x53c] = 0x344
        0x00000488:    6800        .h      LDR      r0,[r0,#0]
        0x0000048a:    4684        .F      MOV      r12,r0
        0x0000048c:    4560        `E      CMP      r0,r12
        0x0000048e:    d1cf        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x00000490:    200c        .       MOVS     r0,#0xc
        0x00000492:    4684        .F      MOV      r12,r0
        0x00000494:    482a        *H      LDR      r0,[pc,#168] ; [0x540] = 0x435
        0x00000496:    2901        .)      CMP      r1,#1
        0x00000498:    d1ca        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000049a:    2a02        .*      CMP      r2,#2
        0x0000049c:    d1c8        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000049e:    2b03        .+      CMP      r3,#3
        0x000004a0:    d1c6        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004a2:    2c04        .,      CMP      r4,#4
        0x000004a4:    d1c4        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004a6:    2d05        .-      CMP      r5,#5
        0x000004a8:    d1c2        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004aa:    2e06        ..      CMP      r6,#6
        0x000004ac:    d1c0        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004ae:    2f07        ./      CMP      r7,#7
        0x000004b0:    d1be        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004b2:    2008        .       MOVS     r0,#8
        0x000004b4:    4540        @E      CMP      r0,r8
        0x000004b6:    d1bb        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004b8:    2009        .       MOVS     r0,#9
        0x000004ba:    4548        HE      CMP      r0,r9
        0x000004bc:    d1b8        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004be:    200a        .       MOVS     r0,#0xa
        0x000004c0:    4550        PE      CMP      r0,r10
        0x000004c2:    d1b5        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004c4:    200b        .       MOVS     r0,#0xb
        0x000004c6:    4558        XE      CMP      r0,r11
        0x000004c8:    d1b2        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004ca:    200c        .       MOVS     r0,#0xc
        0x000004cc:    4560        `E      CMP      r0,r12
        0x000004ce:    d1af        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004d0:    f3ef8009    ....    MRS      r0,PSP
        0x000004d4:    491b        .I      LDR      r1,[pc,#108] ; [0x544] = 0x34c
        0x000004d6:    6809        .h      LDR      r1,[r1,#0]
        0x000004d8:    f3818809    ....    MSR      PSP,r1
        0x000004dc:    f3ef8209    ....    MRS      r2,PSP
        0x000004e0:    428a        .B      CMP      r2,r1
        0x000004e2:    d1a5        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004e4:    4918        .I      LDR      r1,[pc,#96] ; [0x548] = 0x350
        0x000004e6:    6809        .h      LDR      r1,[r1,#0]
        0x000004e8:    f3818809    ....    MSR      PSP,r1
        0x000004ec:    f3ef8209    ....    MRS      r2,PSP
        0x000004f0:    428a        .B      CMP      r2,r1
        0x000004f2:    d19d        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x000004f4:    f3808809    ....    MSR      PSP,r0
        0x000004f8:    f3ef8008    ....    MRS      r0,MSP
        0x000004fc:    4911        .I      LDR      r1,[pc,#68] ; [0x544] = 0x34c
        0x000004fe:    6809        .h      LDR      r1,[r1,#0]
        0x00000500:    f3818808    ....    MSR      MSP,r1
        0x00000504:    f3ef8208    ....    MRS      r2,MSP
        0x00000508:    428a        .B      CMP      r2,r1
        0x0000050a:    d191        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000050c:    490e        .I      LDR      r1,[pc,#56] ; [0x548] = 0x350
        0x0000050e:    6809        .h      LDR      r1,[r1,#0]
        0x00000510:    f3818808    ....    MSR      MSP,r1
        0x00000514:    f3ef8208    ....    MRS      r2,MSP
        0x00000518:    428a        .B      CMP      r2,r1
        0x0000051a:    d189        ..      BNE      0x430 ; STL_StartUpCPUTest + 220
        0x0000051c:    f3808808    ....    MSR      MSP,r0
        0x00000520:    480a        .H      LDR      r0,[pc,#40] ; [0x54c] = 0x20000080
        0x00000522:    6801        .h      LDR      r1,[r0,#0]
        0x00000524:    1ec9        ..      SUBS     r1,r1,#3
        0x00000526:    6001        .`      STR      r1,[r0,#0]
        0x00000528:    bc70        p.      POP      {r4-r6}
        0x0000052a:    2001        .       MOVS     r0,#1
        0x0000052c:    4770        pG      BX       lr
    $d
        0x0000052e:    0000        ..      DCW    0
        0x00000530:    00000348    H...    DCD    840
        0x00000534:    20000040    @..     DCD    536870976
        0x00000538:    00000340    @...    DCD    832
        0x0000053c:    00000344    D...    DCD    836
        0x00000540:    00000435    5...    DCD    1077
        0x00000544:    0000034c    L...    DCD    844
        0x00000548:    00000350    P...    DCD    848
        0x0000054c:    20000080    ...     DCD    536871040
    $t
    .text
    __2printf
        0x00000550:    b40f        ..      PUSH     {r0-r3}
        0x00000552:    4905        .I      LDR      r1,[pc,#20] ; [0x568] = 0x20000128
        0x00000554:    b510        ..      PUSH     {r4,lr}
        0x00000556:    aa03        ..      ADD      r2,sp,#0xc
        0x00000558:    9802        ..      LDR      r0,[sp,#8]
        0x0000055a:    f000f8b7    ....    BL       _printf_char_file ; 0x6cc
        0x0000055e:    bc10        ..      POP      {r4}
        0x00000560:    bc08        ..      POP      {r3}
        0x00000562:    b004        ..      ADD      sp,sp,#0x10
        0x00000564:    4718        .G      BX       r3
    $d
        0x00000566:    0000        ..      DCW    0
        0x00000568:    20000128    (..     DCD    536871208
    $t
    .text
    __aeabi_uidiv
    __aeabi_uidivmod
        0x0000056c:    2200        ."      MOVS     r2,#0
        0x0000056e:    0903        ..      LSRS     r3,r0,#4
        0x00000570:    428b        .B      CMP      r3,r1
        0x00000572:    d32c        ,.      BCC      0x5ce ; __aeabi_idiv + 78
        0x00000574:    0a03        ..      LSRS     r3,r0,#8
        0x00000576:    428b        .B      CMP      r3,r1
        0x00000578:    d311        ..      BCC      0x59e ; __aeabi_idiv + 30
        0x0000057a:    2300        .#      MOVS     r3,#0
        0x0000057c:    469c        .F      MOV      r12,r3
        0x0000057e:    e04e        N.      B        0x61e ; __aeabi_idiv + 158
    __aeabi_idiv
    __aeabi_idivmod
        0x00000580:    4603        .F      MOV      r3,r0
        0x00000582:    430b        .C      ORRS     r3,r3,r1
        0x00000584:    d43c        <.      BMI      0x600 ; __aeabi_idiv + 128
        0x00000586:    2200        ."      MOVS     r2,#0
        0x00000588:    0843        C.      LSRS     r3,r0,#1
        0x0000058a:    428b        .B      CMP      r3,r1
        0x0000058c:    d331        1.      BCC      0x5f2 ; __aeabi_idiv + 114
        0x0000058e:    0903        ..      LSRS     r3,r0,#4
        0x00000590:    428b        .B      CMP      r3,r1
        0x00000592:    d31c        ..      BCC      0x5ce ; __aeabi_idiv + 78
        0x00000594:    0a03        ..      LSRS     r3,r0,#8
        0x00000596:    428b        .B      CMP      r3,r1
        0x00000598:    d301        ..      BCC      0x59e ; __aeabi_idiv + 30
        0x0000059a:    4694        .F      MOV      r12,r2
        0x0000059c:    e03f        ?.      B        0x61e ; __aeabi_idiv + 158
        0x0000059e:    09c3        ..      LSRS     r3,r0,#7
        0x000005a0:    428b        .B      CMP      r3,r1
        0x000005a2:    d301        ..      BCC      0x5a8 ; __aeabi_idiv + 40
        0x000005a4:    01cb        ..      LSLS     r3,r1,#7
        0x000005a6:    1ac0        ..      SUBS     r0,r0,r3
        0x000005a8:    4152        RA      ADCS     r2,r2,r2
        0x000005aa:    0983        ..      LSRS     r3,r0,#6
        0x000005ac:    428b        .B      CMP      r3,r1
        0x000005ae:    d301        ..      BCC      0x5b4 ; __aeabi_idiv + 52
