Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x000005b0:    018b        ..      LSLS     r3,r1,#6
        0x000005b2:    1ac0        ..      SUBS     r0,r0,r3
        0x000005b4:    4152        RA      ADCS     r2,r2,r2
        0x000005b6:    0943        C.      LSRS     r3,r0,#5
        0x000005b8:    428b        .B      CMP      r3,r1
        0x000005ba:    d301        ..      BCC      0x5c0 ; __aeabi_idiv + 64
        0x000005bc:    014b        K.      LSLS     r3,r1,#5
        0x000005be:    1ac0        ..      SUBS     r0,r0,r3
        0x000005c0:    4152        RA      ADCS     r2,r2,r2
        0x000005c2:    0903        ..      LSRS     r3,r0,#4
        0x000005c4:    428b        .B      CMP      r3,r1
        0x000005c6:    d301        ..      BCC      0x5cc ; __aeabi_idiv + 76
        0x000005c8:    010b        ..      LSLS     r3,r1,#4
        0x000005ca:    1ac0        ..      SUBS     r0,r0,r3
        0x000005cc:    4152        RA      ADCS     r2,r2,r2
        0x000005ce:    08c3        ..      LSRS     r3,r0,#3
        0x000005d0:    428b        .B      CMP      r3,r1
        0x000005d2:    d301        ..      BCC      0x5d8 ; __aeabi_idiv + 88
        0x000005d4:    00cb        ..      LSLS     r3,r1,#3
        0x000005d6:    1ac0        ..      SUBS     r0,r0,r3
        0x000005d8:    4152        RA      ADCS     r2,r2,r2
        0x000005da:    0883        ..      LSRS     r3,r0,#2
        0x000005dc:    428b        .B      CMP      r3,r1
        0x000005de:    d301        ..      BCC      0x5e4 ; __aeabi_idiv + 100
        0x000005e0:    008b        ..      LSLS     r3,r1,#2
        0x000005e2:    1ac0        ..      SUBS     r0,r0,r3
        0x000005e4:    4152        RA      ADCS     r2,r2,r2
        0x000005e6:    0843        C.      LSRS     r3,r0,#1
        0x000005e8:    428b        .B      CMP      r3,r1
        0x000005ea:    d301        ..      BCC      0x5f0 ; __aeabi_idiv + 112
        0x000005ec:    004b        K.      LSLS     r3,r1,#1
        0x000005ee:    1ac0        ..      SUBS     r0,r0,r3
        0x000005f0:    4152        RA      ADCS     r2,r2,r2
        0x000005f2:    1a41        A.      SUBS     r1,r0,r1
        0x000005f4:    d200        ..      BCS      0x5f8 ; __aeabi_idiv + 120
        0x000005f6:    4601        .F      MOV      r1,r0
        0x000005f8:    4152        RA      ADCS     r2,r2,r2
        0x000005fa:    4610        .F      MOV      r0,r2
        0x000005fc:    4770        pG      BX       lr
        0x000005fe:    e05d        ].      B        0x6bc ; __aeabi_idiv + 316
        0x00000600:    0fca        ..      LSRS     r2,r1,#31
        0x00000602:    d000        ..      BEQ      0x606 ; __aeabi_idiv + 134
        0x00000604:    4249        IB      RSBS     r1,r1,#0
        0x00000606:    1003        ..      ASRS     r3,r0,#32
        0x00000608:    d300        ..      BCC      0x60c ; __aeabi_idiv + 140
        0x0000060a:    4240        @B      RSBS     r0,r0,#0
        0x0000060c:    4053        S@      EORS     r3,r3,r2
        0x0000060e:    2200        ."      MOVS     r2,#0
        0x00000610:    469c        .F      MOV      r12,r3
        0x00000612:    0903        ..      LSRS     r3,r0,#4
        0x00000614:    428b        .B      CMP      r3,r1
        0x00000616:    d32d        -.      BCC      0x674 ; __aeabi_idiv + 244
        0x00000618:    0a03        ..      LSRS     r3,r0,#8
        0x0000061a:    428b        .B      CMP      r3,r1
        0x0000061c:    d312        ..      BCC      0x644 ; __aeabi_idiv + 196
        0x0000061e:    22fc        ."      MOVS     r2,#0xfc
        0x00000620:    0189        ..      LSLS     r1,r1,#6
        0x00000622:    ba12        ..      REV      r2,r2
        0x00000624:    0a03        ..      LSRS     r3,r0,#8
        0x00000626:    428b        .B      CMP      r3,r1
        0x00000628:    d30c        ..      BCC      0x644 ; __aeabi_idiv + 196
        0x0000062a:    0189        ..      LSLS     r1,r1,#6
        0x0000062c:    1192        ..      ASRS     r2,r2,#6
        0x0000062e:    428b        .B      CMP      r3,r1
        0x00000630:    d308        ..      BCC      0x644 ; __aeabi_idiv + 196
        0x00000632:    0189        ..      LSLS     r1,r1,#6
        0x00000634:    1192        ..      ASRS     r2,r2,#6
        0x00000636:    428b        .B      CMP      r3,r1
        0x00000638:    d304        ..      BCC      0x644 ; __aeabi_idiv + 196
        0x0000063a:    0189        ..      LSLS     r1,r1,#6
        0x0000063c:    d03a        :.      BEQ      0x6b4 ; __aeabi_idiv + 308
        0x0000063e:    1192        ..      ASRS     r2,r2,#6
        0x00000640:    e000        ..      B        0x644 ; __aeabi_idiv + 196
        0x00000642:    0989        ..      LSRS     r1,r1,#6
        0x00000644:    09c3        ..      LSRS     r3,r0,#7
        0x00000646:    428b        .B      CMP      r3,r1
        0x00000648:    d301        ..      BCC      0x64e ; __aeabi_idiv + 206
        0x0000064a:    01cb        ..      LSLS     r3,r1,#7
        0x0000064c:    1ac0        ..      SUBS     r0,r0,r3
        0x0000064e:    4152        RA      ADCS     r2,r2,r2
        0x00000650:    0983        ..      LSRS     r3,r0,#6
        0x00000652:    428b        .B      CMP      r3,r1
        0x00000654:    d301        ..      BCC      0x65a ; __aeabi_idiv + 218
        0x00000656:    018b        ..      LSLS     r3,r1,#6
        0x00000658:    1ac0        ..      SUBS     r0,r0,r3
        0x0000065a:    4152        RA      ADCS     r2,r2,r2
        0x0000065c:    0943        C.      LSRS     r3,r0,#5
        0x0000065e:    428b        .B      CMP      r3,r1
        0x00000660:    d301        ..      BCC      0x666 ; __aeabi_idiv + 230
        0x00000662:    014b        K.      LSLS     r3,r1,#5
        0x00000664:    1ac0        ..      SUBS     r0,r0,r3
        0x00000666:    4152        RA      ADCS     r2,r2,r2
        0x00000668:    0903        ..      LSRS     r3,r0,#4
        0x0000066a:    428b        .B      CMP      r3,r1
        0x0000066c:    d301        ..      BCC      0x672 ; __aeabi_idiv + 242
        0x0000066e:    010b        ..      LSLS     r3,r1,#4
        0x00000670:    1ac0        ..      SUBS     r0,r0,r3
        0x00000672:    4152        RA      ADCS     r2,r2,r2
        0x00000674:    08c3        ..      LSRS     r3,r0,#3
        0x00000676:    428b        .B      CMP      r3,r1
        0x00000678:    d301        ..      BCC      0x67e ; __aeabi_idiv + 254
        0x0000067a:    00cb        ..      LSLS     r3,r1,#3
        0x0000067c:    1ac0        ..      SUBS     r0,r0,r3
        0x0000067e:    4152        RA      ADCS     r2,r2,r2
        0x00000680:    0883        ..      LSRS     r3,r0,#2
        0x00000682:    428b        .B      CMP      r3,r1
        0x00000684:    d301        ..      BCC      0x68a ; __aeabi_idiv + 266
        0x00000686:    008b        ..      LSLS     r3,r1,#2
        0x00000688:    1ac0        ..      SUBS     r0,r0,r3
        0x0000068a:    4152        RA      ADCS     r2,r2,r2
        0x0000068c:    d2d9        ..      BCS      0x642 ; __aeabi_idiv + 194
        0x0000068e:    0843        C.      LSRS     r3,r0,#1
        0x00000690:    428b        .B      CMP      r3,r1
        0x00000692:    d301        ..      BCC      0x698 ; __aeabi_idiv + 280
        0x00000694:    004b        K.      LSLS     r3,r1,#1
        0x00000696:    1ac0        ..      SUBS     r0,r0,r3
        0x00000698:    4152        RA      ADCS     r2,r2,r2
        0x0000069a:    1a41        A.      SUBS     r1,r0,r1
        0x0000069c:    d200        ..      BCS      0x6a0 ; __aeabi_idiv + 288
        0x0000069e:    4601        .F      MOV      r1,r0
        0x000006a0:    4663        cF      MOV      r3,r12
        0x000006a2:    4152        RA      ADCS     r2,r2,r2
        0x000006a4:    105b        [.      ASRS     r3,r3,#1
        0x000006a6:    4610        .F      MOV      r0,r2
        0x000006a8:    d301        ..      BCC      0x6ae ; __aeabi_idiv + 302
        0x000006aa:    4240        @B      RSBS     r0,r0,#0
        0x000006ac:    2b00        .+      CMP      r3,#0
        0x000006ae:    d500        ..      BPL      0x6b2 ; __aeabi_idiv + 306
        0x000006b0:    4249        IB      RSBS     r1,r1,#0
        0x000006b2:    4770        pG      BX       lr
        0x000006b4:    4663        cF      MOV      r3,r12
        0x000006b6:    105b        [.      ASRS     r3,r3,#1
        0x000006b8:    d300        ..      BCC      0x6bc ; __aeabi_idiv + 316
        0x000006ba:    4240        @B      RSBS     r0,r0,#0
        0x000006bc:    b501        ..      PUSH     {r0,lr}
        0x000006be:    2000        .       MOVS     r0,#0
        0x000006c0:    46c0        .F      MOV      r8,r8
        0x000006c2:    46c0        .F      MOV      r8,r8
        0x000006c4:    bd02        ..      POP      {r1,pc}
    .text
    __use_two_region_memory
        0x000006c6:    4770        pG      BX       lr
    __rt_heap_escrow
        0x000006c8:    4770        pG      BX       lr
    __rt_heap_expand
        0x000006ca:    4770        pG      BX       lr
    .text
    _printf_char_file
        0x000006cc:    4b08        .K      LDR      r3,[pc,#32] ; [0x6f0] = 0x22cf
        0x000006ce:    b570        p.      PUSH     {r4-r6,lr}
        0x000006d0:    460d        .F      MOV      r5,r1
        0x000006d2:    447b        {D      ADD      r3,r3,pc
        0x000006d4:    f000f813    ....    BL       _printf_char_common ; 0x6fe
        0x000006d8:    4604        .F      MOV      r4,r0
        0x000006da:    4628        (F      MOV      r0,r5
        0x000006dc:    f000f822    ..".    BL       ferror ; 0x724
        0x000006e0:    2800        .(      CMP      r0,#0
        0x000006e2:    d002        ..      BEQ      0x6ea ; _printf_char_file + 30
        0x000006e4:    2000        .       MOVS     r0,#0
        0x000006e6:    43c0        .C      MVNS     r0,r0
        0x000006e8:    bd70        p.      POP      {r4-r6,pc}
        0x000006ea:    4620         F      MOV      r0,r4
        0x000006ec:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000006ee:    0000        ..      DCW    0
        0x000006f0:    000022cf    ."..    DCD    8911
    $t
    .text
    _printf_input_char
        0x000006f4:    6901        .i      LDR      r1,[r0,#0x10]
        0x000006f6:    1c4a        J.      ADDS     r2,r1,#1
        0x000006f8:    6102        .a      STR      r2,[r0,#0x10]
        0x000006fa:    7808        .x      LDRB     r0,[r1,#0]
        0x000006fc:    4770        pG      BX       lr
    _printf_char_common
        0x000006fe:    b500        ..      PUSH     {lr}
        0x00000700:    b08f        ..      SUB      sp,sp,#0x3c
        0x00000702:    9102        ..      STR      r1,[sp,#8]
        0x00000704:    2100        .!      MOVS     r1,#0
        0x00000706:    9105        ..      STR      r1,[sp,#0x14]
        0x00000708:    4905        .I      LDR      r1,[pc,#20] ; [0x720] = 0xffffffe5
        0x0000070a:    9301        ..      STR      r3,[sp,#4]
        0x0000070c:    4479        yD      ADD      r1,r1,pc
        0x0000070e:    9103        ..      STR      r1,[sp,#0xc]
        0x00000710:    4611        .F      MOV      r1,r2
        0x00000712:    9004        ..      STR      r0,[sp,#0x10]
        0x00000714:    4668        hF      MOV      r0,sp
        0x00000716:    f000f91f    ....    BL       __printf ; 0x958
        0x0000071a:    b00f        ..      ADD      sp,sp,#0x3c
        0x0000071c:    bd00        ..      POP      {pc}
    $d
        0x0000071e:    0000        ..      DCW    0
        0x00000720:    ffffffe5    ....    DCD    4294967269
    $t
    .text
    ferror
        0x00000724:    68c0        .h      LDR      r0,[r0,#0xc]
        0x00000726:    2180        .!      MOVS     r1,#0x80
        0x00000728:    4008        .@      ANDS     r0,r0,r1
        0x0000072a:    4770        pG      BX       lr
    .text
    _initio
        0x0000072c:    b510        ..      PUSH     {r4,lr}
        0x0000072e:    4843        CH      LDR      r0,[pc,#268] ; [0x83c] = 0x200000d4
        0x00000730:    2154        T!      MOVS     r1,#0x54
        0x00000732:    f000fa0f    ....    BL       __aeabi_memclr4 ; 0xb54
        0x00000736:    4842        BH      LDR      r0,[pc,#264] ; [0x840] = 0x20000128
        0x00000738:    2154        T!      MOVS     r1,#0x54
        0x0000073a:    f000fa0b    ....    BL       __aeabi_memclr4 ; 0xb54
        0x0000073e:    4841        AH      LDR      r0,[pc,#260] ; [0x844] = 0x2000017c
        0x00000740:    2154        T!      MOVS     r1,#0x54
        0x00000742:    f000fa07    ....    BL       __aeabi_memclr4 ; 0xb54
        0x00000746:    4840        @H      LDR      r0,[pc,#256] ; [0x848] = 0x200000c8
        0x00000748:    493c        <I      LDR      r1,[pc,#240] ; [0x83c] = 0x200000d4
        0x0000074a:    4b3d        =K      LDR      r3,[pc,#244] ; [0x840] = 0x20000128
        0x0000074c:    4a40        @J      LDR      r2,[pc,#256] ; [0x850] = 0x200000d0
        0x0000074e:    6001        .`      STR      r1,[r0,#0]
        0x00000750:    483e        >H      LDR      r0,[pc,#248] ; [0x84c] = 0x200000cc
        0x00000752:    6003        .`      STR      r3,[r0,#0]
        0x00000754:    483b        ;H      LDR      r0,[pc,#236] ; [0x844] = 0x2000017c
        0x00000756:    6010        .`      STR      r0,[r2,#0]
        0x00000758:    1c5a        Z.      ADDS     r2,r3,#1
        0x0000075a:    650a        .e      STR      r2,[r1,#0x50]
        0x0000075c:    1c41        A.      ADDS     r1,r0,#1
        0x0000075e:    6519        .e      STR      r1,[r3,#0x50]
        0x00000760:    2101        .!      MOVS     r1,#1
        0x00000762:    6501        .e      STR      r1,[r0,#0x50]
        0x00000764:    483c        <H      LDR      r0,[pc,#240] ; [0x858] = 0x2999
        0x00000766:    4a35        5J      LDR      r2,[pc,#212] ; [0x83c] = 0x200000d4
        0x00000768:    a13a        :.      ADR      r1,{pc}+0xec ; 0x854
        0x0000076a:    4478        xD      ADD      r0,r0,pc
        0x0000076c:    f000f92c    ..,.    BL       _freopen_locked ; 0x9c8
        0x00000770:    2800        .(      CMP      r0,#0
        0x00000772:    d104        ..      BNE      0x77e ; _initio + 82
        0x00000774:    4838        8H      LDR      r0,[pc,#224] ; [0x858] = 0x2999
        0x00000776:    4478        xD      ADD      r0,r0,pc
        0x00000778:    380c        .8      SUBS     r0,r0,#0xc
        0x0000077a:    f000f9c7    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x0000077e:    4838        8H      LDR      r0,[pc,#224] ; [0x860] = 0x2983
        0x00000780:    4a2f        /J      LDR      r2,[pc,#188] ; [0x840] = 0x20000128
        0x00000782:    a136        6.      ADR      r1,{pc}+0xda ; 0x85c
        0x00000784:    4478        xD      ADD      r0,r0,pc
        0x00000786:    f000f91f    ....    BL       _freopen_locked ; 0x9c8
        0x0000078a:    2800        .(      CMP      r0,#0
        0x0000078c:    d104        ..      BNE      0x798 ; _initio + 108
        0x0000078e:    4834        4H      LDR      r0,[pc,#208] ; [0x860] = 0x2983
        0x00000790:    4478        xD      ADD      r0,r0,pc
        0x00000792:    380c        .8      SUBS     r0,r0,#0xc
        0x00000794:    f000f9ba    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x00000798:    4832        2H      LDR      r0,[pc,#200] ; [0x864] = 0x296d
        0x0000079a:    4a2a        *J      LDR      r2,[pc,#168] ; [0x844] = 0x2000017c
        0x0000079c:    a12f        /.      ADR      r1,{pc}+0xc0 ; 0x85c
        0x0000079e:    4478        xD      ADD      r0,r0,pc
        0x000007a0:    f000f912    ....    BL       _freopen_locked ; 0x9c8
        0x000007a4:    2800        .(      CMP      r0,#0
        0x000007a6:    d104        ..      BNE      0x7b2 ; _initio + 134
        0x000007a8:    482e        .H      LDR      r0,[pc,#184] ; [0x864] = 0x296d
        0x000007aa:    4478        xD      ADD      r0,r0,pc
        0x000007ac:    380c        .8      SUBS     r0,r0,#0xc
        0x000007ae:    f000f9ad    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x000007b2:    2340        @#      MOVS     r3,#0x40
        0x000007b4:    4821        !H      LDR      r0,[pc,#132] ; [0x83c] = 0x200000d4
        0x000007b6:    00dc        ..      LSLS     r4,r3,#3
        0x000007b8:    2100        .!      MOVS     r1,#0
        0x000007ba:    4622        "F      MOV      r2,r4
        0x000007bc:    f000f8de    ....    BL       setvbuf ; 0x97c
        0x000007c0:    2800        .(      CMP      r0,#0
        0x000007c2:    d004        ..      BEQ      0x7ce ; _initio + 162
        0x000007c4:    4824        $H      LDR      r0,[pc,#144] ; [0x858] = 0x2999
        0x000007c6:    4478        xD      ADD      r0,r0,pc
        0x000007c8:    385c        \8      SUBS     r0,r0,#0x5c
        0x000007ca:    f000f99f    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x000007ce:    481c        .H      LDR      r0,[pc,#112] ; [0x840] = 0x20000128
        0x000007d0:    4622        "F      MOV      r2,r4
        0x000007d2:    2340        @#      MOVS     r3,#0x40
        0x000007d4:    2100        .!      MOVS     r1,#0
        0x000007d6:    f000f8d1    ....    BL       setvbuf ; 0x97c
        0x000007da:    2800        .(      CMP      r0,#0
        0x000007dc:    d004        ..      BEQ      0x7e8 ; _initio + 188
        0x000007de:    4820         H      LDR      r0,[pc,#128] ; [0x860] = 0x2983
        0x000007e0:    4478        xD      ADD      r0,r0,pc
        0x000007e2:    385c        \8      SUBS     r0,r0,#0x5c
        0x000007e4:    f000f992    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x000007e8:    4816        .H      LDR      r0,[pc,#88] ; [0x844] = 0x2000017c
        0x000007ea:    4622        "F      MOV      r2,r4
        0x000007ec:    2310        .#      MOVS     r3,#0x10
        0x000007ee:    2100        .!      MOVS     r1,#0
        0x000007f0:    f000f8c4    ....    BL       setvbuf ; 0x97c
        0x000007f4:    2800        .(      CMP      r0,#0
        0x000007f6:    d004        ..      BEQ      0x802 ; _initio + 214
        0x000007f8:    481a        .H      LDR      r0,[pc,#104] ; [0x864] = 0x296d
        0x000007fa:    4478        xD      ADD      r0,r0,pc
        0x000007fc:    385c        \8      SUBS     r0,r0,#0x5c
        0x000007fe:    f000f985    ....    BL       __rt_SIGRTRED ; 0xb0c
        0x00000802:    bd10        ..      POP      {r4,pc}
    _terminateio
        0x00000804:    480f        .H      LDR      r0,[pc,#60] ; [0x844] = 0x2000017c
        0x00000806:    b570        p.      PUSH     {r4-r6,lr}
        0x00000808:    6d00        .m      LDR      r0,[r0,#0x50]
        0x0000080a:    0844        D.      LSRS     r4,r0,#1
        0x0000080c:    480b        .H      LDR      r0,[pc,#44] ; [0x83c] = 0x200000d4
        0x0000080e:    0064        d.      LSLS     r4,r4,#1
        0x00000810:    f000f94e    ..N.    BL       _fclose_internal ; 0xab0
        0x00000814:    480a        .H      LDR      r0,[pc,#40] ; [0x840] = 0x20000128
        0x00000816:    f000f94b    ..K.    BL       _fclose_internal ; 0xab0
        0x0000081a:    480a        .H      LDR      r0,[pc,#40] ; [0x844] = 0x2000017c
        0x0000081c:    f000f948    ..H.    BL       _fclose_internal ; 0xab0
        0x00000820:    e009        ..      B        0x836 ; _terminateio + 50
        0x00000822:    6d20         m      LDR      r0,[r4,#0x50]
        0x00000824:    0845        E.      LSRS     r5,r0,#1
        0x00000826:    4620         F      MOV      r0,r4
        0x00000828:    006d        m.      LSLS     r5,r5,#1
        0x0000082a:    f000f941    ..A.    BL       _fclose_internal ; 0xab0
        0x0000082e:    4620         F      MOV      r0,r4
        0x00000830:    f000f86c    ..l.    BL       free ; 0x90c
        0x00000834:    462c        ,F      MOV      r4,r5
        0x00000836:    2c00        .,      CMP      r4,#0
        0x00000838:    d1f3        ..      BNE      0x822 ; _terminateio + 30
        0x0000083a:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0000083c:    200000d4    ...     DCD    536871124
        0x00000840:    20000128    (..     DCD    536871208
        0x00000844:    2000017c    |..     DCD    536871292
        0x00000848:    200000c8    ...     DCD    536871112
        0x0000084c:    200000cc    ...     DCD    536871116
        0x00000850:    200000d0    ...     DCD    536871120
        0x00000854:    00000072    r...    DCD    114
        0x00000858:    00002999    .)..    DCD    10649
        0x0000085c:    00000077    w...    DCD    119
        0x00000860:    00002983    .)..    DCD    10627
        0x00000864:    0000296d    m)..    DCD    10605
    $t
    .text
    _sys_open
        0x00000868:    b50e        ..      PUSH     {r1-r3,lr}
        0x0000086a:    9101        ..      STR      r1,[sp,#4]
        0x0000086c:    9000        ..      STR      r0,[sp,#0]
        0x0000086e:    f000fb07    ....    BL       strlen ; 0xe80
        0x00000872:    9002        ..      STR      r0,[sp,#8]
        0x00000874:    4669        iF      MOV      r1,sp
        0x00000876:    2001        .       MOVS     r0,#1
        0x00000878:    beab        ..      BKPT     #0xab
        0x0000087a:    bd0e        ..      POP      {r1-r3,pc}
    _sys_close
        0x0000087c:    b508        ..      PUSH     {r3,lr}
        0x0000087e:    4669        iF      MOV      r1,sp
        0x00000880:    9000        ..      STR      r0,[sp,#0]
        0x00000882:    2002        .       MOVS     r0,#2
        0x00000884:    beab        ..      BKPT     #0xab
        0x00000886:    bd08        ..      POP      {r3,pc}
    _sys_write
        0x00000888:    b51f        ..      PUSH     {r0-r4,lr}
        0x0000088a:    466b        kF      MOV      r3,sp
        0x0000088c:    c307        ..      STM      r3!,{r0-r2}
        0x0000088e:    4669        iF      MOV      r1,sp
        0x00000890:    2005        .       MOVS     r0,#5
        0x00000892:    beab        ..      BKPT     #0xab
        0x00000894:    b004        ..      ADD      sp,sp,#0x10
        0x00000896:    bd10        ..      POP      {r4,pc}
    _sys_read
        0x00000898:    b51f        ..      PUSH     {r0-r4,lr}
        0x0000089a:    466c        lF      MOV      r4,sp
        0x0000089c:    c40f        ..      STM      r4!,{r0-r3}
        0x0000089e:    4669        iF      MOV      r1,sp
        0x000008a0:    2006        .       MOVS     r0,#6
        0x000008a2:    beab        ..      BKPT     #0xab
        0x000008a4:    e7f6        ..      B        0x894 ; _sys_write + 12
    _sys_istty
        0x000008a6:    b508        ..      PUSH     {r3,lr}
        0x000008a8:    4669        iF      MOV      r1,sp
        0x000008aa:    9000        ..      STR      r0,[sp,#0]
        0x000008ac:    2009        .       MOVS     r0,#9
        0x000008ae:    beab        ..      BKPT     #0xab
        0x000008b0:    bd08        ..      POP      {r3,pc}
    _sys_seek
        0x000008b2:    b51c        ..      PUSH     {r2-r4,lr}
        0x000008b4:    9000        ..      STR      r0,[sp,#0]
        0x000008b6:    200a        .       MOVS     r0,#0xa
        0x000008b8:    9101        ..      STR      r1,[sp,#4]
        0x000008ba:    4669        iF      MOV      r1,sp
        0x000008bc:    beab        ..      BKPT     #0xab
        0x000008be:    bd1c        ..      POP      {r2-r4,pc}
    _sys_ensure
        0x000008c0:    4770        pG      BX       lr
    _sys_flen
        0x000008c2:    b508        ..      PUSH     {r3,lr}
        0x000008c4:    4669        iF      MOV      r1,sp
        0x000008c6:    9000        ..      STR      r0,[sp,#0]
        0x000008c8:    200c        .       MOVS     r0,#0xc
        0x000008ca:    beab        ..      BKPT     #0xab
        0x000008cc:    bd08        ..      POP      {r3,pc}
