Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
    .text
    __user_setup_stackheap
        0x000008ce:    4675        uF      MOV      r5,lr
        0x000008d0:    f000f942    ..B.    BL       __user_libspace ; 0xb58
        0x000008d4:    46ae        .F      MOV      lr,r5
        0x000008d6:    0005        ..      MOVS     r5,r0
        0x000008d8:    4669        iF      MOV      r1,sp
        0x000008da:    4653        SF      MOV      r3,r10
        0x000008dc:    08c0        ..      LSRS     r0,r0,#3
        0x000008de:    00c0        ..      LSLS     r0,r0,#3
        0x000008e0:    4685        .F      MOV      sp,r0
        0x000008e2:    b018        ..      ADD      sp,sp,#0x60
        0x000008e4:    b520         .      PUSH     {r5,lr}
        0x000008e6:    f7fffc5d    ..].    BL       __user_initial_stackheap ; 0x1a4
        0x000008ea:    bc60        `.      POP      {r5,r6}
        0x000008ec:    2700        .'      MOVS     r7,#0
        0x000008ee:    0849        I.      LSRS     r1,r1,#1
        0x000008f0:    46b6        .F      MOV      lr,r6
        0x000008f2:    2600        .&      MOVS     r6,#0
        0x000008f4:    c5c0        ..      STM      r5!,{r6,r7}
        0x000008f6:    c5c0        ..      STM      r5!,{r6,r7}
        0x000008f8:    c5c0        ..      STM      r5!,{r6,r7}
        0x000008fa:    c5c0        ..      STM      r5!,{r6,r7}
        0x000008fc:    c5c0        ..      STM      r5!,{r6,r7}
        0x000008fe:    c5c0        ..      STM      r5!,{r6,r7}
        0x00000900:    c5c0        ..      STM      r5!,{r6,r7}
        0x00000902:    c5c0        ..      STM      r5!,{r6,r7}
        0x00000904:    3d40        @=      SUBS     r5,r5,#0x40
        0x00000906:    0049        I.      LSLS     r1,r1,#1
        0x00000908:    468d        .F      MOV      sp,r1
        0x0000090a:    4770        pG      BX       lr
    .text
    free
        0x0000090c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000090e:    4604        .F      MOV      r4,r0
        0x00000910:    1f05        ..      SUBS     r5,r0,#4
        0x00000912:    f000f927    ..'.    BL       __rt_heap_descriptor ; 0xb64
        0x00000916:    6800        .h      LDR      r0,[r0,#0]
        0x00000918:    2c00        .,      CMP      r4,#0
        0x0000091a:    d01a        ..      BEQ      0x952 ; free + 70
        0x0000091c:    6844        Dh      LDR      r4,[r0,#4]
        0x0000091e:    e001        ..      B        0x924 ; free + 24
        0x00000920:    4620         F      MOV      r0,r4
        0x00000922:    6864        dh      LDR      r4,[r4,#4]
        0x00000924:    2c00        .,      CMP      r4,#0
        0x00000926:    d001        ..      BEQ      0x92c ; free + 32
        0x00000928:    42ac        .B      CMP      r4,r5
        0x0000092a:    d3f9        ..      BCC      0x920 ; free + 20
        0x0000092c:    6801        .h      LDR      r1,[r0,#0]
        0x0000092e:    180a        ..      ADDS     r2,r1,r0
        0x00000930:    42aa        .B      CMP      r2,r5
        0x00000932:    d104        ..      BNE      0x93e ; free + 50
        0x00000934:    682a        *h      LDR      r2,[r5,#0]
        0x00000936:    4605        .F      MOV      r5,r0
        0x00000938:    1889        ..      ADDS     r1,r1,r2
        0x0000093a:    6001        .`      STR      r1,[r0,#0]
        0x0000093c:    e000        ..      B        0x940 ; free + 52
        0x0000093e:    6045        E`      STR      r5,[r0,#4]
        0x00000940:    6828        (h      LDR      r0,[r5,#0]
        0x00000942:    1941        A.      ADDS     r1,r0,r5
        0x00000944:    42a1        .B      CMP      r1,r4
        0x00000946:    d105        ..      BNE      0x954 ; free + 72
        0x00000948:    6861        ah      LDR      r1,[r4,#4]
        0x0000094a:    6069        i`      STR      r1,[r5,#4]
        0x0000094c:    6821        !h      LDR      r1,[r4,#0]
        0x0000094e:    1840        @.      ADDS     r0,r0,r1
        0x00000950:    6028        (`      STR      r0,[r5,#0]
        0x00000952:    bd70        p.      POP      {r4-r6,pc}
        0x00000954:    606c        l`      STR      r4,[r5,#4]
        0x00000956:    bd70        p.      POP      {r4-r6,pc}
    .text
    __printf
        0x00000958:    b5f8        ..      PUSH     {r3-r7,lr}
        0x0000095a:    4606        .F      MOV      r6,r0
        0x0000095c:    2400        .$      MOVS     r4,#0
        0x0000095e:    6847        Gh      LDR      r7,[r0,#4]
        0x00000960:    6880        .h      LDR      r0,[r0,#8]
        0x00000962:    9000        ..      STR      r0,[sp,#0]
        0x00000964:    4630        0F      MOV      r0,r6
        0x00000966:    68f5        .h      LDR      r5,[r6,#0xc]
        0x00000968:    e003        ..      B        0x972 ; __printf + 26
        0x0000096a:    9900        ..      LDR      r1,[sp,#0]
        0x0000096c:    47b8        .G      BLX      r7
        0x0000096e:    1c64        d.      ADDS     r4,r4,#1
        0x00000970:    4630        0F      MOV      r0,r6
        0x00000972:    47a8        .G      BLX      r5
        0x00000974:    2800        .(      CMP      r0,#0
        0x00000976:    d1f8        ..      BNE      0x96a ; __printf + 18
        0x00000978:    4620         F      MOV      r0,r4
        0x0000097a:    bdf8        ..      POP      {r3-r7,pc}
    .text
    setvbuf
        0x0000097c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000097e:    68c4        .h      LDR      r4,[r0,#0xc]
        0x00000980:    07a5        ..      LSLS     r5,r4,#30
        0x00000982:    d013        ..      BEQ      0x9ac ; setvbuf + 48
        0x00000984:    0265        e.      LSLS     r5,r4,#9
        0x00000986:    d411        ..      BMI      0x9ac ; setvbuf + 48
        0x00000988:    1fd5        ..      SUBS     r5,r2,#7
        0x0000098a:    3df9        .=      SUBS     r5,r5,#0xf9
        0x0000098c:    d00a        ..      BEQ      0x9a4 ; setvbuf + 40
        0x0000098e:    3dff        .=      SUBS     r5,r5,#0xff
        0x00000990:    1e6d        m.      SUBS     r5,r5,#1
        0x00000992:    d007        ..      BEQ      0x9a4 ; setvbuf + 40
        0x00000994:    3dff        .=      SUBS     r5,r5,#0xff
        0x00000996:    3dff        .=      SUBS     r5,r5,#0xff
        0x00000998:    2d02        .-      CMP      r5,#2
        0x0000099a:    d107        ..      BNE      0x9ac ; setvbuf + 48
        0x0000099c:    4601        .F      MOV      r1,r0
        0x0000099e:    3124        $1      ADDS     r1,r1,#0x24
        0x000009a0:    2301        .#      MOVS     r3,#1
        0x000009a2:    e005        ..      B        0x9b0 ; setvbuf + 52
        0x000009a4:    4e07        .N      LDR      r6,[pc,#28] ; [0x9c4] = 0xffffff
        0x000009a6:    1e5d        ].      SUBS     r5,r3,#1
        0x000009a8:    42b5        .B      CMP      r5,r6
        0x000009aa:    d301        ..      BCC      0x9b0 ; setvbuf + 52
        0x000009ac:    2001        .       MOVS     r0,#1
        0x000009ae:    bd70        p.      POP      {r4-r6,pc}
        0x000009b0:    6101        .a      STR      r1,[r0,#0x10]
        0x000009b2:    61c3        .a      STR      r3,[r0,#0x1c]
        0x000009b4:    6041        A`      STR      r1,[r0,#4]
        0x000009b6:    210f        .!      MOVS     r1,#0xf
        0x000009b8:    0209        ..      LSLS     r1,r1,#8
        0x000009ba:    438c        .C      BICS     r4,r4,r1
        0x000009bc:    4314        .C      ORRS     r4,r4,r2
        0x000009be:    60c4        .`      STR      r4,[r0,#0xc]
        0x000009c0:    2000        .       MOVS     r0,#0
        0x000009c2:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000009c4:    00ffffff    ....    DCD    16777215
    $t
    .text
    _freopen_locked
    freopen
        0x000009c8:    b5f7        ..      PUSH     {r0-r2,r4-r7,lr}
        0x000009ca:    4616        .F      MOV      r6,r2
        0x000009cc:    460c        .F      MOV      r4,r1
        0x000009ce:    4610        .F      MOV      r0,r2
        0x000009d0:    f000f86e    ..n.    BL       _fclose_internal ; 0xab0
        0x000009d4:    7820         x      LDRB     r0,[r4,#0]
        0x000009d6:    1c61        a.      ADDS     r1,r4,#1
        0x000009d8:    2861        a(      CMP      r0,#0x61
        0x000009da:    d00a        ..      BEQ      0x9f2 ; _freopen_locked + 42
        0x000009dc:    2872        r(      CMP      r0,#0x72
        0x000009de:    d002        ..      BEQ      0x9e6 ; _freopen_locked + 30
        0x000009e0:    2877        w(      CMP      r0,#0x77
        0x000009e2:    d139        9.      BNE      0xa58 ; _freopen_locked + 144
        0x000009e4:    e002        ..      B        0x9ec ; _freopen_locked + 36
        0x000009e6:    2501        .%      MOVS     r5,#1
        0x000009e8:    2400        .$      MOVS     r4,#0
        0x000009ea:    e004        ..      B        0x9f6 ; _freopen_locked + 46
        0x000009ec:    2502        .%      MOVS     r5,#2
        0x000009ee:    2404        .$      MOVS     r4,#4
        0x000009f0:    e001        ..      B        0x9f6 ; _freopen_locked + 46
        0x000009f2:    4d2d        -M      LDR      r5,[pc,#180] ; [0xaa8] = 0x8002
        0x000009f4:    2408        .$      MOVS     r4,#8
        0x000009f6:    2202        ."      MOVS     r2,#2
        0x000009f8:    2303        .#      MOVS     r3,#3
        0x000009fa:    2701        .'      MOVS     r7,#1
        0x000009fc:    7808        .x      LDRB     r0,[r1,#0]
        0x000009fe:    1c49        I.      ADDS     r1,r1,#1
        0x00000a00:    282b        +(      CMP      r0,#0x2b
        0x00000a02:    d006        ..      BEQ      0xa12 ; _freopen_locked + 74
        0x00000a04:    2862        b(      CMP      r0,#0x62
        0x00000a06:    d007        ..      BEQ      0xa18 ; _freopen_locked + 80
        0x00000a08:    3920         9      SUBS     r1,r1,#0x20
        0x00000a0a:    7fc8        ..      LDRB     r0,[r1,#0x1f]
        0x00000a0c:    2874        t(      CMP      r0,#0x74
        0x00000a0e:    d007        ..      BEQ      0xa20 ; _freopen_locked + 88
        0x00000a10:    e008        ..      B        0xa24 ; _freopen_locked + 92
        0x00000a12:    431d        .C      ORRS     r5,r5,r3
        0x00000a14:    4314        .C      ORRS     r4,r4,r2
        0x00000a16:    e7f1        ..      B        0x9fc ; _freopen_locked + 52
        0x00000a18:    2004        .       MOVS     r0,#4
        0x00000a1a:    4305        .C      ORRS     r5,r5,r0
        0x00000a1c:    433c        <C      ORRS     r4,r4,r7
        0x00000a1e:    e7ed        ..      B        0x9fc ; _freopen_locked + 52
        0x00000a20:    2010        .       MOVS     r0,#0x10
        0x00000a22:    4304        .C      ORRS     r4,r4,r0
        0x00000a24:    9800        ..      LDR      r0,[sp,#0]
        0x00000a26:    4621        !F      MOV      r1,r4
        0x00000a28:    f7ffff1e    ....    BL       _sys_open ; 0x868
        0x00000a2c:    1c41        A.      ADDS     r1,r0,#1
        0x00000a2e:    d013        ..      BEQ      0xa58 ; _freopen_locked + 144
        0x00000a30:    2100        .!      MOVS     r1,#0
        0x00000a32:    6131        1a      STR      r1,[r6,#0x10]
        0x00000a34:    6071        q`      STR      r1,[r6,#4]
        0x00000a36:    2101        .!      MOVS     r1,#1
        0x00000a38:    60f5        .`      STR      r5,[r6,#0xc]
        0x00000a3a:    0249        I.      LSLS     r1,r1,#9
        0x00000a3c:    61f1        .a      STR      r1,[r6,#0x1c]
        0x00000a3e:    6170        pa      STR      r0,[r6,#0x14]
        0x00000a40:    0720         .      LSLS     r0,r4,#28
        0x00000a42:    d504        ..      BPL      0xa4e ; _freopen_locked + 134
        0x00000a44:    4630        0F      MOV      r0,r6
        0x00000a46:    2202        ."      MOVS     r2,#2
        0x00000a48:    2100        .!      MOVS     r1,#0
        0x00000a4a:    f000f907    ....    BL       _fseek ; 0xc5c
        0x00000a4e:    6d30        0m      LDR      r0,[r6,#0x50]
        0x00000a50:    4338        8C      ORRS     r0,r0,r7
        0x00000a52:    6530        0e      STR      r0,[r6,#0x50]
        0x00000a54:    4630        0F      MOV      r0,r6
        0x00000a56:    bdfe        ..      POP      {r1-r7,pc}
        0x00000a58:    2000        .       MOVS     r0,#0
        0x00000a5a:    bdfe        ..      POP      {r1-r7,pc}
    fopen
        0x00000a5c:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00000a5e:    460d        .F      MOV      r5,r1
        0x00000a60:    4606        .F      MOV      r6,r0
        0x00000a62:    4c12        .L      LDR      r4,[pc,#72] ; [0xaac] = 0x200000d4
        0x00000a64:    6d20         m      LDR      r0,[r4,#0x50]
        0x00000a66:    07c1        ..      LSLS     r1,r0,#31
        0x00000a68:    d004        ..      BEQ      0xa74 ; fopen + 24
        0x00000a6a:    0841        A.      LSRS     r1,r0,#1
        0x00000a6c:    d004        ..      BEQ      0xa78 ; fopen + 28
        0x00000a6e:    0844        D.      LSRS     r4,r0,#1
        0x00000a70:    0064        d.      LSLS     r4,r4,#1
        0x00000a72:    e7f7        ..      B        0xa64 ; fopen + 8
        0x00000a74:    4622        "F      MOV      r2,r4
        0x00000a76:    e010        ..      B        0xa9a ; fopen + 62
        0x00000a78:    2054        T       MOVS     r0,#0x54
        0x00000a7a:    f000f8bd    ....    BL       malloc ; 0xbf8
        0x00000a7e:    0007        ..      MOVS     r7,r0
        0x00000a80:    d010        ..      BEQ      0xaa4 ; fopen + 72
        0x00000a82:    0879        y.      LSRS     r1,r7,#1
        0x00000a84:    6d20         m      LDR      r0,[r4,#0x50]
        0x00000a86:    0049        I.      LSLS     r1,r1,#1
        0x00000a88:    2201        ."      MOVS     r2,#1
        0x00000a8a:    4311        .C      ORRS     r1,r1,r2
        0x00000a8c:    4308        .C      ORRS     r0,r0,r1
        0x00000a8e:    2154        T!      MOVS     r1,#0x54
        0x00000a90:    6520         e      STR      r0,[r4,#0x50]
        0x00000a92:    4638        8F      MOV      r0,r7
        0x00000a94:    f000f85e    ..^.    BL       __aeabi_memclr4 ; 0xb54
        0x00000a98:    463a        :F      MOV      r2,r7
        0x00000a9a:    4629        )F      MOV      r1,r5
        0x00000a9c:    4630        0F      MOV      r0,r6
        0x00000a9e:    f7ffff93    ....    BL       _freopen_locked ; 0x9c8
        0x00000aa2:    bdf8        ..      POP      {r3-r7,pc}
        0x00000aa4:    2000        .       MOVS     r0,#0
        0x00000aa6:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00000aa8:    00008002    ....    DCD    32770
        0x00000aac:    200000d4    ...     DCD    536871124
    $t
    .text
    _fclose_internal
    fclose
        0x00000ab0:    b5fe        ..      PUSH     {r1-r7,lr}
        0x00000ab2:    4604        .F      MOV      r4,r0
        0x00000ab4:    6946        Fi      LDR      r6,[r0,#0x14]
        0x00000ab6:    6900        .i      LDR      r0,[r0,#0x10]
        0x00000ab8:    4f0f        .O      LDR      r7,[pc,#60] ; [0xaf8] = 0xffffffff
        0x00000aba:    9001        ..      STR      r0,[sp,#4]
        0x00000abc:    68e5        .h      LDR      r5,[r4,#0xc]
        0x00000abe:    2000        .       MOVS     r0,#0
        0x00000ac0:    9000        ..      STR      r0,[sp,#0]
        0x00000ac2:    07a8        ..      LSLS     r0,r5,#30
        0x00000ac4:    d007        ..      BEQ      0xad6 ; _fclose_internal + 38
        0x00000ac6:    4620         F      MOV      r0,r4
        0x00000ac8:    f000f972    ..r.    BL       _fflush ; 0xdb0
        0x00000acc:    4630        0F      MOV      r0,r6
        0x00000ace:    f7fffed5    ....    BL       _sys_close ; 0x87c
        0x00000ad2:    2800        .(      CMP      r0,#0
        0x00000ad4:    da01        ..      BGE      0xada ; _fclose_internal + 42
        0x00000ad6:    4638        8F      MOV      r0,r7
        0x00000ad8:    bdfe        ..      POP      {r1-r7,pc}
        0x00000ada:    0528        (.      LSLS     r0,r5,#20
        0x00000adc:    d502        ..      BPL      0xae4 ; _fclose_internal + 52
        0x00000ade:    9801        ..      LDR      r0,[sp,#4]
        0x00000ae0:    f7ffff14    ....    BL       free ; 0x90c
        0x00000ae4:    214c        L!      MOVS     r1,#0x4c
        0x00000ae6:    4620         F      MOV      r0,r4
        0x00000ae8:    f000f834    ..4.    BL       __aeabi_memclr4 ; 0xb54
        0x00000aec:    6d20         m      LDR      r0,[r4,#0x50]
        0x00000aee:    0840        @.      LSRS     r0,r0,#1
        0x00000af0:    0040        @.      LSLS     r0,r0,#1
        0x00000af2:    6520         e      STR      r0,[r4,#0x50]
        0x00000af4:    9800        ..      LDR      r0,[sp,#0]
        0x00000af6:    bdfe        ..      POP      {r1-r7,pc}
    $d
        0x00000af8:    ffffffff    ....    DCD    4294967295
    $t
    .text
    exit
        0x00000afc:    b510        ..      PUSH     {r4,lr}
        0x00000afe:    4604        .F      MOV      r4,r0
        0x00000b00:    46c0        .F      MOV      r8,r8
        0x00000b02:    46c0        .F      MOV      r8,r8
        0x00000b04:    4620         F      MOV      r0,r4
        0x00000b06:    f7fffb1f    ....    BL       __rt_exit ; 0x148
        0x00000b0a:    bd10        ..      POP      {r4,pc}
    .text
    __rt_SIGRTRED
        0x00000b0c:    b510        ..      PUSH     {r4,lr}
        0x00000b0e:    f000f99d    ....    BL       __rt_SIGRTRED_inner ; 0xe4c
        0x00000b12:    f000f995    ....    BL       __sig_exit ; 0xe40
        0x00000b16:    bd10        ..      POP      {r4,pc}
    .text
    _memset_w
        0x00000b18:    e001        ..      B        0xb1e ; _memset_w + 6
        0x00000b1a:    c004        ..      STM      r0!,{r2}
        0x00000b1c:    1f09        ..      SUBS     r1,r1,#4
        0x00000b1e:    2904        .)      CMP      r1,#4
        0x00000b20:    d2fb        ..      BCS      0xb1a ; _memset_w + 2
        0x00000b22:    078b        ..      LSLS     r3,r1,#30
        0x00000b24:    d501        ..      BPL      0xb2a ; _memset_w + 18
        0x00000b26:    8002        ..      STRH     r2,[r0,#0]
        0x00000b28:    1c80        ..      ADDS     r0,r0,#2
        0x00000b2a:    07c9        ..      LSLS     r1,r1,#31
        0x00000b2c:    d000        ..      BEQ      0xb30 ; _memset_w + 24
        0x00000b2e:    7002        .p      STRB     r2,[r0,#0]
        0x00000b30:    4770        pG      BX       lr
    _memset
        0x00000b32:    2900        .)      CMP      r1,#0
        0x00000b34:    d00b        ..      BEQ      0xb4e ; _memset + 28
        0x00000b36:    07c3        ..      LSLS     r3,r0,#31
        0x00000b38:    d002        ..      BEQ      0xb40 ; _memset + 14
        0x00000b3a:    7002        .p      STRB     r2,[r0,#0]
        0x00000b3c:    1c40        @.      ADDS     r0,r0,#1
        0x00000b3e:    1e49        I.      SUBS     r1,r1,#1
        0x00000b40:    2902        .)      CMP      r1,#2
        0x00000b42:    d304        ..      BCC      0xb4e ; _memset + 28
        0x00000b44:    0783        ..      LSLS     r3,r0,#30
        0x00000b46:    d502        ..      BPL      0xb4e ; _memset + 28
        0x00000b48:    8002        ..      STRH     r2,[r0,#0]
        0x00000b4a:    1c80        ..      ADDS     r0,r0,#2
        0x00000b4c:    1e89        ..      SUBS     r1,r1,#2
        0x00000b4e:    e7e3        ..      B        _memset_w ; 0xb18
    __aeabi_memclr
    __rt_memclr
        0x00000b50:    2200        ."      MOVS     r2,#0
        0x00000b52:    e7ee        ..      B        _memset ; 0xb32
    __aeabi_memclr4
    __aeabi_memclr8
    __rt_memclr_w
        0x00000b54:    2200        ."      MOVS     r2,#0
        0x00000b56:    e7df        ..      B        _memset_w ; 0xb18
    .text
    __user_libspace
    __user_perproc_libspace
    __user_perthread_libspace
        0x00000b58:    4800        .H      LDR      r0,[pc,#0] ; [0xb5c] = 0x200001d0
        0x00000b5a:    4770        pG      BX       lr
    $d
        0x00000b5c:    200001d0    ...     DCD    536871376
    $t
    .text
    __I$use$semihosting
    __use_no_semihosting_swi
        0x00000b60:    4770        pG      BX       lr
    .text
    __semihosting_library_function
        0x00000b62:    0000        ..      MOVS     r0,r0
    .text
    __rt_heap_descriptor
        0x00000b64:    4800        .H      LDR      r0,[pc,#0] ; [0xb68] = 0x200001d8
        0x00000b66:    4770        pG      BX       lr
    $d
        0x00000b68:    200001d8    ...     DCD    536871384
    $t
    .text
    __use_no_heap
        0x00000b6c:    4770        pG      BX       lr
    __heap$guard
        0x00000b6e:    4770        pG      BX       lr
    .text
    _terminate_user_alloc
        0x00000b70:    4770        pG      BX       lr
    _init_user_alloc
        0x00000b72:    4770        pG      BX       lr
    __Heap_Full
        0x00000b74:    b538        8.      PUSH     {r3-r5,lr}
        0x00000b76:    4604        .F      MOV      r4,r0
        0x00000b78:    460a        .F      MOV      r2,r1
        0x00000b7a:    2000        .       MOVS     r0,#0
        0x00000b7c:    4669        iF      MOV      r1,sp
        0x00000b7e:    46c0        .F      MOV      r8,r8
        0x00000b80:    46c0        .F      MOV      r8,r8
        0x00000b82:    2800        .(      CMP      r0,#0
        0x00000b84:    d005        ..      BEQ      0xb92 ; __Heap_Full + 30
        0x00000b86:    4602        .F      MOV      r2,r0
        0x00000b88:    4620         F      MOV      r0,r4
        0x00000b8a:    9900        ..      LDR      r1,[sp,#0]
        0x00000b8c:    f000f9a7    ....    BL       __Heap_ProvideMemory ; 0xede
        0x00000b90:    2001        .       MOVS     r0,#1
        0x00000b92:    bd38        8.      POP      {r3-r5,pc}
    __Heap_Broken
        0x00000b94:    b510        ..      PUSH     {r4,lr}
        0x00000b96:    2001        .       MOVS     r0,#1
        0x00000b98:    f000f9f6    ....    BL       __rt_SIGRTMEM ; 0xf88
        0x00000b9c:    bd10        ..      POP      {r4,pc}
    _init_alloc
        0x00000b9e:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00000ba0:    46c0        .F      MOV      r8,r8
        0x00000ba2:    46c0        .F      MOV      r8,r8
        0x00000ba4:    4605        .F      MOV      r5,r0
        0x00000ba6:    2000        .       MOVS     r0,#0
        0x00000ba8:    460c        .F      MOV      r4,r1
        0x00000baa:    2010        .       MOVS     r0,#0x10
        0x00000bac:    46c0        .F      MOV      r8,r8
        0x00000bae:    4606        .F      MOV      r6,r0
        0x00000bb0:    19a8        ..      ADDS     r0,r5,r6
        0x00000bb2:    42a0        .B      CMP      r0,r4
        0x00000bb4:    d90d        ..      BLS      0xbd2 ; _init_alloc + 52
        0x00000bb6:    4632        2F      MOV      r2,r6
        0x00000bb8:    4669        iF      MOV      r1,sp
        0x00000bba:    2000        .       MOVS     r0,#0
        0x00000bbc:    46c0        .F      MOV      r8,r8
        0x00000bbe:    46c0        .F      MOV      r8,r8
        0x00000bc0:    0007        ..      MOVS     r7,r0
        0x00000bc2:    d101        ..      BNE      0xbc8 ; _init_alloc + 42
        0x00000bc4:    f000f9e0    ....    BL       __rt_SIGRTMEM ; 0xf88
        0x00000bc8:    9800        ..      LDR      r0,[sp,#0]
        0x00000bca:    42a0        .B      CMP      r0,r4
        0x00000bcc:    d000        ..      BEQ      0xbd0 ; _init_alloc + 50
        0x00000bce:    4605        .F      MOV      r5,r0
        0x00000bd0:    19c4        ..      ADDS     r4,r0,r7
        0x00000bd2:    f7ffffc7    ....    BL       __rt_heap_descriptor ; 0xb64
