Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00000bd6:    1df6        ..      ADDS     r6,r6,#7
        0x00000bd8:    4607        .F      MOV      r7,r0
        0x00000bda:    6005        .`      STR      r5,[r0,#0]
        0x00000bdc:    08f0        ..      LSRS     r0,r6,#3
        0x00000bde:    00c0        ..      LSLS     r0,r0,#3
        0x00000be0:    1946        F.      ADDS     r6,r0,r5
        0x00000be2:    4628        (F      MOV      r0,r5
        0x00000be4:    f000f974    ..t.    BL       __Heap_Initialize ; 0xed0
        0x00000be8:    42b4        .B      CMP      r4,r6
        0x00000bea:    d004        ..      BEQ      0xbf6 ; _init_alloc + 88
        0x00000bec:    4631        1F      MOV      r1,r6
        0x00000bee:    6838        8h      LDR      r0,[r7,#0]
        0x00000bf0:    1ba2        ..      SUBS     r2,r4,r6
        0x00000bf2:    f000f974    ..t.    BL       __Heap_ProvideMemory ; 0xede
        0x00000bf6:    bdf8        ..      POP      {r3-r7,pc}
    .text
    malloc
        0x00000bf8:    b570        p.      PUSH     {r4-r6,lr}
        0x00000bfa:    4606        .F      MOV      r6,r0
        0x00000bfc:    f7ffffb2    ....    BL       __rt_heap_descriptor ; 0xb64
        0x00000c00:    6805        .h      LDR      r5,[r0,#0]
        0x00000c02:    4630        0F      MOV      r0,r6
        0x00000c04:    300b        .0      ADDS     r0,r0,#0xb
        0x00000c06:    08c4        ..      LSRS     r4,r0,#3
        0x00000c08:    00e4        ..      LSLS     r4,r4,#3
        0x00000c0a:    42b4        .B      CMP      r4,r6
        0x00000c0c:    d801        ..      BHI      0xc12 ; malloc + 26
        0x00000c0e:    2000        .       MOVS     r0,#0
        0x00000c10:    bd70        p.      POP      {r4-r6,pc}
        0x00000c12:    6868        hh      LDR      r0,[r5,#4]
        0x00000c14:    462a        *F      MOV      r2,r5
        0x00000c16:    2800        .(      CMP      r0,#0
        0x00000c18:    d018        ..      BEQ      0xc4c ; malloc + 84
        0x00000c1a:    6801        .h      LDR      r1,[r0,#0]
        0x00000c1c:    42a1        .B      CMP      r1,r4
        0x00000c1e:    d311        ..      BCC      0xc44 ; malloc + 76
        0x00000c20:    460b        .F      MOV      r3,r1
        0x00000c22:    4621        !F      MOV      r1,r4
        0x00000c24:    3108        .1      ADDS     r1,r1,#8
        0x00000c26:    428b        .B      CMP      r3,r1
        0x00000c28:    d308        ..      BCC      0xc3c ; malloc + 68
        0x00000c2a:    6843        Ch      LDR      r3,[r0,#4]
        0x00000c2c:    1901        ..      ADDS     r1,r0,r4
        0x00000c2e:    604b        K`      STR      r3,[r1,#4]
        0x00000c30:    6803        .h      LDR      r3,[r0,#0]
        0x00000c32:    1b1b        ..      SUBS     r3,r3,r4
        0x00000c34:    600b        .`      STR      r3,[r1,#0]
        0x00000c36:    6051        Q`      STR      r1,[r2,#4]
        0x00000c38:    6004        .`      STR      r4,[r0,#0]
        0x00000c3a:    e001        ..      B        0xc40 ; malloc + 72
        0x00000c3c:    6841        Ah      LDR      r1,[r0,#4]
        0x00000c3e:    6051        Q`      STR      r1,[r2,#4]
        0x00000c40:    1d00        ..      ADDS     r0,r0,#4
        0x00000c42:    bd70        p.      POP      {r4-r6,pc}
        0x00000c44:    4602        .F      MOV      r2,r0
        0x00000c46:    6840        @h      LDR      r0,[r0,#4]
        0x00000c48:    2800        .(      CMP      r0,#0
        0x00000c4a:    d1e6        ..      BNE      0xc1a ; malloc + 34
        0x00000c4c:    4621        !F      MOV      r1,r4
        0x00000c4e:    4628        (F      MOV      r0,r5
        0x00000c50:    f7ffff90    ....    BL       __Heap_Full ; 0xb74
        0x00000c54:    2800        .(      CMP      r0,#0
        0x00000c56:    d1dc        ..      BNE      0xc12 ; malloc + 26
        0x00000c58:    bd70        p.      POP      {r4-r6,pc}
        0x00000c5a:    0000        ..      MOVS     r0,r0
    .text
    _fseek
    fseek
        0x00000c5c:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00000c5e:    4604        .F      MOV      r4,r0
        0x00000c60:    4616        .F      MOV      r6,r2
        0x00000c62:    460d        .F      MOV      r5,r1
        0x00000c64:    6947        Gi      LDR      r7,[r0,#0x14]
        0x00000c66:    7b00        .{      LDRB     r0,[r0,#0xc]
        0x00000c68:    0780        ..      LSLS     r0,r0,#30
        0x00000c6a:    d030        0.      BEQ      0xcce ; _fseek + 114
        0x00000c6c:    4638        8F      MOV      r0,r7
        0x00000c6e:    f7fffe1a    ....    BL       _sys_istty ; 0x8a6
        0x00000c72:    2800        .(      CMP      r0,#0
        0x00000c74:    d12b        +.      BNE      0xcce ; _fseek + 114
        0x00000c76:    4632        2F      MOV      r2,r6
        0x00000c78:    2610        .&      MOVS     r6,#0x10
        0x00000c7a:    2a00        .*      CMP      r2,#0
        0x00000c7c:    d025        %.      BEQ      0xcca ; _fseek + 110
        0x00000c7e:    2a01        .*      CMP      r2,#1
        0x00000c80:    d002        ..      BEQ      0xc88 ; _fseek + 44
        0x00000c82:    2a02        .*      CMP      r2,#2
        0x00000c84:    d123        #.      BNE      0xcce ; _fseek + 114
        0x00000c86:    e004        ..      B        0xc92 ; _fseek + 54
        0x00000c88:    4620         F      MOV      r0,r4
        0x00000c8a:    f000f942    ..B.    BL       _ftell_internal ; 0xf12
        0x00000c8e:    1945        E.      ADDS     r5,r0,r5
        0x00000c90:    e01b        ..      B        0xcca ; _fseek + 110
        0x00000c92:    4638        8F      MOV      r0,r7
        0x00000c94:    f7fffe15    ....    BL       _sys_flen ; 0x8c2
        0x00000c98:    68e1        .h      LDR      r1,[r4,#0xc]
        0x00000c9a:    4331        1C      ORRS     r1,r1,r6
        0x00000c9c:    2800        .(      CMP      r0,#0
        0x00000c9e:    60e1        .`      STR      r1,[r4,#0xc]
        0x00000ca0:    da04        ..      BGE      0xcac ; _fseek + 80
        0x00000ca2:    4620         F      MOV      r0,r4
        0x00000ca4:    f000f854    ..T.    BL       _seterr ; 0xd50
        0x00000ca8:    2001        .       MOVS     r0,#1
        0x00000caa:    bdf8        ..      POP      {r3-r7,pc}
        0x00000cac:    03c9        ..      LSLS     r1,r1,#15
        0x00000cae:    d50b        ..      BPL      0xcc8 ; _fseek + 108
        0x00000cb0:    6862        bh      LDR      r2,[r4,#4]
        0x00000cb2:    6ae1        .j      LDR      r1,[r4,#0x2c]
        0x00000cb4:    4291        .B      CMP      r1,r2
        0x00000cb6:    d800        ..      BHI      0xcba ; _fseek + 94
        0x00000cb8:    4611        .F      MOV      r1,r2
        0x00000cba:    69a2        .i      LDR      r2,[r4,#0x18]
        0x00000cbc:    1889        ..      ADDS     r1,r1,r2
        0x00000cbe:    6922        "i      LDR      r2,[r4,#0x10]
        0x00000cc0:    1a89        ..      SUBS     r1,r1,r2
        0x00000cc2:    4281        .B      CMP      r1,r0
        0x00000cc4:    dd00        ..      BLE      0xcc8 ; _fseek + 108
        0x00000cc6:    4608        .F      MOV      r0,r1
        0x00000cc8:    182d        -.      ADDS     r5,r5,r0
        0x00000cca:    2d00        .-      CMP      r5,#0
        0x00000ccc:    da01        ..      BGE      0xcd2 ; _fseek + 118
        0x00000cce:    2002        .       MOVS     r0,#2
        0x00000cd0:    bdf8        ..      POP      {r3-r7,pc}
        0x00000cd2:    6ae1        .j      LDR      r1,[r4,#0x2c]
        0x00000cd4:    6860        `h      LDR      r0,[r4,#4]
        0x00000cd6:    68e2        .h      LDR      r2,[r4,#0xc]
        0x00000cd8:    4281        .B      CMP      r1,r0
        0x00000cda:    d206        ..      BCS      0xcea ; _fseek + 142
        0x00000cdc:    0391        ..      LSLS     r1,r2,#14
        0x00000cde:    62e0        .b      STR      r0,[r4,#0x2c]
        0x00000ce0:    d503        ..      BPL      0xcea ; _fseek + 142
        0x00000ce2:    2101        .!      MOVS     r1,#1
        0x00000ce4:    0449        I.      LSLS     r1,r1,#17
        0x00000ce6:    438a        .C      BICS     r2,r2,r1
        0x00000ce8:    4332        2C      ORRS     r2,r2,r6
        0x00000cea:    69a6        .i      LDR      r6,[r4,#0x18]
        0x00000cec:    42ae        .B      CMP      r6,r5
        0x00000cee:    dc11        ..      BGT      0xd14 ; _fseek + 184
        0x00000cf0:    6ae1        .j      LDR      r1,[r4,#0x2c]
        0x00000cf2:    4281        .B      CMP      r1,r0
        0x00000cf4:    d901        ..      BLS      0xcfa ; _fseek + 158
        0x00000cf6:    460b        .F      MOV      r3,r1
        0x00000cf8:    e000        ..      B        0xcfc ; _fseek + 160
        0x00000cfa:    4603        .F      MOV      r3,r0
        0x00000cfc:    199f        ..      ADDS     r7,r3,r6
        0x00000cfe:    6923        #i      LDR      r3,[r4,#0x10]
        0x00000d00:    1aff        ..      SUBS     r7,r7,r3
        0x00000d02:    42af        .B      CMP      r7,r5
        0x00000d04:    dd06        ..      BLE      0xd14 ; _fseek + 184
        0x00000d06:    4281        .B      CMP      r1,r0
        0x00000d08:    d901        ..      BLS      0xd0e ; _fseek + 178
        0x00000d0a:    460f        .F      MOV      r7,r1
        0x00000d0c:    e000        ..      B        0xd10 ; _fseek + 180
        0x00000d0e:    4607        .F      MOV      r7,r0
        0x00000d10:    429f        .B      CMP      r7,r3
        0x00000d12:    d106        ..      BNE      0xd22 ; _fseek + 198
        0x00000d14:    2020                MOVS     r0,#0x20
        0x00000d16:    4302        .C      ORRS     r2,r2,r0
        0x00000d18:    2000        .       MOVS     r0,#0
        0x00000d1a:    60a0        .`      STR      r0,[r4,#8]
        0x00000d1c:    62a5        .b      STR      r5,[r4,#0x28]
        0x00000d1e:    6020         `      STR      r0,[r4,#0]
        0x00000d20:    e00d        ..      B        0xd3e ; _fseek + 226
        0x00000d22:    1bad        ..      SUBS     r5,r5,r6
        0x00000d24:    69e6        .i      LDR      r6,[r4,#0x1c]
        0x00000d26:    1bae        ..      SUBS     r6,r5,r6
        0x00000d28:    4281        .B      CMP      r1,r0
        0x00000d2a:    60a6        .`      STR      r6,[r4,#8]
        0x00000d2c:    d900        ..      BLS      0xd30 ; _fseek + 212
        0x00000d2e:    4608        .F      MOV      r0,r1
        0x00000d30:    1ac0        ..      SUBS     r0,r0,r3
        0x00000d32:    1a28        (.      SUBS     r0,r5,r0
        0x00000d34:    6020         `      STR      r0,[r4,#0]
        0x00000d36:    1958        X.      ADDS     r0,r3,r5
        0x00000d38:    6060        ``      STR      r0,[r4,#4]
        0x00000d3a:    2020                MOVS     r0,#0x20
        0x00000d3c:    4382        .C      BICS     r2,r2,r0
        0x00000d3e:    4803        .H      LDR      r0,[pc,#12] ; [0xd4c] = 0xffd7cfbf
        0x00000d40:    4002        .@      ANDS     r2,r2,r0
        0x00000d42:    2000        .       MOVS     r0,#0
        0x00000d44:    60e2        .`      STR      r2,[r4,#0xc]
        0x00000d46:    3440        @4      ADDS     r4,r4,#0x40
        0x00000d48:    7220         r      STRB     r0,[r4,#8]
        0x00000d4a:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00000d4c:    ffd7cfbf    ....    DCD    4292333503
    $t
    .text
    _seterr
        0x00000d50:    68c1        .h      LDR      r1,[r0,#0xc]
        0x00000d52:    2280        ."      MOVS     r2,#0x80
        0x00000d54:    4311        .C      ORRS     r1,r1,r2
        0x00000d56:    0392        ..      LSLS     r2,r2,#14
        0x00000d58:    4391        .C      BICS     r1,r1,r2
        0x00000d5a:    60c1        .`      STR      r1,[r0,#0xc]
        0x00000d5c:    2100        .!      MOVS     r1,#0
        0x00000d5e:    6081        .`      STR      r1,[r0,#8]
        0x00000d60:    6001        .`      STR      r1,[r0,#0]
        0x00000d62:    4770        pG      BX       lr
    _writebuf
        0x00000d64:    b5f7        ..      PUSH     {r0-r2,r4-r7,lr}
        0x00000d66:    4614        .F      MOV      r4,r2
        0x00000d68:    460e        .F      MOV      r6,r1
        0x00000d6a:    4833        3H      LDR      r0,[pc,#204] ; [0xe38] = 0x20010
        0x00000d6c:    68d5        .h      LDR      r5,[r2,#0xc]
        0x00000d6e:    6957        Wi      LDR      r7,[r2,#0x14]
        0x00000d70:    4205        .B      TST      r5,r0
        0x00000d72:    d009        ..      BEQ      0xd88 ; _writebuf + 36
        0x00000d74:    4638        8F      MOV      r0,r7
        0x00000d76:    69a1        .i      LDR      r1,[r4,#0x18]
        0x00000d78:    f7fffd9b    ....    BL       _sys_seek ; 0x8b2
        0x00000d7c:    2800        .(      CMP      r0,#0
        0x00000d7e:    db11        ..      BLT      0xda4 ; _writebuf + 64
        0x00000d80:    482d        -H      LDR      r0,[pc,#180] ; [0xe38] = 0x20010
        0x00000d82:    43c0        .C      MVNS     r0,r0
        0x00000d84:    4005        .@      ANDS     r5,r5,r0
        0x00000d86:    60e5        .`      STR      r5,[r4,#0xc]
        0x00000d88:    462b        +F      MOV      r3,r5
        0x00000d8a:    4632        2F      MOV      r2,r6
        0x00000d8c:    4638        8F      MOV      r0,r7
        0x00000d8e:    9900        ..      LDR      r1,[sp,#0]
        0x00000d90:    f7fffd7a    ..z.    BL       _sys_write ; 0x888
        0x00000d94:    0042        B.      LSLS     r2,r0,#1
        0x00000d96:    69a1        .i      LDR      r1,[r4,#0x18]
        0x00000d98:    0852        R.      LSRS     r2,r2,#1
        0x00000d9a:    1ab2        ..      SUBS     r2,r6,r2
        0x00000d9c:    1889        ..      ADDS     r1,r1,r2
        0x00000d9e:    2800        .(      CMP      r0,#0
        0x00000da0:    61a1        .a      STR      r1,[r4,#0x18]
        0x00000da2:    d004        ..      BEQ      0xdae ; _writebuf + 74
        0x00000da4:    4620         F      MOV      r0,r4
        0x00000da6:    f7ffffd3    ....    BL       _seterr ; 0xd50
        0x00000daa:    2000        .       MOVS     r0,#0
        0x00000dac:    43c0        .C      MVNS     r0,r0
        0x00000dae:    bdfe        ..      POP      {r1-r7,pc}
    _fflush
        0x00000db0:    b570        p.      PUSH     {r4-r6,lr}
        0x00000db2:    4604        .F      MOV      r4,r0
        0x00000db4:    6905        .i      LDR      r5,[r0,#0x10]
        0x00000db6:    6ac0        .j      LDR      r0,[r0,#0x2c]
        0x00000db8:    6861        ah      LDR      r1,[r4,#4]
        0x00000dba:    4288        .B      CMP      r0,r1
        0x00000dbc:    d800        ..      BHI      0xdc0 ; _fflush + 16
        0x00000dbe:    4608        .F      MOV      r0,r1
        0x00000dc0:    68e1        .h      LDR      r1,[r4,#0xc]
        0x00000dc2:    2205        ."      MOVS     r2,#5
        0x00000dc4:    04d2        ..      LSLS     r2,r2,#19
        0x00000dc6:    4391        .C      BICS     r1,r1,r2
        0x00000dc8:    60e1        .`      STR      r1,[r4,#0xc]
        0x00000dca:    03c9        ..      LSLS     r1,r1,#15
        0x00000dcc:    d514        ..      BPL      0xdf8 ; _fflush + 72
        0x00000dce:    42a8        .B      CMP      r0,r5
        0x00000dd0:    d009        ..      BEQ      0xde6 ; _fflush + 54
        0x00000dd2:    4622        "F      MOV      r2,r4
        0x00000dd4:    1b41        A.      SUBS     r1,r0,r5
        0x00000dd6:    4628        (F      MOV      r0,r5
        0x00000dd8:    f7ffffc4    ....    BL       _writebuf ; 0xd64
        0x00000ddc:    2800        .(      CMP      r0,#0
        0x00000dde:    d002        ..      BEQ      0xde6 ; _fflush + 54
        0x00000de0:    2000        .       MOVS     r0,#0
        0x00000de2:    43c0        .C      MVNS     r0,r0
        0x00000de4:    bd70        p.      POP      {r4-r6,pc}
        0x00000de6:    62e5        .b      STR      r5,[r4,#0x2c]
        0x00000de8:    2000        .       MOVS     r0,#0
        0x00000dea:    6065        e`      STR      r5,[r4,#4]
        0x00000dec:    60a0        .`      STR      r0,[r4,#8]
        0x00000dee:    68e0        .h      LDR      r0,[r4,#0xc]
        0x00000df0:    2101        .!      MOVS     r1,#1
        0x00000df2:    0409        ..      LSLS     r1,r1,#16
        0x00000df4:    4388        .C      BICS     r0,r0,r1
        0x00000df6:    60e0        .`      STR      r0,[r4,#0xc]
        0x00000df8:    2000        .       MOVS     r0,#0
        0x00000dfa:    bd70        p.      POP      {r4-r6,pc}
    _deferredlazyseek
        0x00000dfc:    b510        ..      PUSH     {r4,lr}
        0x00000dfe:    4604        .F      MOV      r4,r0
        0x00000e00:    68c0        .h      LDR      r0,[r0,#0xc]
        0x00000e02:    2120         !      MOVS     r1,#0x20
        0x00000e04:    4388        .C      BICS     r0,r0,r1
        0x00000e06:    60e0        .`      STR      r0,[r4,#0xc]
        0x00000e08:    6aa1        .j      LDR      r1,[r4,#0x28]
        0x00000e0a:    69a0        .i      LDR      r0,[r4,#0x18]
        0x00000e0c:    4288        .B      CMP      r0,r1
        0x00000e0e:    d00e        ..      BEQ      0xe2e ; _deferredlazyseek + 50
        0x00000e10:    4620         F      MOV      r0,r4
        0x00000e12:    f7ffffcd    ....    BL       _fflush ; 0xdb0
        0x00000e16:    68e0        .h      LDR      r0,[r4,#0xc]
        0x00000e18:    2103        .!      MOVS     r1,#3
        0x00000e1a:    0309        ..      LSLS     r1,r1,#12
        0x00000e1c:    4388        .C      BICS     r0,r0,r1
        0x00000e1e:    2110        .!      MOVS     r1,#0x10
        0x00000e20:    4308        .C      ORRS     r0,r0,r1
        0x00000e22:    60e0        .`      STR      r0,[r4,#0xc]
        0x00000e24:    6aa0        .j      LDR      r0,[r4,#0x28]
        0x00000e26:    61a0        .a      STR      r0,[r4,#0x18]
        0x00000e28:    6920         i      LDR      r0,[r4,#0x10]
        0x00000e2a:    62e0        .b      STR      r0,[r4,#0x2c]
        0x00000e2c:    6060        ``      STR      r0,[r4,#4]
        0x00000e2e:    4903        .I      LDR      r1,[pc,#12] ; [0xe3c] = 0xffffbfbf
        0x00000e30:    68e0        .h      LDR      r0,[r4,#0xc]
        0x00000e32:    4008        .@      ANDS     r0,r0,r1
        0x00000e34:    60e0        .`      STR      r0,[r4,#0xc]
        0x00000e36:    bd10        ..      POP      {r4,pc}
    $d
        0x00000e38:    00020010    ....    DCD    131088
        0x00000e3c:    ffffbfbf    ....    DCD    4294950847
    $t
    .text
    __sig_exit
        0x00000e40:    b510        ..      PUSH     {r4,lr}
        0x00000e42:    2800        .(      CMP      r0,#0
        0x00000e44:    d001        ..      BEQ      0xe4a ; __sig_exit + 10
        0x00000e46:    f000f83d    ..=.    BL       _sys_exit ; 0xec4
        0x00000e4a:    bd10        ..      POP      {r4,pc}
    .text
    __rt_SIGRTRED_inner
        0x00000e4c:    b510        ..      PUSH     {r4,lr}
        0x00000e4e:    4601        .F      MOV      r1,r0
        0x00000e50:    a002        ..      ADR      r0,{pc}+0xc ; 0xe5c
        0x00000e52:    f000f87f    ....    BL       __default_signal_display ; 0xf54
        0x00000e56:    2001        .       MOVS     r0,#1
        0x00000e58:    bd10        ..      POP      {r4,pc}
    $d
        0x00000e5a:    0000        ..      DCW    0
        0x00000e5c:    52474953    SIGR    DCD    1380403539
        0x00000e60:    44455254    TRED    DCD    1145393748
        0x00000e64:    6552203a    : Re    DCD    1699881018
        0x00000e68:    65726964    dire    DCD    1701996900
        0x00000e6c:    203a7463    ct:     DCD    540701795
        0x00000e70:    276e6163    can'    DCD    661545315
        0x00000e74:    706f2074    t op    DCD    1886330996
        0x00000e78:    203a6e65    en:     DCD    540700261
        0x00000e7c:    00000000    ....    DCD    0
    $t
    .text
    strlen
        0x00000e80:    b530        0.      PUSH     {r4,r5,lr}
        0x00000e82:    1c44        D.      ADDS     r4,r0,#1
        0x00000e84:    e003        ..      B        0xe8e ; strlen + 14
        0x00000e86:    7801        .x      LDRB     r1,[r0,#0]
        0x00000e88:    1c40        @.      ADDS     r0,r0,#1
        0x00000e8a:    2900        .)      CMP      r1,#0
        0x00000e8c:    d00d        ..      BEQ      0xeaa ; strlen + 42
        0x00000e8e:    0781        ..      LSLS     r1,r0,#30
        0x00000e90:    d1f9        ..      BNE      0xe86 ; strlen + 6
        0x00000e92:    4b0b        .K      LDR      r3,[pc,#44] ; [0xec0] = 0x1010101
        0x00000e94:    01dd        ..      LSLS     r5,r3,#7
        0x00000e96:    c804        ..      LDM      r0!,{r2}
        0x00000e98:    1ad1        ..      SUBS     r1,r2,r3
        0x00000e9a:    4391        .C      BICS     r1,r1,r2
        0x00000e9c:    4029        )@      ANDS     r1,r1,r5
        0x00000e9e:    d0fa        ..      BEQ      0xe96 ; strlen + 22
        0x00000ea0:    1b00        ..      SUBS     r0,r0,r4
        0x00000ea2:    060a        ..      LSLS     r2,r1,#24
        0x00000ea4:    d003        ..      BEQ      0xeae ; strlen + 46
        0x00000ea6:    1ec0        ..      SUBS     r0,r0,#3
        0x00000ea8:    bd30        0.      POP      {r4,r5,pc}
        0x00000eaa:    1b00        ..      SUBS     r0,r0,r4
        0x00000eac:    bd30        0.      POP      {r4,r5,pc}
        0x00000eae:    040a        ..      LSLS     r2,r1,#16
        0x00000eb0:    d001        ..      BEQ      0xeb6 ; strlen + 54
        0x00000eb2:    1e80        ..      SUBS     r0,r0,#2
        0x00000eb4:    bd30        0.      POP      {r4,r5,pc}
        0x00000eb6:    0209        ..      LSLS     r1,r1,#8
        0x00000eb8:    d0fc        ..      BEQ      0xeb4 ; strlen + 52
        0x00000eba:    1e40        @.      SUBS     r0,r0,#1
        0x00000ebc:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x00000ebe:    0000        ..      DCW    0
        0x00000ec0:    01010101    ....    DCD    16843009
    $t
    .text
    _sys_exit
        0x00000ec4:    4901        .I      LDR      r1,[pc,#4] ; [0xecc] = 0x20026
        0x00000ec6:    2018        .       MOVS     r0,#0x18
        0x00000ec8:    beab        ..      BKPT     #0xab
        0x00000eca:    e7fe        ..      B        0xeca ; _sys_exit + 6
    $d
        0x00000ecc:    00020026    &...    DCD    131110
    $t
    .text
    __Heap_Initialize
        0x00000ed0:    2100        .!      MOVS     r1,#0
        0x00000ed2:    6001        .`      STR      r1,[r0,#0]
        0x00000ed4:    6041        A`      STR      r1,[r0,#4]
        0x00000ed6:    6080        .`      STR      r0,[r0,#8]
        0x00000ed8:    4770        pG      BX       lr
    __Heap_DescSize
        0x00000eda:    2010        .       MOVS     r0,#0x10
        0x00000edc:    4770        pG      BX       lr
    .text
    __Heap_ProvideMemory
        0x00000ede:    b510        ..      PUSH     {r4,lr}
        0x00000ee0:    4603        .F      MOV      r3,r0
        0x00000ee2:    6840        @h      LDR      r0,[r0,#4]
        0x00000ee4:    e001        ..      B        0xeea ; __Heap_ProvideMemory + 12
        0x00000ee6:    4603        .F      MOV      r3,r0
        0x00000ee8:    6840        @h      LDR      r0,[r0,#4]
        0x00000eea:    2800        .(      CMP      r0,#0
        0x00000eec:    d001        ..      BEQ      0xef2 ; __Heap_ProvideMemory + 20
        0x00000eee:    4288        .B      CMP      r0,r1
        0x00000ef0:    d3f9        ..      BCC      0xee6 ; __Heap_ProvideMemory + 8
        0x00000ef2:    6818        .h      LDR      r0,[r3,#0]
        0x00000ef4:    18c3        ..      ADDS     r3,r0,r3
