Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00000ef6:    428b        .B      CMP      r3,r1
        0x00000ef8:    d006        ..      BEQ      0xf08 ; __Heap_ProvideMemory + 42
        0x00000efa:    1ccb        ..      ADDS     r3,r1,#3
        0x00000efc:    08d8        ..      LSRS     r0,r3,#3
        0x00000efe:    00c0        ..      LSLS     r0,r0,#3
        0x00000f00:    1d00        ..      ADDS     r0,r0,#4
        0x00000f02:    1a41        A.      SUBS     r1,r0,r1
        0x00000f04:    1a52        R.      SUBS     r2,r2,r1
        0x00000f06:    4601        .F      MOV      r1,r0
        0x00000f08:    1d08        ..      ADDS     r0,r1,#4
        0x00000f0a:    600a        .`      STR      r2,[r1,#0]
        0x00000f0c:    f7fffcfe    ....    BL       free ; 0x90c
        0x00000f10:    bd10        ..      POP      {r4,pc}
    .text
    _ftell_internal
    ftell
        0x00000f12:    b510        ..      PUSH     {r4,lr}
        0x00000f14:    4601        .F      MOV      r1,r0
        0x00000f16:    68c2        .h      LDR      r2,[r0,#0xc]
        0x00000f18:    0790        ..      LSLS     r0,r2,#30
        0x00000f1a:    d003        ..      BEQ      0xf24 ; _ftell_internal + 18
        0x00000f1c:    0690        ..      LSLS     r0,r2,#26
        0x00000f1e:    d507        ..      BPL      0xf30 ; _ftell_internal + 30
        0x00000f20:    6a88        .j      LDR      r0,[r1,#0x28]
        0x00000f22:    e00a        ..      B        0xf3a ; _ftell_internal + 40
        0x00000f24:    f000f83c    ..<.    BL       __aeabi_errno_addr ; 0xfa0
        0x00000f28:    2101        .!      MOVS     r1,#1
        0x00000f2a:    6001        .`      STR      r1,[r0,#0]
        0x00000f2c:    1e88        ..      SUBS     r0,r1,#2
        0x00000f2e:    bd10        ..      POP      {r4,pc}
        0x00000f30:    698b        .i      LDR      r3,[r1,#0x18]
        0x00000f32:    6848        Hh      LDR      r0,[r1,#4]
        0x00000f34:    18c0        ..      ADDS     r0,r0,r3
        0x00000f36:    690b        .i      LDR      r3,[r1,#0x10]
        0x00000f38:    1ac0        ..      SUBS     r0,r0,r3
        0x00000f3a:    3140        @1      ADDS     r1,r1,#0x40
        0x00000f3c:    7a0b        .z      LDRB     r3,[r1,#8]
        0x00000f3e:    2b00        .+      CMP      r3,#0
        0x00000f40:    d002        ..      BEQ      0xf48 ; _ftell_internal + 54
        0x00000f42:    7a49        Iz      LDRB     r1,[r1,#9]
        0x00000f44:    1a40        @.      SUBS     r0,r0,r1
        0x00000f46:    bd10        ..      POP      {r4,pc}
        0x00000f48:    0311        ..      LSLS     r1,r2,#12
        0x00000f4a:    d5fc        ..      BPL      0xf46 ; _ftell_internal + 52
        0x00000f4c:    2800        .(      CMP      r0,#0
        0x00000f4e:    ddfa        ..      BLE      0xf46 ; _ftell_internal + 52
        0x00000f50:    1e40        @.      SUBS     r0,r0,#1
        0x00000f52:    bd10        ..      POP      {r4,pc}
    .text
    __default_signal_display
        0x00000f54:    b570        p.      PUSH     {r4-r6,lr}
        0x00000f56:    4605        .F      MOV      r5,r0
        0x00000f58:    460c        .F      MOV      r4,r1
        0x00000f5a:    200a        .       MOVS     r0,#0xa
        0x00000f5c:    e000        ..      B        0xf60 ; __default_signal_display + 12
        0x00000f5e:    1c6d        m.      ADDS     r5,r5,#1
        0x00000f60:    f000f818    ....    BL       _ttywrch ; 0xf94
        0x00000f64:    2d00        .-      CMP      r5,#0
        0x00000f66:    d006        ..      BEQ      0xf76 ; __default_signal_display + 34
        0x00000f68:    7828        (x      LDRB     r0,[r5,#0]
        0x00000f6a:    2800        .(      CMP      r0,#0
        0x00000f6c:    d1f7        ..      BNE      0xf5e ; __default_signal_display + 10
        0x00000f6e:    e002        ..      B        0xf76 ; __default_signal_display + 34
        0x00000f70:    1c64        d.      ADDS     r4,r4,#1
        0x00000f72:    f000f80f    ....    BL       _ttywrch ; 0xf94
        0x00000f76:    2c00        .,      CMP      r4,#0
        0x00000f78:    d002        ..      BEQ      0xf80 ; __default_signal_display + 44
        0x00000f7a:    7820         x      LDRB     r0,[r4,#0]
        0x00000f7c:    2800        .(      CMP      r0,#0
        0x00000f7e:    d1f7        ..      BNE      0xf70 ; __default_signal_display + 28
        0x00000f80:    200a        .       MOVS     r0,#0xa
        0x00000f82:    f000f807    ....    BL       _ttywrch ; 0xf94
        0x00000f86:    bd70        p.      POP      {r4-r6,pc}
    .text
    __rt_SIGRTMEM
        0x00000f88:    b510        ..      PUSH     {r4,lr}
        0x00000f8a:    f000f80d    ....    BL       __rt_SIGRTMEM_inner ; 0xfa8
        0x00000f8e:    f7ffff57    ..W.    BL       __sig_exit ; 0xe40
        0x00000f92:    bd10        ..      POP      {r4,pc}
    .text
    _ttywrch
        0x00000f94:    b508        ..      PUSH     {r3,lr}
        0x00000f96:    4669        iF      MOV      r1,sp
        0x00000f98:    7008        .p      STRB     r0,[r1,#0]
        0x00000f9a:    2003        .       MOVS     r0,#3
        0x00000f9c:    beab        ..      BKPT     #0xab
        0x00000f9e:    bd08        ..      POP      {r3,pc}
    .text
    __aeabi_errno_addr
    __errno$intlibspace
    __rt_errno_addr$intlibspace
        0x00000fa0:    4800        .H      LDR      r0,[pc,#0] ; [0xfa4] = 0x200001d0
        0x00000fa2:    4770        pG      BX       lr
    $d
        0x00000fa4:    200001d0    ...     DCD    536871376
    $t
    .text
    __rt_SIGRTMEM_inner
        0x00000fa8:    b510        ..      PUSH     {r4,lr}
        0x00000faa:    2801        .(      CMP      r0,#1
        0x00000fac:    d005        ..      BEQ      0xfba ; __rt_SIGRTMEM_inner + 18
        0x00000fae:    2100        .!      MOVS     r1,#0
        0x00000fb0:    a003        ..      ADR      r0,{pc}+0x10 ; 0xfc0
        0x00000fb2:    f7ffffcf    ....    BL       __default_signal_display ; 0xf54
        0x00000fb6:    2001        .       MOVS     r0,#1
        0x00000fb8:    bd10        ..      POP      {r4,pc}
        0x00000fba:    a109        ..      ADR      r1,{pc}+0x26 ; 0xfe0
        0x00000fbc:    e7f8        ..      B        0xfb0 ; __rt_SIGRTMEM_inner + 8
    $d
        0x00000fbe:    0000        ..      DCW    0
        0x00000fc0:    52474953    SIGR    DCD    1380403539
        0x00000fc4:    4d454d54    TMEM    DCD    1296387412
        0x00000fc8:    754f203a    : Ou    DCD    1968119866
        0x00000fcc:    666f2074    t of    DCD    1718558836
        0x00000fd0:    61656820     hea    DCD    1634035744
        0x00000fd4:    656d2070    p me    DCD    1701650544
        0x00000fd8:    79726f6d    mory    DCD    2037542765
        0x00000fdc:    00000000    ....    DCD    0
        0x00000fe0:    6548203a    : He    DCD    1699225658
        0x00000fe4:    6d207061    ap m    DCD    1830842465
        0x00000fe8:    726f6d65    emor    DCD    1919905125
        0x00000fec:    6f632079    y co    DCD    1868767353
        0x00000ff0:    70757272    rrup    DCD    1886745202
        0x00000ff4:    00646574    ted.    DCD    6579572
    $t
    i.CRC_CalcBlockCrc
    CRC_CalcBlockCrc
        0x00000ff8:    b510        ..      PUSH     {r4,lr}
        0x00000ffa:    4603        .F      MOV      r3,r0
        0x00000ffc:    480d        .H      LDR      r0,[pc,#52] ; [0x1034] = 0x20000040
        0x00000ffe:    6800        .h      LDR      r0,[r0,#0]
        0x00001000:    300d        .0      ADDS     r0,r0,#0xd
        0x00001002:    4c0c        .L      LDR      r4,[pc,#48] ; [0x1034] = 0x20000040
        0x00001004:    6020         `      STR      r0,[r4,#0]
        0x00001006:    43d2        .C      MVNS     r2,r2
        0x00001008:    e00a        ..      B        0x1020 ; CRC_CalcBlockCrc + 40
        0x0000100a:    7818        .x      LDRB     r0,[r3,#0]
        0x0000100c:    b2d4        ..      UXTB     r4,r2
        0x0000100e:    4060        `@      EORS     r0,r0,r4
        0x00001010:    0080        ..      LSLS     r0,r0,#2
        0x00001012:    4c09        .L      LDR      r4,[pc,#36] ; [0x1038] = 0x2cd8
        0x00001014:    5820         X      LDR      r0,[r4,r0]
        0x00001016:    0a14        ..      LSRS     r4,r2,#8
        0x00001018:    4060        `@      EORS     r0,r0,r4
        0x0000101a:    4602        .F      MOV      r2,r0
        0x0000101c:    1c5b        [.      ADDS     r3,r3,#1
        0x0000101e:    1e49        I.      SUBS     r1,r1,#1
        0x00001020:    2900        .)      CMP      r1,#0
        0x00001022:    dcf2        ..      BGT      0x100a ; CRC_CalcBlockCrc + 18
        0x00001024:    43d2        .C      MVNS     r2,r2
        0x00001026:    4805        .H      LDR      r0,[pc,#20] ; [0x103c] = 0x20000080
        0x00001028:    6800        .h      LDR      r0,[r0,#0]
        0x0000102a:    380d        .8      SUBS     r0,r0,#0xd
        0x0000102c:    4c03        .L      LDR      r4,[pc,#12] ; [0x103c] = 0x20000080
        0x0000102e:    6020         `      STR      r0,[r4,#0]
        0x00001030:    4610        .F      MOV      r0,r2
        0x00001032:    bd10        ..      POP      {r4,pc}
    $d
        0x00001034:    20000040    @..     DCD    536870976
        0x00001038:    00002cd8    .,..    DCD    11480
        0x0000103c:    20000080    ...     DCD    536871040
    $t
    i.FailSafePOR
    FailSafePOR
        0x00001040:    2000        .       MOVS     r0,#0
        0x00001042:    f001f8e5    ....    BL       SysTick_ITConfig ; 0x2210
        0x00001046:    e002        ..      B        0x104e ; FailSafePOR + 14
        0x00001048:    4801        .H      LDR      r0,[pc,#4] ; [0x1050] = 0x400a0800
        0x0000104a:    f001fc59    ..Y.    BL       WDT_Feed ; 0x2900
        0x0000104e:    e7fb        ..      B        0x1048 ; FailSafePOR + 8
    $d
        0x00001050:    400a0800    ...@    DCD    1074399232
    $t
    i.GPIO_ClrBit
    GPIO_ClrBit
        0x00001054:    b510        ..      PUSH     {r4,lr}
        0x00001056:    2300        .#      MOVS     r3,#0
        0x00001058:    008c        ..      LSLS     r4,r1,#2
        0x0000105a:    4602        .F      MOV      r2,r0
        0x0000105c:    3240        @2      ADDS     r2,r2,#0x40
        0x0000105e:    5113        .Q      STR      r3,[r2,r4]
        0x00001060:    bd10        ..      POP      {r4,pc}
        0x00001062:    0000        ..      MOVS     r0,r0
    i.GPIO_Init
    GPIO_Init
        0x00001064:    b5ff        ..      PUSH     {r0-r7,lr}
        0x00001066:    b081        ..      SUB      sp,sp,#4
        0x00001068:    4606        .F      MOV      r6,r0
        0x0000106a:    460d        .F      MOV      r5,r1
        0x0000106c:    4617        .F      MOV      r7,r2
        0x0000106e:    4c47        GL      LDR      r4,[pc,#284] ; [0x118c] = 0x400a0000
        0x00001070:    4847        GH      LDR      r0,[pc,#284] ; [0x1190] = 0xbffc0000
        0x00001072:    1830        0.      ADDS     r0,r6,r0
        0x00001074:    2800        .(      CMP      r0,#0
        0x00001076:    d008        ..      BEQ      0x108a ; GPIO_Init + 38
        0x00001078:    2101        .!      MOVS     r1,#1
        0x0000107a:    02c9        ..      LSLS     r1,r1,#11
        0x0000107c:    1a40        @.      SUBS     r0,r0,r1
        0x0000107e:    d00d        ..      BEQ      0x109c ; GPIO_Init + 56
        0x00001080:    1a40        @.      SUBS     r0,r0,r1
        0x00001082:    d015        ..      BEQ      0x10b0 ; GPIO_Init + 76
        0x00001084:    1a40        @.      SUBS     r0,r0,r1
        0x00001086:    d127        '.      BNE      0x10d8 ; GPIO_Init + 116
        0x00001088:    e01c        ..      B        0x10c4 ; GPIO_Init + 96
        0x0000108a:    2001        .       MOVS     r0,#1
        0x0000108c:    0780        ..      LSLS     r0,r0,#30
        0x0000108e:    6880        .h      LDR      r0,[r0,#8]
        0x00001090:    2101        .!      MOVS     r1,#1
        0x00001092:    4308        .C      ORRS     r0,r0,r1
        0x00001094:    0789        ..      LSLS     r1,r1,#30
        0x00001096:    6088        .`      STR      r0,[r1,#8]
        0x00001098:    4c3c        <L      LDR      r4,[pc,#240] ; [0x118c] = 0x400a0000
        0x0000109a:    e01d        ..      B        0x10d8 ; GPIO_Init + 116
        0x0000109c:    2001        .       MOVS     r0,#1
        0x0000109e:    0780        ..      LSLS     r0,r0,#30
        0x000010a0:    6880        .h      LDR      r0,[r0,#8]
        0x000010a2:    2102        .!      MOVS     r1,#2
        0x000010a4:    4308        .C      ORRS     r0,r0,r1
        0x000010a6:    0749        I.      LSLS     r1,r1,#29
        0x000010a8:    6088        .`      STR      r0,[r1,#8]
        0x000010aa:    4c38        8L      LDR      r4,[pc,#224] ; [0x118c] = 0x400a0000
        0x000010ac:    3410        .4      ADDS     r4,r4,#0x10
        0x000010ae:    e013        ..      B        0x10d8 ; GPIO_Init + 116
        0x000010b0:    2001        .       MOVS     r0,#1
        0x000010b2:    0780        ..      LSLS     r0,r0,#30
        0x000010b4:    6880        .h      LDR      r0,[r0,#8]
        0x000010b6:    2104        .!      MOVS     r1,#4
        0x000010b8:    4308        .C      ORRS     r0,r0,r1
        0x000010ba:    0709        ..      LSLS     r1,r1,#28
        0x000010bc:    6088        .`      STR      r0,[r1,#8]
        0x000010be:    4c33        3L      LDR      r4,[pc,#204] ; [0x118c] = 0x400a0000
        0x000010c0:    3420         4      ADDS     r4,r4,#0x20
        0x000010c2:    e009        ..      B        0x10d8 ; GPIO_Init + 116
        0x000010c4:    2001        .       MOVS     r0,#1
        0x000010c6:    0780        ..      LSLS     r0,r0,#30
        0x000010c8:    6880        .h      LDR      r0,[r0,#8]
        0x000010ca:    2108        .!      MOVS     r1,#8
        0x000010cc:    4308        .C      ORRS     r0,r0,r1
        0x000010ce:    06c9        ..      LSLS     r1,r1,#27
        0x000010d0:    6088        .`      STR      r0,[r1,#8]
        0x000010d2:    4c2e        .L      LDR      r4,[pc,#184] ; [0x118c] = 0x400a0000
        0x000010d4:    3430        04      ADDS     r4,r4,#0x30
        0x000010d6:    bf00        ..      NOP      
        0x000010d8:    bf00        ..      NOP      
        0x000010da:    2301        .#      MOVS     r3,#1
        0x000010dc:    2200        ."      MOVS     r2,#0
        0x000010de:    4629        )F      MOV      r1,r5
        0x000010e0:    4620         F      MOV      r0,r4
        0x000010e2:    f000f8b3    ....    BL       PORT_Init ; 0x124c
        0x000010e6:    2f01        ./      CMP      r7,#1
        0x000010e8:    d105        ..      BNE      0x10f6 ; GPIO_Init + 146
        0x000010ea:    6870        ph      LDR      r0,[r6,#4]
        0x000010ec:    2101        .!      MOVS     r1,#1
        0x000010ee:    40a9        .@      LSLS     r1,r1,r5
        0x000010f0:    4308        .C      ORRS     r0,r0,r1
        0x000010f2:    6070        p`      STR      r0,[r6,#4]
        0x000010f4:    e004        ..      B        0x1100 ; GPIO_Init + 156
        0x000010f6:    6870        ph      LDR      r0,[r6,#4]
        0x000010f8:    2101        .!      MOVS     r1,#1
        0x000010fa:    40a9        .@      LSLS     r1,r1,r5
        0x000010fc:    4388        .C      BICS     r0,r0,r1
        0x000010fe:    6070        p`      STR      r0,[r6,#4]
        0x00001100:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001102:    2801        .(      CMP      r0,#1
        0x00001104:    d108        ..      BNE      0x1118 ; GPIO_Init + 180
        0x00001106:    0200        ..      LSLS     r0,r0,#8
        0x00001108:    5900        .Y      LDR      r0,[r0,r4]
        0x0000110a:    2101        .!      MOVS     r1,#1
        0x0000110c:    40a9        .@      LSLS     r1,r1,r5
        0x0000110e:    4308        .C      ORRS     r0,r0,r1
        0x00001110:    21ff        .!      MOVS     r1,#0xff
        0x00001112:    3101        .1      ADDS     r1,#1
        0x00001114:    5108        .Q      STR      r0,[r1,r4]
        0x00001116:    e008        ..      B        0x112a ; GPIO_Init + 198
        0x00001118:    20ff        .       MOVS     r0,#0xff
        0x0000111a:    3001        .0      ADDS     r0,#1
        0x0000111c:    5900        .Y      LDR      r0,[r0,r4]
        0x0000111e:    2101        .!      MOVS     r1,#1
        0x00001120:    40a9        .@      LSLS     r1,r1,r5
        0x00001122:    4388        .C      BICS     r0,r0,r1
        0x00001124:    21ff        .!      MOVS     r1,#0xff
        0x00001126:    3101        .1      ADDS     r1,#1
        0x00001128:    5108        .Q      STR      r0,[r1,r4]
        0x0000112a:    980a        ..      LDR      r0,[sp,#0x28]
        0x0000112c:    2801        .(      CMP      r0,#1
        0x0000112e:    d108        ..      BNE      0x1142 ; GPIO_Init + 222
        0x00001130:    0240        @.      LSLS     r0,r0,#9
        0x00001132:    5900        .Y      LDR      r0,[r0,r4]
        0x00001134:    2101        .!      MOVS     r1,#1
        0x00001136:    40a9        .@      LSLS     r1,r1,r5
        0x00001138:    4308        .C      ORRS     r0,r0,r1
        0x0000113a:    2101        .!      MOVS     r1,#1
        0x0000113c:    0249        I.      LSLS     r1,r1,#9
        0x0000113e:    5108        .Q      STR      r0,[r1,r4]
        0x00001140:    e008        ..      B        0x1154 ; GPIO_Init + 240
        0x00001142:    2001        .       MOVS     r0,#1
        0x00001144:    0240        @.      LSLS     r0,r0,#9
        0x00001146:    5900        .Y      LDR      r0,[r0,r4]
        0x00001148:    2101        .!      MOVS     r1,#1
        0x0000114a:    40a9        .@      LSLS     r1,r1,r5
        0x0000114c:    4388        .C      BICS     r0,r0,r1
        0x0000114e:    2101        .!      MOVS     r1,#1
        0x00001150:    0249        I.      LSLS     r1,r1,#9
        0x00001152:    5108        .Q      STR      r0,[r1,r4]
        0x00001154:    980b        ..      LDR      r0,[sp,#0x2c]
        0x00001156:    2801        .(      CMP      r0,#1
        0x00001158:    d10a        ..      BNE      0x1170 ; GPIO_Init + 268
        0x0000115a:    0280        ..      LSLS     r0,r0,#10
        0x0000115c:    1820         .      ADDS     r0,r4,r0
        0x0000115e:    6800        .h      LDR      r0,[r0,#0]
        0x00001160:    2101        .!      MOVS     r1,#1
        0x00001162:    40a9        .@      LSLS     r1,r1,r5
        0x00001164:    4308        .C      ORRS     r0,r0,r1
        0x00001166:    2101        .!      MOVS     r1,#1
        0x00001168:    0289        ..      LSLS     r1,r1,#10
        0x0000116a:    1861        a.      ADDS     r1,r4,r1
        0x0000116c:    6008        .`      STR      r0,[r1,#0]
        0x0000116e:    e00a        ..      B        0x1186 ; GPIO_Init + 290
        0x00001170:    2001        .       MOVS     r0,#1
        0x00001172:    0280        ..      LSLS     r0,r0,#10
        0x00001174:    1820         .      ADDS     r0,r4,r0
        0x00001176:    6801        .h      LDR      r1,[r0,#0]
        0x00001178:    2001        .       MOVS     r0,#1
        0x0000117a:    40a8        .@      LSLS     r0,r0,r5
        0x0000117c:    4381        .C      BICS     r1,r1,r0
        0x0000117e:    2001        .       MOVS     r0,#1
        0x00001180:    0280        ..      LSLS     r0,r0,#10
        0x00001182:    1820         .      ADDS     r0,r4,r0
        0x00001184:    6001        .`      STR      r1,[r0,#0]
        0x00001186:    b005        ..      ADD      sp,sp,#0x14
        0x00001188:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x0000118a:    0000        ..      DCW    0
        0x0000118c:    400a0000    ...@    DCD    1074397184
        0x00001190:    bffc0000    ....    DCD    3220963328
    $t
    i.GPIO_SetBit
    GPIO_SetBit
        0x00001194:    b510        ..      PUSH     {r4,lr}
        0x00001196:    2301        .#      MOVS     r3,#1
        0x00001198:    008c        ..      LSLS     r4,r1,#2
        0x0000119a:    4602        .F      MOV      r2,r0
        0x0000119c:    3240        @2      ADDS     r2,r2,#0x40
        0x0000119e:    5113        .Q      STR      r3,[r2,r4]
        0x000011a0:    bd10        ..      POP      {r4,pc}
        0x000011a2:    0000        ..      MOVS     r0,r0
    i.NVIC_DisableIRQ
    NVIC_DisableIRQ
        0x000011a4:    06c2        ..      LSLS     r2,r0,#27
        0x000011a6:    0ed2        ..      LSRS     r2,r2,#27
        0x000011a8:    2101        .!      MOVS     r1,#1
        0x000011aa:    4091        .@      LSLS     r1,r1,r2
        0x000011ac:    4a01        .J      LDR      r2,[pc,#4] ; [0x11b4] = 0xe000e180
        0x000011ae:    6011        .`      STR      r1,[r2,#0]
        0x000011b0:    4770        pG      BX       lr
    $d
        0x000011b2:    0000        ..      DCW    0
        0x000011b4:    e000e180    ....    DCD    3758154112
    $t
    i.NVIC_EnableIRQ
    NVIC_EnableIRQ
        0x000011b8:    06c2        ..      LSLS     r2,r0,#27
        0x000011ba:    0ed2        ..      LSRS     r2,r2,#27
        0x000011bc:    2101        .!      MOVS     r1,#1
        0x000011be:    4091        .@      LSLS     r1,r1,r2
        0x000011c0:    4a01        .J      LDR      r2,[pc,#4] ; [0x11c8] = 0xe000e100
        0x000011c2:    6011        .`      STR      r1,[r2,#0]
        0x000011c4:    4770        pG      BX       lr
    $d
        0x000011c6:    0000        ..      DCW    0
        0x000011c8:    e000e100    ....    DCD    3758153984
    $t
    i.NVIC_EnableIRQ
    NVIC_EnableIRQ
        0x000011cc:    06c2        ..      LSLS     r2,r0,#27
        0x000011ce:    0ed2        ..      LSRS     r2,r2,#27
        0x000011d0:    2101        .!      MOVS     r1,#1
        0x000011d2:    4091        .@      LSLS     r1,r1,r2
        0x000011d4:    4a01        .J      LDR      r2,[pc,#4] ; [0x11dc] = 0xe000e100
        0x000011d6:    6011        .`      STR      r1,[r2,#0]
        0x000011d8:    4770        pG      BX       lr
    $d
        0x000011da:    0000        ..      DCW    0
        0x000011dc:    e000e100    ....    DCD    3758153984
    $t
    i.PLLInit
    PLLInit
        0x000011e0:    2001        .       MOVS     r0,#1
        0x000011e2:    4917        .I      LDR      r1,[pc,#92] ; [0x1240] = 0x400aa000
        0x000011e4:    6008        .`      STR      r0,[r1,#0]
        0x000011e6:    4816        .H      LDR      r0,[pc,#88] ; [0x1240] = 0x400aa000
        0x000011e8:    3040        @0      ADDS     r0,r0,#0x40
        0x000011ea:    6800        .h      LDR      r0,[r0,#0]
        0x000011ec:    2102        .!      MOVS     r1,#2
        0x000011ee:    4308        .C      ORRS     r0,r0,r1
        0x000011f0:    4913        .I      LDR      r1,[pc,#76] ; [0x1240] = 0x400aa000
        0x000011f2:    3140        @1      ADDS     r1,r1,#0x40
        0x000011f4:    6008        .`      STR      r0,[r1,#0]
        0x000011f6:    4608        .F      MOV      r0,r1
        0x000011f8:    6840        @h      LDR      r0,[r0,#4]
        0x000011fa:    4912        .I      LDR      r1,[pc,#72] ; [0x1244] = 0xfce0fe00
        0x000011fc:    4008        .@      ANDS     r0,r0,r1
        0x000011fe:    4910        .I      LDR      r1,[pc,#64] ; [0x1240] = 0x400aa000
        0x00001200:    3140        @1      ADDS     r1,r1,#0x40
        0x00001202:    6048        H`      STR      r0,[r1,#4]
        0x00001204:    4608        .F      MOV      r0,r1
        0x00001206:    6840        @h      LDR      r0,[r0,#4]
        0x00001208:    490f        .I      LDR      r1,[pc,#60] ; [0x1248] = 0x6001e
        0x0000120a:    4308        .C      ORRS     r0,r0,r1
