Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x0000120c:    490c        .I      LDR      r1,[pc,#48] ; [0x1240] = 0x400aa000
        0x0000120e:    3140        @1      ADDS     r1,r1,#0x40
        0x00001210:    6048        H`      STR      r0,[r1,#4]
        0x00001212:    4608        .F      MOV      r0,r1
        0x00001214:    6800        .h      LDR      r0,[r0,#0]
        0x00001216:    2104        .!      MOVS     r1,#4
        0x00001218:    4388        .C      BICS     r0,r0,r1
        0x0000121a:    4909        .I      LDR      r1,[pc,#36] ; [0x1240] = 0x400aa000
        0x0000121c:    3140        @1      ADDS     r1,r1,#0x40
        0x0000121e:    6008        .`      STR      r0,[r1,#0]
        0x00001220:    bf00        ..      NOP      
        0x00001222:    4807        .H      LDR      r0,[pc,#28] ; [0x1240] = 0x400aa000
        0x00001224:    3040        @0      ADDS     r0,r0,#0x40
        0x00001226:    68c0        .h      LDR      r0,[r0,#0xc]
        0x00001228:    2800        .(      CMP      r0,#0
        0x0000122a:    d0fa        ..      BEQ      0x1222 ; PLLInit + 66
        0x0000122c:    4804        .H      LDR      r0,[pc,#16] ; [0x1240] = 0x400aa000
        0x0000122e:    3040        @0      ADDS     r0,r0,#0x40
        0x00001230:    6800        .h      LDR      r0,[r0,#0]
        0x00001232:    2101        .!      MOVS     r1,#1
        0x00001234:    4308        .C      ORRS     r0,r0,r1
        0x00001236:    4902        .I      LDR      r1,[pc,#8] ; [0x1240] = 0x400aa000
        0x00001238:    3140        @1      ADDS     r1,r1,#0x40
        0x0000123a:    6008        .`      STR      r0,[r1,#0]
        0x0000123c:    4770        pG      BX       lr
    $d
        0x0000123e:    0000        ..      DCW    0
        0x00001240:    400aa000    ...@    DCD    1074438144
        0x00001244:    fce0fe00    ....    DCD    4242603520
        0x00001248:    0006001e    ....    DCD    393246
    $t
    i.PORT_Init
    PORT_Init
        0x0000124c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000124e:    2908        .)      CMP      r1,#8
        0x00001250:    d20c        ..      BCS      0x126c ; PORT_Init + 32
        0x00001252:    6804        .h      LDR      r4,[r0,#0]
        0x00001254:    008e        ..      LSLS     r6,r1,#2
        0x00001256:    250f        .%      MOVS     r5,#0xf
        0x00001258:    40b5        .@      LSLS     r5,r5,r6
        0x0000125a:    43ac        .C      BICS     r4,r4,r5
        0x0000125c:    6004        .`      STR      r4,[r0,#0]
        0x0000125e:    6804        .h      LDR      r4,[r0,#0]
        0x00001260:    008e        ..      LSLS     r6,r1,#2
        0x00001262:    4615        .F      MOV      r5,r2
        0x00001264:    40b5        .@      LSLS     r5,r5,r6
        0x00001266:    432c        ,C      ORRS     r4,r4,r5
        0x00001268:    6004        .`      STR      r4,[r0,#0]
        0x0000126a:    e00f        ..      B        0x128c ; PORT_Init + 64
        0x0000126c:    6844        Dh      LDR      r4,[r0,#4]
        0x0000126e:    460d        .F      MOV      r5,r1
        0x00001270:    3d08        .=      SUBS     r5,r5,#8
        0x00001272:    00ae        ..      LSLS     r6,r5,#2
        0x00001274:    250f        .%      MOVS     r5,#0xf
        0x00001276:    40b5        .@      LSLS     r5,r5,r6
        0x00001278:    43ac        .C      BICS     r4,r4,r5
        0x0000127a:    6044        D`      STR      r4,[r0,#4]
        0x0000127c:    6844        Dh      LDR      r4,[r0,#4]
        0x0000127e:    460d        .F      MOV      r5,r1
        0x00001280:    3d08        .=      SUBS     r5,r5,#8
        0x00001282:    00ae        ..      LSLS     r6,r5,#2
        0x00001284:    4615        .F      MOV      r5,r2
        0x00001286:    40b5        .@      LSLS     r5,r5,r6
        0x00001288:    432c        ,C      ORRS     r4,r4,r5
        0x0000128a:    6044        D`      STR      r4,[r0,#4]
        0x0000128c:    2b00        .+      CMP      r3,#0
        0x0000128e:    d00b        ..      BEQ      0x12a8 ; PORT_Init + 92
        0x00001290:    2403        .$      MOVS     r4,#3
        0x00001292:    0224        $.      LSLS     r4,r4,#8
        0x00001294:    1904        ..      ADDS     r4,r0,r4
        0x00001296:    6824        $h      LDR      r4,[r4,#0]
        0x00001298:    2501        .%      MOVS     r5,#1
        0x0000129a:    408d        .@      LSLS     r5,r5,r1
        0x0000129c:    432c        ,C      ORRS     r4,r4,r5
        0x0000129e:    2503        .%      MOVS     r5,#3
        0x000012a0:    022d        -.      LSLS     r5,r5,#8
        0x000012a2:    1945        E.      ADDS     r5,r0,r5
        0x000012a4:    602c        ,`      STR      r4,[r5,#0]
        0x000012a6:    e00a        ..      B        0x12be ; PORT_Init + 114
        0x000012a8:    2403        .$      MOVS     r4,#3
        0x000012aa:    0224        $.      LSLS     r4,r4,#8
        0x000012ac:    1904        ..      ADDS     r4,r0,r4
        0x000012ae:    6824        $h      LDR      r4,[r4,#0]
        0x000012b0:    2501        .%      MOVS     r5,#1
        0x000012b2:    408d        .@      LSLS     r5,r5,r1
        0x000012b4:    43ac        .C      BICS     r4,r4,r5
        0x000012b6:    2503        .%      MOVS     r5,#3
        0x000012b8:    022d        -.      LSLS     r5,r5,#8
        0x000012ba:    1945        E.      ADDS     r5,r0,r5
        0x000012bc:    602c        ,`      STR      r4,[r5,#0]
        0x000012be:    bd70        p.      POP      {r4-r6,pc}
    i.RTC_GetSubSecond
    RTC_GetSubSecond
        0x000012c0:    4801        .H      LDR      r0,[pc,#4] ; [0x12c8] = 0x40046840
        0x000012c2:    6840        @h      LDR      r0,[r0,#4]
        0x000012c4:    4770        pG      BX       lr
    $d
        0x000012c6:    0000        ..      DCW    0
        0x000012c8:    40046840    @h.@    DCD    1074030656
    $t
    i.STLSystemInit
    STLSystemInit
        0x000012cc:    4770        pG      BX       lr
        0x000012ce:    0000        ..      MOVS     r0,r0
    i.STL_CheckPeriod
    STL_CheckPeriod
        0x000012d0:    b570        p.      PUSH     {r4-r6,lr}
        0x000012d2:    4605        .F      MOV      r5,r0
        0x000012d4:    2603        .&      MOVS     r6,#3
        0x000012d6:    4817        .H      LDR      r0,[pc,#92] ; [0x1334] = 0x20000040
        0x000012d8:    6800        .h      LDR      r0,[r0,#0]
        0x000012da:    303d        =0      ADDS     r0,r0,#0x3d
        0x000012dc:    4915        .I      LDR      r1,[pc,#84] ; [0x1334] = 0x20000040
        0x000012de:    6008        .`      STR      r0,[r1,#0]
        0x000012e0:    4815        .H      LDR      r0,[pc,#84] ; [0x1338] = 0x20000048
        0x000012e2:    6800        .h      LDR      r0,[r0,#0]
        0x000012e4:    4915        .I      LDR      r1,[pc,#84] ; [0x133c] = 0x20000088
        0x000012e6:    6809        .h      LDR      r1,[r1,#0]
        0x000012e8:    4048        H@      EORS     r0,r0,r1
        0x000012ea:    1c40        @.      ADDS     r0,r0,#1
        0x000012ec:    2800        .(      CMP      r0,#0
        0x000012ee:    d119        ..      BNE      0x1324 ; STL_CheckPeriod + 84
        0x000012f0:    4813        .H      LDR      r0,[pc,#76] ; [0x1340] = 0x2000004c
        0x000012f2:    6801        .h      LDR      r1,[r0,#0]
        0x000012f4:    4628        (F      MOV      r0,r5
        0x000012f6:    3064        d0      ADDS     r0,r0,#0x64
        0x000012f8:    f7fff938    ..8.    BL       __aeabi_uidiv ; 0x56c
        0x000012fc:    490e        .I      LDR      r1,[pc,#56] ; [0x1338] = 0x20000048
        0x000012fe:    6809        .h      LDR      r1,[r1,#0]
        0x00001300:    4604        .F      MOV      r4,r0
        0x00001302:    434c        LC      MULS     r4,r1,r4
        0x00001304:    480f        .H      LDR      r0,[pc,#60] ; [0x1344] = 0x112a880
        0x00001306:    4284        .B      CMP      r4,r0
        0x00001308:    d203        ..      BCS      0x1312 ; STL_CheckPeriod + 66
        0x0000130a:    f001fc0d    ....    BL       switchTo48MHz ; 0x2b28
        0x0000130e:    2604        .&      MOVS     r6,#4
        0x00001310:    e009        ..      B        0x1326 ; STL_CheckPeriod + 86
        0x00001312:    480d        .H      LDR      r0,[pc,#52] ; [0x1348] = 0x1c9c380
        0x00001314:    4284        .B      CMP      r4,r0
        0x00001316:    d903        ..      BLS      0x1320 ; STL_CheckPeriod + 80
        0x00001318:    f001fc06    ....    BL       switchTo48MHz ; 0x2b28
        0x0000131c:    2604        .&      MOVS     r6,#4
        0x0000131e:    e002        ..      B        0x1326 ; STL_CheckPeriod + 86
        0x00001320:    2607        .&      MOVS     r6,#7
        0x00001322:    e000        ..      B        0x1326 ; STL_CheckPeriod + 86
        0x00001324:    2605        .&      MOVS     r6,#5
        0x00001326:    4809        .H      LDR      r0,[pc,#36] ; [0x134c] = 0x20000080
        0x00001328:    6800        .h      LDR      r0,[r0,#0]
        0x0000132a:    383d        =8      SUBS     r0,r0,#0x3d
        0x0000132c:    4907        .I      LDR      r1,[pc,#28] ; [0x134c] = 0x20000080
        0x0000132e:    6008        .`      STR      r0,[r1,#0]
        0x00001330:    4630        0F      MOV      r0,r6
        0x00001332:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00001334:    20000040    @..     DCD    536870976
        0x00001338:    20000048    H..     DCD    536870984
        0x0000133c:    20000088    ...     DCD    536871048
        0x00001340:    2000004c    L..     DCD    536870988
        0x00001344:    0112a880    ....    DCD    18000000
        0x00001348:    01c9c380    ....    DCD    30000000
        0x0000134c:    20000080    ...     DCD    536871040
    $t
    i.STL_CheckStack
    STL_CheckStack
        0x00001350:    2000        .       MOVS     r0,#0
        0x00001352:    4913        .I      LDR      r1,[pc,#76] ; [0x13a0] = 0x20000040
        0x00001354:    6809        .h      LDR      r1,[r1,#0]
        0x00001356:    313b        ;1      ADDS     r1,r1,#0x3b
        0x00001358:    4a11        .J      LDR      r2,[pc,#68] ; [0x13a0] = 0x20000040
        0x0000135a:    6011        .`      STR      r1,[r2,#0]
        0x0000135c:    4911        .I      LDR      r1,[pc,#68] ; [0x13a4] = 0x20003000
        0x0000135e:    6809        .h      LDR      r1,[r1,#0]
        0x00001360:    4a11        .J      LDR      r2,[pc,#68] ; [0x13a8] = 0xaaaaaaaa
        0x00001362:    4291        .B      CMP      r1,r2
        0x00001364:    d000        ..      BEQ      0x1368 ; STL_CheckStack + 24
        0x00001366:    e015        ..      B        0x1394 ; STL_CheckStack + 68
        0x00001368:    490e        .I      LDR      r1,[pc,#56] ; [0x13a4] = 0x20003000
        0x0000136a:    6849        Ih      LDR      r1,[r1,#4]
        0x0000136c:    4a0f        .J      LDR      r2,[pc,#60] ; [0x13ac] = 0xbbbbbbbb
        0x0000136e:    4291        .B      CMP      r1,r2
        0x00001370:    d001        ..      BEQ      0x1376 ; STL_CheckStack + 38
        0x00001372:    2000        .       MOVS     r0,#0
        0x00001374:    e00e        ..      B        0x1394 ; STL_CheckStack + 68
        0x00001376:    490b        .I      LDR      r1,[pc,#44] ; [0x13a4] = 0x20003000
        0x00001378:    6889        .h      LDR      r1,[r1,#8]
        0x0000137a:    4a0d        .J      LDR      r2,[pc,#52] ; [0x13b0] = 0xcccccccc
        0x0000137c:    4291        .B      CMP      r1,r2
        0x0000137e:    d001        ..      BEQ      0x1384 ; STL_CheckStack + 52
        0x00001380:    2000        .       MOVS     r0,#0
        0x00001382:    e007        ..      B        0x1394 ; STL_CheckStack + 68
        0x00001384:    4907        .I      LDR      r1,[pc,#28] ; [0x13a4] = 0x20003000
        0x00001386:    68c9        .h      LDR      r1,[r1,#0xc]
        0x00001388:    4a0a        .J      LDR      r2,[pc,#40] ; [0x13b4] = 0xdddddddd
        0x0000138a:    4291        .B      CMP      r1,r2
        0x0000138c:    d001        ..      BEQ      0x1392 ; STL_CheckStack + 66
        0x0000138e:    2000        .       MOVS     r0,#0
        0x00001390:    e000        ..      B        0x1394 ; STL_CheckStack + 68
        0x00001392:    2001        .       MOVS     r0,#1
        0x00001394:    4908        .I      LDR      r1,[pc,#32] ; [0x13b8] = 0x20000080
        0x00001396:    6809        .h      LDR      r1,[r1,#0]
        0x00001398:    393b        ;9      SUBS     r1,r1,#0x3b
        0x0000139a:    4a07        .J      LDR      r2,[pc,#28] ; [0x13b8] = 0x20000080
        0x0000139c:    6011        .`      STR      r1,[r2,#0]
        0x0000139e:    4770        pG      BX       lr
    $d
        0x000013a0:    20000040    @..     DCD    536870976
        0x000013a4:    20003000    .0.     DCD    536883200
        0x000013a8:    aaaaaaaa    ....    DCD    2863311530
        0x000013ac:    bbbbbbbb    ....    DCD    3149642683
        0x000013b0:    cccccccc    ....    DCD    3435973836
        0x000013b4:    dddddddd    ....    DCD    3722304989
        0x000013b8:    20000080    ...     DCD    536871040
    $t
    i.STL_ClockStartUpTest
    STL_ClockStartUpTest
        0x000013bc:    b538        8.      PUSH     {r3-r5,lr}
        0x000013be:    2503        .%      MOVS     r5,#3
        0x000013c0:    2001        .       MOVS     r0,#1
        0x000013c2:    0780        ..      LSLS     r0,r0,#30
        0x000013c4:    6880        .h      LDR      r0,[r0,#8]
        0x000013c6:    2101        .!      MOVS     r1,#1
        0x000013c8:    0649        I.      LSLS     r1,r1,#25
        0x000013ca:    4308        .C      ORRS     r0,r0,r1
        0x000013cc:    0149        I.      LSLS     r1,r1,#5
        0x000013ce:    6088        .`      STR      r0,[r1,#8]
        0x000013d0:    4839        9H      LDR      r0,[pc,#228] ; [0x14b8] = 0x20000040
        0x000013d2:    6800        .h      LDR      r0,[r0,#0]
        0x000013d4:    301d        .0      ADDS     r0,r0,#0x1d
        0x000013d6:    4938        8I      LDR      r1,[pc,#224] ; [0x14b8] = 0x20000040
        0x000013d8:    6008        .`      STR      r0,[r1,#0]
        0x000013da:    f000fa9f    ....    BL       STL_LSIinit ; 0x191c
        0x000013de:    2801        .(      CMP      r0,#1
        0x000013e0:    d001        ..      BEQ      0x13e6 ; STL_ClockStartUpTest + 42
        0x000013e2:    2500        .%      MOVS     r5,#0
        0x000013e4:    e061        a.      B        0x14aa ; STL_ClockStartUpTest + 238
        0x000013e6:    f000fa01    ....    BL       STL_HSEinit ; 0x17ec
        0x000013ea:    2801        .(      CMP      r0,#1
        0x000013ec:    d001        ..      BEQ      0x13f2 ; STL_ClockStartUpTest + 54
        0x000013ee:    2501        .%      MOVS     r5,#1
        0x000013f0:    e05b        [.      B        0x14aa ; STL_ClockStartUpTest + 238
        0x000013f2:    f000fc07    ....    BL       STL_SysTickInit ; 0x1c04
        0x000013f6:    2001        .       MOVS     r0,#1
        0x000013f8:    4930        0I      LDR      r1,[pc,#192] ; [0x14bc] = 0x400aa000
        0x000013fa:    60c8        .`      STR      r0,[r1,#0xc]
        0x000013fc:    482e        .H      LDR      r0,[pc,#184] ; [0x14b8] = 0x20000040
        0x000013fe:    6800        .h      LDR      r0,[r0,#0]
        0x00001400:    3029        )0      ADDS     r0,r0,#0x29
        0x00001402:    492d        -I      LDR      r1,[pc,#180] ; [0x14b8] = 0x20000040
        0x00001404:    6008        .`      STR      r0,[r1,#0]
        0x00001406:    2000        .       MOVS     r0,#0
        0x00001408:    4b2d        -K      LDR      r3,[pc,#180] ; [0x14c0] = 0xffffff
        0x0000140a:    2201        ."      MOVS     r2,#1
        0x0000140c:    4601        .F      MOV      r1,r0
        0x0000140e:    9000        ..      STR      r0,[sp,#0]
        0x00001410:    482c        ,H      LDR      r0,[pc,#176] ; [0x14c4] = 0x40046840
        0x00001412:    f000ffd9    ....    BL       TIMR_Init ; 0x23c8
        0x00001416:    482c        ,H      LDR      r0,[pc,#176] ; [0x14c8] = 0x20000080
        0x00001418:    6800        .h      LDR      r0,[r0,#0]
        0x0000141a:    3829        )8      SUBS     r0,r0,#0x29
        0x0000141c:    492a        *I      LDR      r1,[pc,#168] ; [0x14c8] = 0x20000080
        0x0000141e:    6008        .`      STR      r0,[r1,#0]
        0x00001420:    4828        (H      LDR      r0,[pc,#160] ; [0x14c4] = 0x40046840
        0x00001422:    f001f87d    ..}.    BL       TIMR_Start ; 0x2520
        0x00001426:    f000fbbd    ....    BL       STL_SwitchToExtClockSrc ; 0x1ba4
        0x0000142a:    2801        .(      CMP      r0,#1
        0x0000142c:    d001        ..      BEQ      0x1432 ; STL_ClockStartUpTest + 118
        0x0000142e:    2502        .%      MOVS     r5,#2
        0x00001430:    e03b        ;.      B        0x14aa ; STL_ClockStartUpTest + 238
        0x00001432:    bf00        ..      NOP      
        0x00001434:    4825        %H      LDR      r0,[pc,#148] ; [0x14cc] = 0xe000e000
        0x00001436:    6900        .i      LDR      r0,[r0,#0x10]
        0x00001438:    2101        .!      MOVS     r1,#1
        0x0000143a:    0409        ..      LSLS     r1,r1,#16
        0x0000143c:    4008        .@      ANDS     r0,r0,r1
        0x0000143e:    2800        .(      CMP      r0,#0
        0x00001440:    d0f8        ..      BEQ      0x1434 ; STL_ClockStartUpTest + 120
        0x00001442:    f7ffff3d    ..=.    BL       RTC_GetSubSecond ; 0x12c0
        0x00001446:    4922        "I      LDR      r1,[pc,#136] ; [0x14d0] = 0x2000004c
        0x00001448:    6008        .`      STR      r0,[r1,#0]
        0x0000144a:    bf00        ..      NOP      
        0x0000144c:    481f        .H      LDR      r0,[pc,#124] ; [0x14cc] = 0xe000e000
        0x0000144e:    6900        .i      LDR      r0,[r0,#0x10]
        0x00001450:    2101        .!      MOVS     r1,#1
        0x00001452:    0409        ..      LSLS     r1,r1,#16
        0x00001454:    4008        .@      ANDS     r0,r0,r1
        0x00001456:    2800        .(      CMP      r0,#0
        0x00001458:    d0f8        ..      BEQ      0x144c ; STL_ClockStartUpTest + 144
        0x0000145a:    f7ffff31    ..1.    BL       RTC_GetSubSecond ; 0x12c0
        0x0000145e:    491c        .I      LDR      r1,[pc,#112] ; [0x14d0] = 0x2000004c
        0x00001460:    6809        .h      LDR      r1,[r1,#0]
        0x00001462:    1a08        ..      SUBS     r0,r1,r0
        0x00001464:    491a        .I      LDR      r1,[pc,#104] ; [0x14d0] = 0x2000004c
        0x00001466:    6008        .`      STR      r0,[r1,#0]
        0x00001468:    4608        .F      MOV      r0,r1
        0x0000146a:    6800        .h      LDR      r0,[r0,#0]
        0x0000146c:    43c0        .C      MVNS     r0,r0
        0x0000146e:    4919        .I      LDR      r1,[pc,#100] ; [0x14d4] = 0x2000008c
        0x00001470:    6008        .`      STR      r0,[r1,#0]
        0x00001472:    4817        .H      LDR      r0,[pc,#92] ; [0x14d0] = 0x2000004c
        0x00001474:    6801        .h      LDR      r1,[r0,#0]
        0x00001476:    4818        .H      LDR      r0,[pc,#96] ; [0x14d8] = 0x16e3600
        0x00001478:    f7fff878    ..x.    BL       __aeabi_uidiv ; 0x56c
        0x0000147c:    4917        .I      LDR      r1,[pc,#92] ; [0x14dc] = 0x5dc0
        0x0000147e:    4604        .F      MOV      r4,r0
        0x00001480:    434c        LC      MULS     r4,r1,r4
        0x00001482:    4817        .H      LDR      r0,[pc,#92] ; [0x14e0] = 0x20000048
        0x00001484:    6004        .`      STR      r4,[r0,#0]
        0x00001486:    43e0        .C      MVNS     r0,r4
        0x00001488:    4916        .I      LDR      r1,[pc,#88] ; [0x14e4] = 0x20000088
        0x0000148a:    6008        .`      STR      r0,[r1,#0]
        0x0000148c:    4816        .H      LDR      r0,[pc,#88] ; [0x14e8] = 0x112a880
        0x0000148e:    4284        .B      CMP      r4,r0
        0x00001490:    d203        ..      BCS      0x149a ; STL_ClockStartUpTest + 222
        0x00001492:    f001fb49    ..I.    BL       switchTo48MHz ; 0x2b28
        0x00001496:    2504        .%      MOVS     r5,#4
        0x00001498:    e007        ..      B        0x14aa ; STL_ClockStartUpTest + 238
        0x0000149a:    4814        .H      LDR      r0,[pc,#80] ; [0x14ec] = 0x1c9c380
        0x0000149c:    4284        .B      CMP      r4,r0
        0x0000149e:    d903        ..      BLS      0x14a8 ; STL_ClockStartUpTest + 236
        0x000014a0:    f001fb42    ..B.    BL       switchTo48MHz ; 0x2b28
        0x000014a4:    2504        .%      MOVS     r5,#4
        0x000014a6:    e000        ..      B        0x14aa ; STL_ClockStartUpTest + 238
        0x000014a8:    2507        .%      MOVS     r5,#7
        0x000014aa:    4807        .H      LDR      r0,[pc,#28] ; [0x14c8] = 0x20000080
        0x000014ac:    6800        .h      LDR      r0,[r0,#0]
        0x000014ae:    381d        .8      SUBS     r0,r0,#0x1d
        0x000014b0:    4905        .I      LDR      r1,[pc,#20] ; [0x14c8] = 0x20000080
        0x000014b2:    6008        .`      STR      r0,[r1,#0]
        0x000014b4:    4628        (F      MOV      r0,r5
        0x000014b6:    bd38        8.      POP      {r3-r5,pc}
    $d
        0x000014b8:    20000040    @..     DCD    536870976
        0x000014bc:    400aa000    ...@    DCD    1074438144
        0x000014c0:    00ffffff    ....    DCD    16777215
        0x000014c4:    40046840    @h.@    DCD    1074030656
        0x000014c8:    20000080    ...     DCD    536871040
        0x000014cc:    e000e000    ....    DCD    3758153728
        0x000014d0:    2000004c    L..     DCD    536870988
        0x000014d4:    2000008c    ...     DCD    536871052
        0x000014d8:    016e3600    .6n.    DCD    24000000
        0x000014dc:    00005dc0    .]..    DCD    24000
        0x000014e0:    20000048    H..     DCD    536870984
        0x000014e4:    20000088    ...     DCD    536871048
        0x000014e8:    0112a880    ....    DCD    18000000
        0x000014ec:    01c9c380    ....    DCD    30000000
    $t
    i.STL_DoRunTimeChecks
    STL_DoRunTimeChecks
        0x000014f0:    b570        p.      PUSH     {r4-r6,lr}
        0x000014f2:    4864        dH      LDR      r0,[pc,#400] ; [0x1684] = 0x2000005c
        0x000014f4:    6800        .h      LDR      r0,[r0,#0]
        0x000014f6:    4964        dI      LDR      r1,[pc,#400] ; [0x1688] = 0xaaaaaaaa
        0x000014f8:    4288        .B      CMP      r0,r1
        0x000014fa:    d17d        }.      BNE      0x15f8 ; STL_DoRunTimeChecks + 264
        0x000014fc:    4863        cH      LDR      r0,[pc,#396] ; [0x168c] = 0x2000009c
        0x000014fe:    6805        .h      LDR      r5,[r0,#0]
        0x00001500:    4860        `H      LDR      r0,[pc,#384] ; [0x1684] = 0x2000005c
        0x00001502:    6800        .h      LDR      r0,[r0,#0]
        0x00001504:    4068        h@      EORS     r0,r0,r5
        0x00001506:    1c40        @.      ADDS     r0,r0,#1
        0x00001508:    2800        .(      CMP      r0,#0
        0x0000150a:    d176        v.      BNE      0x15fa ; STL_DoRunTimeChecks + 266
        0x0000150c:    495d        ]I      LDR      r1,[pc,#372] ; [0x1684] = 0x2000005c
        0x0000150e:    6008        .`      STR      r0,[r1,#0]
        0x00001510:    485f        _H      LDR      r0,[pc,#380] ; [0x1690] = 0x20000040
        0x00001512:    6800        .h      LDR      r0,[r0,#0]
        0x00001514:    1c80        ..      ADDS     r0,r0,#2
        0x00001516:    495e        ^I      LDR      r1,[pc,#376] ; [0x1690] = 0x20000040
        0x00001518:    6008        .`      STR      r0,[r1,#0]
        0x0000151a:    f7fefe51    ..Q.    BL       STL_RunTimeCPUTest ; 0x1c0
