Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x0000151e:    2801        .(      CMP      r0,#1
        0x00001520:    d002        ..      BEQ      0x1528 ; STL_DoRunTimeChecks + 56
        0x00001522:    f7fffd8d    ....    BL       FailSafePOR ; 0x1040
        0x00001526:    e004        ..      B        0x1532 ; STL_DoRunTimeChecks + 66
        0x00001528:    485a        ZH      LDR      r0,[pc,#360] ; [0x1694] = 0x20000080
        0x0000152a:    6800        .h      LDR      r0,[r0,#0]
        0x0000152c:    1e80        ..      SUBS     r0,r0,#2
        0x0000152e:    4959        YI      LDR      r1,[pc,#356] ; [0x1694] = 0x20000080
        0x00001530:    6008        .`      STR      r0,[r1,#0]
        0x00001532:    4857        WH      LDR      r0,[pc,#348] ; [0x1690] = 0x20000040
        0x00001534:    6800        .h      LDR      r0,[r0,#0]
        0x00001536:    3035        50      ADDS     r0,r0,#0x35
        0x00001538:    4955        UI      LDR      r1,[pc,#340] ; [0x1690] = 0x20000040
        0x0000153a:    6008        .`      STR      r0,[r1,#0]
        0x0000153c:    f7ffff08    ....    BL       STL_CheckStack ; 0x1350
        0x00001540:    2801        .(      CMP      r0,#1
        0x00001542:    d002        ..      BEQ      0x154a ; STL_DoRunTimeChecks + 90
        0x00001544:    f7fffd7c    ..|.    BL       FailSafePOR ; 0x1040
        0x00001548:    e004        ..      B        0x1554 ; STL_DoRunTimeChecks + 100
        0x0000154a:    4852        RH      LDR      r0,[pc,#328] ; [0x1694] = 0x20000080
        0x0000154c:    6800        .h      LDR      r0,[r0,#0]
        0x0000154e:    3835        58      SUBS     r0,r0,#0x35
        0x00001550:    4950        PI      LDR      r1,[pc,#320] ; [0x1694] = 0x20000080
        0x00001552:    6008        .`      STR      r0,[r1,#0]
        0x00001554:    484e        NH      LDR      r0,[pc,#312] ; [0x1690] = 0x20000040
        0x00001556:    6800        .h      LDR      r0,[r0,#0]
        0x00001558:    3017        .0      ADDS     r0,r0,#0x17
        0x0000155a:    494d        MI      LDR      r1,[pc,#308] ; [0x1690] = 0x20000040
        0x0000155c:    6008        .`      STR      r0,[r1,#0]
        0x0000155e:    f000f9fd    ....    BL       STL_MainClockTest ; 0x195c
        0x00001562:    0003        ..      MOVS     r3,r0
        0x00001564:    f001fa0f    ....    BL       __ARM_common_switch8 ; 0x2986
    $d
        0x00001568:    14131208    ....    DCD    336794120
        0x0000156c:    160e0b15    ....    DCD    370019093
        0x00001570:    1105        ..      DCW    4357
    $t
        0x00001572:    4848        HH      LDR      r0,[pc,#288] ; [0x1694] = 0x20000080
        0x00001574:    6800        .h      LDR      r0,[r0,#0]
        0x00001576:    3817        .8      SUBS     r0,r0,#0x17
        0x00001578:    4946        FI      LDR      r1,[pc,#280] ; [0x1694] = 0x20000080
        0x0000157a:    6008        .`      STR      r0,[r1,#0]
        0x0000157c:    e00d        ..      B        0x159a ; STL_DoRunTimeChecks + 170
        0x0000157e:    f7fffd5f    .._.    BL       FailSafePOR ; 0x1040
        0x00001582:    e00a        ..      B        0x159a ; STL_DoRunTimeChecks + 170
        0x00001584:    f7fffd5c    ..\.    BL       FailSafePOR ; 0x1040
        0x00001588:    e007        ..      B        0x159a ; STL_DoRunTimeChecks + 170
        0x0000158a:    bf00        ..      NOP      
        0x0000158c:    bf00        ..      NOP      
        0x0000158e:    bf00        ..      NOP      
        0x00001590:    bf00        ..      NOP      
        0x00001592:    bf00        ..      NOP      
        0x00001594:    f7fffd54    ..T.    BL       FailSafePOR ; 0x1040
        0x00001598:    bf00        ..      NOP      
        0x0000159a:    bf00        ..      NOP      
        0x0000159c:    483c        <H      LDR      r0,[pc,#240] ; [0x1690] = 0x20000040
        0x0000159e:    6800        .h      LDR      r0,[r0,#0]
        0x000015a0:    3049        I0      ADDS     r0,r0,#0x49
        0x000015a2:    493b        ;I      LDR      r1,[pc,#236] ; [0x1690] = 0x20000040
        0x000015a4:    6008        .`      STR      r0,[r1,#0]
        0x000015a6:    f000fce5    ....    BL       STL_crc32Run ; 0x1f74
        0x000015aa:    4604        .F      MOV      r4,r0
        0x000015ac:    2c00        .,      CMP      r4,#0
        0x000015ae:    d006        ..      BEQ      0x15be ; STL_DoRunTimeChecks + 206
        0x000015b0:    2c01        .,      CMP      r4,#1
        0x000015b2:    d012        ..      BEQ      0x15da ; STL_DoRunTimeChecks + 234
        0x000015b4:    2c03        .,      CMP      r4,#3
        0x000015b6:    d00f        ..      BEQ      0x15d8 ; STL_DoRunTimeChecks + 232
        0x000015b8:    2c04        .,      CMP      r4,#4
        0x000015ba:    d10c        ..      BNE      0x15d6 ; STL_DoRunTimeChecks + 230
        0x000015bc:    e005        ..      B        0x15ca ; STL_DoRunTimeChecks + 218
        0x000015be:    4835        5H      LDR      r0,[pc,#212] ; [0x1694] = 0x20000080
        0x000015c0:    6800        .h      LDR      r0,[r0,#0]
        0x000015c2:    3849        I8      SUBS     r0,r0,#0x49
        0x000015c4:    4933        3I      LDR      r1,[pc,#204] ; [0x1694] = 0x20000080
        0x000015c6:    6008        .`      STR      r0,[r1,#0]
        0x000015c8:    e00a        ..      B        0x15e0 ; STL_DoRunTimeChecks + 240
        0x000015ca:    4832        2H      LDR      r0,[pc,#200] ; [0x1694] = 0x20000080
        0x000015cc:    6800        .h      LDR      r0,[r0,#0]
        0x000015ce:    3849        I8      SUBS     r0,r0,#0x49
        0x000015d0:    4930        0I      LDR      r1,[pc,#192] ; [0x1694] = 0x20000080
        0x000015d2:    6008        .`      STR      r0,[r1,#0]
        0x000015d4:    e004        ..      B        0x15e0 ; STL_DoRunTimeChecks + 240
        0x000015d6:    bf00        ..      NOP      
        0x000015d8:    bf00        ..      NOP      
        0x000015da:    f7fffd31    ..1.    BL       FailSafePOR ; 0x1040
        0x000015de:    bf00        ..      NOP      
        0x000015e0:    bf00        ..      NOP      
        0x000015e2:    482d        -H      LDR      r0,[pc,#180] ; [0x1698] = 0x400a0800
        0x000015e4:    f001f98c    ....    BL       WDT_Feed ; 0x2900
        0x000015e8:    4829        )H      LDR      r0,[pc,#164] ; [0x1690] = 0x20000040
        0x000015ea:    6800        .h      LDR      r0,[r0,#0]
        0x000015ec:    4929        )I      LDR      r1,[pc,#164] ; [0x1694] = 0x20000080
        0x000015ee:    6809        .h      LDR      r1,[r1,#0]
        0x000015f0:    4048        H@      EORS     r0,r0,r1
        0x000015f2:    1c40        @.      ADDS     r0,r0,#1
        0x000015f4:    2800        .(      CMP      r0,#0
        0x000015f6:    e001        ..      B        0x15fc ; STL_DoRunTimeChecks + 268
        0x000015f8:    e043        C.      B        0x1682 ; STL_DoRunTimeChecks + 402
        0x000015fa:    e03f        ?.      B        0x167c ; STL_DoRunTimeChecks + 396
        0x000015fc:    d13b        ;.      BNE      0x1676 ; STL_DoRunTimeChecks + 390
        0x000015fe:    4827        'H      LDR      r0,[pc,#156] ; [0x169c] = 0x20000060
        0x00001600:    6800        .h      LDR      r0,[r0,#0]
        0x00001602:    4927        'I      LDR      r1,[pc,#156] ; [0x16a0] = 0x200000a0
        0x00001604:    6809        .h      LDR      r1,[r1,#0]
        0x00001606:    4048        H@      EORS     r0,r0,r1
        0x00001608:    1c40        @.      ADDS     r0,r0,#1
        0x0000160a:    2800        .(      CMP      r0,#0
        0x0000160c:    d133        3.      BNE      0x1676 ; STL_DoRunTimeChecks + 390
        0x0000160e:    2c04        .,      CMP      r4,#4
        0x00001610:    d11d        ..      BNE      0x164e ; STL_DoRunTimeChecks + 350
        0x00001612:    4824        $H      LDR      r0,[pc,#144] ; [0x16a4] = 0x3180
        0x00001614:    0980        ..      LSRS     r0,r0,#6
        0x00001616:    21ff        .!      MOVS     r1,#0xff
        0x00001618:    3184        .1      ADDS     r1,r1,#0x84
        0x0000161a:    4348        HC      MULS     r0,r1,r0
        0x0000161c:    30ff        .0      ADDS     r0,r0,#0xff
        0x0000161e:    3077        w0      ADDS     r0,r0,#0x77
        0x00001620:    491b        .I      LDR      r1,[pc,#108] ; [0x1690] = 0x20000040
        0x00001622:    6809        .h      LDR      r1,[r1,#0]
        0x00001624:    4288        .B      CMP      r0,r1
        0x00001626:    d10f        ..      BNE      0x1648 ; STL_DoRunTimeChecks + 344
        0x00001628:    4819        .H      LDR      r0,[pc,#100] ; [0x1690] = 0x20000040
        0x0000162a:    6800        .h      LDR      r0,[r0,#0]
        0x0000162c:    491b        .I      LDR      r1,[pc,#108] ; [0x169c] = 0x20000060
        0x0000162e:    6809        .h      LDR      r1,[r1,#0]
        0x00001630:    1a40        @.      SUBS     r0,r0,r1
        0x00001632:    21ff        .!      MOVS     r1,#0xff
        0x00001634:    3177        w1      ADDS     r1,r1,#0x77
        0x00001636:    4288        .B      CMP      r0,r1
        0x00001638:    d106        ..      BNE      0x1648 ; STL_DoRunTimeChecks + 344
        0x0000163a:    2000        .       MOVS     r0,#0
        0x0000163c:    4914        .I      LDR      r1,[pc,#80] ; [0x1690] = 0x20000040
        0x0000163e:    6008        .`      STR      r0,[r1,#0]
        0x00001640:    1e40        @.      SUBS     r0,r0,#1
        0x00001642:    4914        .I      LDR      r1,[pc,#80] ; [0x1694] = 0x20000080
        0x00001644:    6008        .`      STR      r0,[r1,#0]
        0x00001646:    e00d        ..      B        0x1664 ; STL_DoRunTimeChecks + 372
        0x00001648:    f7fffcfa    ....    BL       FailSafePOR ; 0x1040
        0x0000164c:    e00a        ..      B        0x1664 ; STL_DoRunTimeChecks + 372
        0x0000164e:    4810        .H      LDR      r0,[pc,#64] ; [0x1690] = 0x20000040
        0x00001650:    6800        .h      LDR      r0,[r0,#0]
        0x00001652:    4912        .I      LDR      r1,[pc,#72] ; [0x169c] = 0x20000060
        0x00001654:    6809        .h      LDR      r1,[r1,#0]
        0x00001656:    1a40        @.      SUBS     r0,r0,r1
        0x00001658:    21ff        .!      MOVS     r1,#0xff
        0x0000165a:    3184        .1      ADDS     r1,r1,#0x84
        0x0000165c:    4288        .B      CMP      r0,r1
        0x0000165e:    d001        ..      BEQ      0x1664 ; STL_DoRunTimeChecks + 372
        0x00001660:    f7fffcee    ....    BL       FailSafePOR ; 0x1040
        0x00001664:    480a        .H      LDR      r0,[pc,#40] ; [0x1690] = 0x20000040
        0x00001666:    6800        .h      LDR      r0,[r0,#0]
        0x00001668:    490c        .I      LDR      r1,[pc,#48] ; [0x169c] = 0x20000060
        0x0000166a:    6008        .`      STR      r0,[r1,#0]
        0x0000166c:    4809        .H      LDR      r0,[pc,#36] ; [0x1694] = 0x20000080
        0x0000166e:    6800        .h      LDR      r0,[r0,#0]
        0x00001670:    490b        .I      LDR      r1,[pc,#44] ; [0x16a0] = 0x200000a0
        0x00001672:    6008        .`      STR      r0,[r1,#0]
        0x00001674:    e001        ..      B        0x167a ; STL_DoRunTimeChecks + 394
        0x00001676:    f7fffce3    ....    BL       FailSafePOR ; 0x1040
        0x0000167a:    e001        ..      B        0x1680 ; STL_DoRunTimeChecks + 400
        0x0000167c:    f7fffce0    ....    BL       FailSafePOR ; 0x1040
        0x00001680:    bf00        ..      NOP      
        0x00001682:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00001684:    2000005c    \..     DCD    536871004
        0x00001688:    aaaaaaaa    ....    DCD    2863311530
        0x0000168c:    2000009c    ...     DCD    536871068
        0x00001690:    20000040    @..     DCD    536870976
        0x00001694:    20000080    ...     DCD    536871040
        0x00001698:    400a0800    ...@    DCD    1074399232
        0x0000169c:    20000060    `..     DCD    536871008
        0x000016a0:    200000a0    ...     DCD    536871072
        0x000016a4:    00003180    .1..    DCD    12672
    $t
    i.STL_FlashCrc32Init
    STL_FlashCrc32Init
        0x000016a8:    2000        .       MOVS     r0,#0
        0x000016aa:    4906        .I      LDR      r1,[pc,#24] ; [0x16c4] = 0x20000064
        0x000016ac:    6008        .`      STR      r0,[r1,#0]
        0x000016ae:    1e40        @.      SUBS     r0,r0,#1
        0x000016b0:    4905        .I      LDR      r1,[pc,#20] ; [0x16c8] = 0x200000a4
        0x000016b2:    6008        .`      STR      r0,[r1,#0]
        0x000016b4:    2000        .       MOVS     r0,#0
        0x000016b6:    4905        .I      LDR      r1,[pc,#20] ; [0x16cc] = 0x20000070
        0x000016b8:    6008        .`      STR      r0,[r1,#0]
        0x000016ba:    1e40        @.      SUBS     r0,r0,#1
        0x000016bc:    4904        .I      LDR      r1,[pc,#16] ; [0x16d0] = 0x200000b0
        0x000016be:    6008        .`      STR      r0,[r1,#0]
        0x000016c0:    4770        pG      BX       lr
    $d
        0x000016c2:    0000        ..      DCW    0
        0x000016c4:    20000064    d..     DCD    536871012
        0x000016c8:    200000a4    ...     DCD    536871076
        0x000016cc:    20000070    p..     DCD    536871024
        0x000016d0:    200000b0    ...     DCD    536871088
    $t
    i.STL_FullRamMarchC
    STL_FullRamMarchC
        0x000016d4:    b530        0.      PUSH     {r4,r5,lr}
        0x000016d6:    2001        .       MOVS     r0,#1
        0x000016d8:    9b02        ..      LDR      r3,[sp,#8]
        0x000016da:    0741        A.      LSLS     r1,r0,#29
        0x000016dc:    e002        ..      B        0x16e4 ; STL_FullRamMarchC + 16
        0x000016de:    2400        .$      MOVS     r4,#0
        0x000016e0:    600c        .`      STR      r4,[r1,#0]
        0x000016e2:    1d09        ..      ADDS     r1,r1,#4
        0x000016e4:    4c3d        =L      LDR      r4,[pc,#244] ; [0x17dc] = 0x20001ffc
        0x000016e6:    42a1        .B      CMP      r1,r4
        0x000016e8:    d9f9        ..      BLS      0x16de ; STL_FullRamMarchC + 10
        0x000016ea:    2101        .!      MOVS     r1,#1
        0x000016ec:    0749        I.      LSLS     r1,r1,#29
        0x000016ee:    e012        ..      B        0x1716 ; STL_FullRamMarchC + 66
        0x000016f0:    2200        ."      MOVS     r2,#0
        0x000016f2:    e00d        ..      B        0x1710 ; STL_FullRamMarchC + 60
        0x000016f4:    4c3a        :L      LDR      r4,[pc,#232] ; [0x17e0] = 0x30d8
        0x000016f6:    5ca4        .\      LDRB     r4,[r4,r2]
        0x000016f8:    00a4        ..      LSLS     r4,r4,#2
        0x000016fa:    590c        .Y      LDR      r4,[r1,r4]
        0x000016fc:    2c00        .,      CMP      r4,#0
        0x000016fe:    d000        ..      BEQ      0x1702 ; STL_FullRamMarchC + 46
        0x00001700:    2000        .       MOVS     r0,#0
        0x00001702:    2400        .$      MOVS     r4,#0
        0x00001704:    43e4        .C      MVNS     r4,r4
        0x00001706:    4d36        6M      LDR      r5,[pc,#216] ; [0x17e0] = 0x30d8
        0x00001708:    5cad        .\      LDRB     r5,[r5,r2]
        0x0000170a:    00ad        ..      LSLS     r5,r5,#2
        0x0000170c:    514c        LQ      STR      r4,[r1,r5]
        0x0000170e:    1c52        R.      ADDS     r2,r2,#1
        0x00001710:    2a10        .*      CMP      r2,#0x10
        0x00001712:    d3ef        ..      BCC      0x16f4 ; STL_FullRamMarchC + 32
        0x00001714:    3140        @1      ADDS     r1,r1,#0x40
        0x00001716:    4c31        1L      LDR      r4,[pc,#196] ; [0x17dc] = 0x20001ffc
        0x00001718:    42a1        .B      CMP      r1,r4
        0x0000171a:    d9e9        ..      BLS      0x16f0 ; STL_FullRamMarchC + 28
        0x0000171c:    2101        .!      MOVS     r1,#1
        0x0000171e:    0749        I.      LSLS     r1,r1,#29
        0x00001720:    e012        ..      B        0x1748 ; STL_FullRamMarchC + 116
        0x00001722:    2200        ."      MOVS     r2,#0
        0x00001724:    e00d        ..      B        0x1742 ; STL_FullRamMarchC + 110
        0x00001726:    4c2e        .L      LDR      r4,[pc,#184] ; [0x17e0] = 0x30d8
        0x00001728:    5ca4        .\      LDRB     r4,[r4,r2]
        0x0000172a:    00a4        ..      LSLS     r4,r4,#2
        0x0000172c:    590c        .Y      LDR      r4,[r1,r4]
        0x0000172e:    1c64        d.      ADDS     r4,r4,#1
        0x00001730:    2c00        .,      CMP      r4,#0
        0x00001732:    d000        ..      BEQ      0x1736 ; STL_FullRamMarchC + 98
        0x00001734:    2000        .       MOVS     r0,#0
        0x00001736:    2400        .$      MOVS     r4,#0
        0x00001738:    4d29        )M      LDR      r5,[pc,#164] ; [0x17e0] = 0x30d8
        0x0000173a:    5cad        .\      LDRB     r5,[r5,r2]
        0x0000173c:    00ad        ..      LSLS     r5,r5,#2
        0x0000173e:    514c        LQ      STR      r4,[r1,r5]
        0x00001740:    1c52        R.      ADDS     r2,r2,#1
        0x00001742:    2a10        .*      CMP      r2,#0x10
        0x00001744:    d3ef        ..      BCC      0x1726 ; STL_FullRamMarchC + 82
        0x00001746:    3140        @1      ADDS     r1,r1,#0x40
        0x00001748:    4c24        $L      LDR      r4,[pc,#144] ; [0x17dc] = 0x20001ffc
        0x0000174a:    42a1        .B      CMP      r1,r4
        0x0000174c:    d9e9        ..      BLS      0x1722 ; STL_FullRamMarchC + 78
        0x0000174e:    4621        !F      MOV      r1,r4
        0x00001750:    e014        ..      B        0x177c ; STL_FullRamMarchC + 168
        0x00001752:    2200        ."      MOVS     r2,#0
        0x00001754:    e00f        ..      B        0x1776 ; STL_FullRamMarchC + 162
        0x00001756:    4c23        #L      LDR      r4,[pc,#140] ; [0x17e4] = 0x30e8
        0x00001758:    5ca4        .\      LDRB     r4,[r4,r2]
        0x0000175a:    00a4        ..      LSLS     r4,r4,#2
        0x0000175c:    1b0c        ..      SUBS     r4,r1,r4
        0x0000175e:    6824        $h      LDR      r4,[r4,#0]
        0x00001760:    2c00        .,      CMP      r4,#0
        0x00001762:    d000        ..      BEQ      0x1766 ; STL_FullRamMarchC + 146
        0x00001764:    2000        .       MOVS     r0,#0
        0x00001766:    2400        .$      MOVS     r4,#0
        0x00001768:    43e4        .C      MVNS     r4,r4
        0x0000176a:    4d1e        .M      LDR      r5,[pc,#120] ; [0x17e4] = 0x30e8
        0x0000176c:    5cad        .\      LDRB     r5,[r5,r2]
        0x0000176e:    00ad        ..      LSLS     r5,r5,#2
        0x00001770:    1b4d        M.      SUBS     r5,r1,r5
        0x00001772:    602c        ,`      STR      r4,[r5,#0]
        0x00001774:    1c52        R.      ADDS     r2,r2,#1
        0x00001776:    2a10        .*      CMP      r2,#0x10
        0x00001778:    d3ed        ..      BCC      0x1756 ; STL_FullRamMarchC + 130
        0x0000177a:    3940        @9      SUBS     r1,r1,#0x40
        0x0000177c:    2401        .$      MOVS     r4,#1
        0x0000177e:    0764        d.      LSLS     r4,r4,#29
        0x00001780:    42a1        .B      CMP      r1,r4
        0x00001782:    d8e6        ..      BHI      0x1752 ; STL_FullRamMarchC + 126
        0x00001784:    4915        .I      LDR      r1,[pc,#84] ; [0x17dc] = 0x20001ffc
        0x00001786:    e014        ..      B        0x17b2 ; STL_FullRamMarchC + 222
        0x00001788:    2200        ."      MOVS     r2,#0
        0x0000178a:    e00f        ..      B        0x17ac ; STL_FullRamMarchC + 216
        0x0000178c:    4c15        .L      LDR      r4,[pc,#84] ; [0x17e4] = 0x30e8
        0x0000178e:    5ca4        .\      LDRB     r4,[r4,r2]
        0x00001790:    00a4        ..      LSLS     r4,r4,#2
        0x00001792:    1b0c        ..      SUBS     r4,r1,r4
        0x00001794:    6824        $h      LDR      r4,[r4,#0]
        0x00001796:    1c64        d.      ADDS     r4,r4,#1
        0x00001798:    2c00        .,      CMP      r4,#0
        0x0000179a:    d000        ..      BEQ      0x179e ; STL_FullRamMarchC + 202
        0x0000179c:    2000        .       MOVS     r0,#0
        0x0000179e:    2400        .$      MOVS     r4,#0
        0x000017a0:    4d10        .M      LDR      r5,[pc,#64] ; [0x17e4] = 0x30e8
        0x000017a2:    5cad        .\      LDRB     r5,[r5,r2]
        0x000017a4:    00ad        ..      LSLS     r5,r5,#2
        0x000017a6:    1b4d        M.      SUBS     r5,r1,r5
        0x000017a8:    602c        ,`      STR      r4,[r5,#0]
        0x000017aa:    1c52        R.      ADDS     r2,r2,#1
        0x000017ac:    2a10        .*      CMP      r2,#0x10
        0x000017ae:    d3ed        ..      BCC      0x178c ; STL_FullRamMarchC + 184
        0x000017b0:    3940        @9      SUBS     r1,r1,#0x40
        0x000017b2:    2401        .$      MOVS     r4,#1
        0x000017b4:    0764        d.      LSLS     r4,r4,#29
        0x000017b6:    42a1        .B      CMP      r1,r4
        0x000017b8:    d8e6        ..      BHI      0x1788 ; STL_FullRamMarchC + 180
        0x000017ba:    4621        !F      MOV      r1,r4
        0x000017bc:    e004        ..      B        0x17c8 ; STL_FullRamMarchC + 244
        0x000017be:    680c        .h      LDR      r4,[r1,#0]
        0x000017c0:    2c00        .,      CMP      r4,#0
        0x000017c2:    d000        ..      BEQ      0x17c6 ; STL_FullRamMarchC + 242
        0x000017c4:    2000        .       MOVS     r0,#0
        0x000017c6:    1d09        ..      ADDS     r1,r1,#4
        0x000017c8:    4c04        .L      LDR      r4,[pc,#16] ; [0x17dc] = 0x20001ffc
        0x000017ca:    42a1        .B      CMP      r1,r4
        0x000017cc:    d9f7        ..      BLS      0x17be ; STL_FullRamMarchC + 234
        0x000017ce:    2400        .$      MOVS     r4,#0
        0x000017d0:    43e4        .C      MVNS     r4,r4
        0x000017d2:    4d05        .M      LDR      r5,[pc,#20] ; [0x17e8] = 0x20000080
        0x000017d4:    602c        ,`      STR      r4,[r5,#0]
        0x000017d6:    466c        lF      MOV      r4,sp
        0x000017d8:    6123        #a      STR      r3,[r4,#0x10]
        0x000017da:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x000017dc:    20001ffc    ...     DCD    536879100
        0x000017e0:    000030d8    .0..    DCD    12504
        0x000017e4:    000030e8    .0..    DCD    12520
        0x000017e8:    20000080    ...     DCD    536871040
    $t
    i.STL_HSEinit
    STL_HSEinit
        0x000017ec:    b570        p.      PUSH     {r4-r6,lr}
        0x000017ee:    2500        .%      MOVS     r5,#0
        0x000017f0:    4812        .H      LDR      r0,[pc,#72] ; [0x183c] = 0x20000040
        0x000017f2:    6800        .h      LDR      r0,[r0,#0]
        0x000017f4:    3025        %0      ADDS     r0,r0,#0x25
        0x000017f6:    4911        .I      LDR      r1,[pc,#68] ; [0x183c] = 0x20000040
        0x000017f8:    6008        .`      STR      r0,[r1,#0]
        0x000017fa:    2301        .#      MOVS     r3,#1
        0x000017fc:    2207        ."      MOVS     r2,#7
        0x000017fe:    2102        .!      MOVS     r1,#2
        0x00001800:    480f        .H      LDR      r0,[pc,#60] ; [0x1840] = 0x400a0010
        0x00001802:    f7fffd23    ..#.    BL       PORT_Init ; 0x124c
        0x00001806:    2301        .#      MOVS     r3,#1
        0x00001808:    2207        ."      MOVS     r2,#7
        0x0000180a:    4619        .F      MOV      r1,r3
        0x0000180c:    480c        .H      LDR      r0,[pc,#48] ; [0x1840] = 0x400a0010
        0x0000180e:    f7fffd1d    ....    BL       PORT_Init ; 0x124c
        0x00001812:    480c        .H      LDR      r0,[pc,#48] ; [0x1844] = 0x400aa000
