Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00001814:    6a00        .j      LDR      r0,[r0,#0x20]
        0x00001816:    490c        .I      LDR      r1,[pc,#48] ; [0x1848] = 0x70002
        0x00001818:    4308        .C      ORRS     r0,r0,r1
        0x0000181a:    490a        .I      LDR      r1,[pc,#40] ; [0x1844] = 0x400aa000
        0x0000181c:    6208        .b      STR      r0,[r1,#0x20]
        0x0000181e:    2400        .$      MOVS     r4,#0
        0x00001820:    e001        ..      B        0x1826 ; STL_HSEinit + 58
        0x00001822:    bf00        ..      NOP      
        0x00001824:    1c64        d.      ADDS     r4,r4,#1
        0x00001826:    4809        .H      LDR      r0,[pc,#36] ; [0x184c] = 0xbb8
        0x00001828:    4284        .B      CMP      r4,r0
        0x0000182a:    d3fa        ..      BCC      0x1822 ; STL_HSEinit + 54
        0x0000182c:    2501        .%      MOVS     r5,#1
        0x0000182e:    4808        .H      LDR      r0,[pc,#32] ; [0x1850] = 0x20000080
        0x00001830:    6800        .h      LDR      r0,[r0,#0]
        0x00001832:    3825        %8      SUBS     r0,r0,#0x25
        0x00001834:    4906        .I      LDR      r1,[pc,#24] ; [0x1850] = 0x20000080
        0x00001836:    6008        .`      STR      r0,[r1,#0]
        0x00001838:    4628        (F      MOV      r0,r5
        0x0000183a:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0000183c:    20000040    @..     DCD    536870976
        0x00001840:    400a0010    ...@    DCD    1074397200
        0x00001844:    400aa000    ...@    DCD    1074438144
        0x00001848:    00070002    ....    DCD    458754
        0x0000184c:    00000bb8    ....    DCD    3000
        0x00001850:    20000080    ...     DCD    536871040
    $t
    i.STL_InitRunTimeChecks
    STL_InitRunTimeChecks
        0x00001854:    b510        ..      PUSH     {r4,lr}
        0x00001856:    2000        .       MOVS     r0,#0
        0x00001858:    4920         I      LDR      r1,[pc,#128] ; [0x18dc] = 0x20000058
        0x0000185a:    6008        .`      STR      r0,[r1,#0]
        0x0000185c:    1e40        @.      SUBS     r0,r0,#1
        0x0000185e:    4920         I      LDR      r1,[pc,#128] ; [0x18e0] = 0x20000098
        0x00001860:    6008        .`      STR      r0,[r1,#0]
        0x00001862:    2000        .       MOVS     r0,#0
        0x00001864:    491f        .I      LDR      r1,[pc,#124] ; [0x18e4] = 0x2000005c
        0x00001866:    6008        .`      STR      r0,[r1,#0]
        0x00001868:    1e40        @.      SUBS     r0,r0,#1
        0x0000186a:    491f        .I      LDR      r1,[pc,#124] ; [0x18e8] = 0x2000009c
        0x0000186c:    6008        .`      STR      r0,[r1,#0]
        0x0000186e:    2000        .       MOVS     r0,#0
        0x00001870:    491e        .I      LDR      r1,[pc,#120] ; [0x18ec] = 0x20000060
        0x00001872:    6008        .`      STR      r0,[r1,#0]
        0x00001874:    1e40        @.      SUBS     r0,r0,#1
        0x00001876:    491e        .I      LDR      r1,[pc,#120] ; [0x18f0] = 0x200000a0
        0x00001878:    6008        .`      STR      r0,[r1,#0]
        0x0000187a:    2000        .       MOVS     r0,#0
        0x0000187c:    491d        .I      LDR      r1,[pc,#116] ; [0x18f4] = 0x20000044
        0x0000187e:    6008        .`      STR      r0,[r1,#0]
        0x00001880:    1e40        @.      SUBS     r0,r0,#1
        0x00001882:    491d        .I      LDR      r1,[pc,#116] ; [0x18f8] = 0x20000084
        0x00001884:    6008        .`      STR      r0,[r1,#0]
        0x00001886:    f000fb47    ..G.    BL       STL_TranspMarchCInit ; 0x1f18
        0x0000188a:    2000        .       MOVS     r0,#0
        0x0000188c:    491b        .I      LDR      r1,[pc,#108] ; [0x18fc] = 0x20000054
        0x0000188e:    6008        .`      STR      r0,[r1,#0]
        0x00001890:    1e40        @.      SUBS     r0,r0,#1
        0x00001892:    491b        .I      LDR      r1,[pc,#108] ; [0x1900] = 0x20000094
        0x00001894:    6008        .`      STR      r0,[r1,#0]
        0x00001896:    f7fffd13    ....    BL       RTC_GetSubSecond ; 0x12c0
        0x0000189a:    491a        .I      LDR      r1,[pc,#104] ; [0x1904] = 0x20000050
        0x0000189c:    6008        .`      STR      r0,[r1,#0]
        0x0000189e:    4608        .F      MOV      r0,r1
        0x000018a0:    6800        .h      LDR      r0,[r0,#0]
        0x000018a2:    43c0        .C      MVNS     r0,r0
        0x000018a4:    4918        .I      LDR      r1,[pc,#96] ; [0x1908] = 0x20000090
        0x000018a6:    6008        .`      STR      r0,[r1,#0]
        0x000018a8:    f000f998    ....    BL       STL_SysTickConfig ; 0x1bdc
        0x000018ac:    f7fffefc    ....    BL       STL_FlashCrc32Init ; 0x16a8
        0x000018b0:    2114        .!      MOVS     r1,#0x14
        0x000018b2:    4816        .H      LDR      r0,[pc,#88] ; [0x190c] = 0x200000c0
        0x000018b4:    6800        .h      LDR      r0,[r0,#0]
        0x000018b6:    f7fefe59    ..Y.    BL       __aeabi_uidiv ; 0x56c
        0x000018ba:    4604        .F      MOV      r4,r0
        0x000018bc:    4622        "F      MOV      r2,r4
        0x000018be:    2100        .!      MOVS     r1,#0
        0x000018c0:    4813        .H      LDR      r0,[pc,#76] ; [0x1910] = 0x400a0800
        0x000018c2:    f001f825    ..%.    BL       WDT_Init ; 0x2910
        0x000018c6:    4812        .H      LDR      r0,[pc,#72] ; [0x1910] = 0x400a0800
        0x000018c8:    f001f858    ..X.    BL       WDT_Start ; 0x297c
        0x000018cc:    2000        .       MOVS     r0,#0
        0x000018ce:    4911        .I      LDR      r1,[pc,#68] ; [0x1914] = 0x20000040
        0x000018d0:    6008        .`      STR      r0,[r1,#0]
        0x000018d2:    1e40        @.      SUBS     r0,r0,#1
        0x000018d4:    4910        .I      LDR      r1,[pc,#64] ; [0x1918] = 0x20000080
        0x000018d6:    6008        .`      STR      r0,[r1,#0]
        0x000018d8:    bd10        ..      POP      {r4,pc}
    $d
        0x000018da:    0000        ..      DCW    0
        0x000018dc:    20000058    X..     DCD    536871000
        0x000018e0:    20000098    ...     DCD    536871064
        0x000018e4:    2000005c    \..     DCD    536871004
        0x000018e8:    2000009c    ...     DCD    536871068
        0x000018ec:    20000060    `..     DCD    536871008
        0x000018f0:    200000a0    ...     DCD    536871072
        0x000018f4:    20000044    D..     DCD    536870980
        0x000018f8:    20000084    ...     DCD    536871044
        0x000018fc:    20000054    T..     DCD    536870996
        0x00001900:    20000094    ...     DCD    536871060
        0x00001904:    20000050    P..     DCD    536870992
        0x00001908:    20000090    ...     DCD    536871056
        0x0000190c:    200000c0    ...     DCD    536871104
        0x00001910:    400a0800    ...@    DCD    1074399232
        0x00001914:    20000040    @..     DCD    536870976
        0x00001918:    20000080    ...     DCD    536871040
    $t
    i.STL_LSIinit
    STL_LSIinit
        0x0000191c:    2000        .       MOVS     r0,#0
        0x0000191e:    4a0b        .J      LDR      r2,[pc,#44] ; [0x194c] = 0x20000040
        0x00001920:    6812        .h      LDR      r2,[r2,#0]
        0x00001922:    321f        .2      ADDS     r2,r2,#0x1f
        0x00001924:    4b09        .K      LDR      r3,[pc,#36] ; [0x194c] = 0x20000040
        0x00001926:    601a        .`      STR      r2,[r3,#0]
        0x00001928:    2201        ."      MOVS     r2,#1
        0x0000192a:    4b09        .K      LDR      r3,[pc,#36] ; [0x1950] = 0x400aa040
        0x0000192c:    611a        .a      STR      r2,[r3,#0x10]
        0x0000192e:    2100        .!      MOVS     r1,#0
        0x00001930:    e001        ..      B        0x1936 ; STL_LSIinit + 26
        0x00001932:    bf00        ..      NOP      
        0x00001934:    1c49        I.      ADDS     r1,r1,#1
        0x00001936:    4a07        .J      LDR      r2,[pc,#28] ; [0x1954] = 0xbb8
        0x00001938:    4291        .B      CMP      r1,r2
        0x0000193a:    d3fa        ..      BCC      0x1932 ; STL_LSIinit + 22
        0x0000193c:    2001        .       MOVS     r0,#1
        0x0000193e:    4a06        .J      LDR      r2,[pc,#24] ; [0x1958] = 0x20000080
        0x00001940:    6812        .h      LDR      r2,[r2,#0]
        0x00001942:    3a1f        .:      SUBS     r2,r2,#0x1f
        0x00001944:    4b04        .K      LDR      r3,[pc,#16] ; [0x1958] = 0x20000080
        0x00001946:    601a        .`      STR      r2,[r3,#0]
        0x00001948:    4770        pG      BX       lr
    $d
        0x0000194a:    0000        ..      DCW    0
        0x0000194c:    20000040    @..     DCD    536870976
        0x00001950:    400aa040    @..@    DCD    1074438208
        0x00001954:    00000bb8    ....    DCD    3000
        0x00001958:    20000080    ...     DCD    536871040
    $t
    i.STL_MainClockTest
    STL_MainClockTest
        0x0000195c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000195e:    2503        .%      MOVS     r5,#3
        0x00001960:    4826        &H      LDR      r0,[pc,#152] ; [0x19fc] = 0x20000040
        0x00001962:    6800        .h      LDR      r0,[r0,#0]
        0x00001964:    301d        .0      ADDS     r0,r0,#0x1d
        0x00001966:    4925        %I      LDR      r1,[pc,#148] ; [0x19fc] = 0x20000040
        0x00001968:    6008        .`      STR      r0,[r1,#0]
        0x0000196a:    4825        %H      LDR      r0,[pc,#148] ; [0x1a00] = 0x20000054
        0x0000196c:    6800        .h      LDR      r0,[r0,#0]
        0x0000196e:    4925        %I      LDR      r1,[pc,#148] ; [0x1a04] = 0x20000094
        0x00001970:    6809        .h      LDR      r1,[r1,#0]
        0x00001972:    4048        H@      EORS     r0,r0,r1
        0x00001974:    1c40        @.      ADDS     r0,r0,#1
        0x00001976:    2800        .(      CMP      r0,#0
        0x00001978:    d137        7.      BNE      0x19ea ; STL_MainClockTest + 142
        0x0000197a:    4823        #H      LDR      r0,[pc,#140] ; [0x1a08] = 0x20000050
        0x0000197c:    6800        .h      LDR      r0,[r0,#0]
        0x0000197e:    4923        #I      LDR      r1,[pc,#140] ; [0x1a0c] = 0x20000090
        0x00001980:    6809        .h      LDR      r1,[r1,#0]
        0x00001982:    4048        H@      EORS     r0,r0,r1
        0x00001984:    1c40        @.      ADDS     r0,r0,#1
        0x00001986:    2800        .(      CMP      r0,#0
        0x00001988:    d12f        /.      BNE      0x19ea ; STL_MainClockTest + 142
        0x0000198a:    481f        .H      LDR      r0,[pc,#124] ; [0x1a08] = 0x20000050
        0x0000198c:    6800        .h      LDR      r0,[r0,#0]
        0x0000198e:    2800        .(      CMP      r0,#0
        0x00001990:    d10b        ..      BNE      0x19aa ; STL_MainClockTest + 78
        0x00001992:    2507        .%      MOVS     r5,#7
        0x00001994:    4819        .H      LDR      r0,[pc,#100] ; [0x19fc] = 0x20000040
        0x00001996:    6800        .h      LDR      r0,[r0,#0]
        0x00001998:    303d        =0      ADDS     r0,r0,#0x3d
        0x0000199a:    4918        .I      LDR      r1,[pc,#96] ; [0x19fc] = 0x20000040
        0x0000199c:    6008        .`      STR      r0,[r1,#0]
        0x0000199e:    481c        .H      LDR      r0,[pc,#112] ; [0x1a10] = 0x20000080
        0x000019a0:    6800        .h      LDR      r0,[r0,#0]
        0x000019a2:    383d        =8      SUBS     r0,r0,#0x3d
        0x000019a4:    491a        .I      LDR      r1,[pc,#104] ; [0x1a10] = 0x20000080
        0x000019a6:    6008        .`      STR      r0,[r1,#0]
        0x000019a8:    e020         .      B        0x19ec ; STL_MainClockTest + 144
        0x000019aa:    4817        .H      LDR      r0,[pc,#92] ; [0x1a08] = 0x20000050
        0x000019ac:    6800        .h      LDR      r0,[r0,#0]
        0x000019ae:    4914        .I      LDR      r1,[pc,#80] ; [0x1a00] = 0x20000054
        0x000019b0:    6809        .h      LDR      r1,[r1,#0]
        0x000019b2:    4288        .B      CMP      r0,r1
        0x000019b4:    d905        ..      BLS      0x19c2 ; STL_MainClockTest + 102
        0x000019b6:    4814        .H      LDR      r0,[pc,#80] ; [0x1a08] = 0x20000050
        0x000019b8:    6800        .h      LDR      r0,[r0,#0]
        0x000019ba:    4911        .I      LDR      r1,[pc,#68] ; [0x1a00] = 0x20000054
        0x000019bc:    6809        .h      LDR      r1,[r1,#0]
        0x000019be:    1a44        D.      SUBS     r4,r0,r1
        0x000019c0:    e006        ..      B        0x19d0 ; STL_MainClockTest + 116
        0x000019c2:    4811        .H      LDR      r0,[pc,#68] ; [0x1a08] = 0x20000050
        0x000019c4:    6800        .h      LDR      r0,[r0,#0]
        0x000019c6:    4913        .I      LDR      r1,[pc,#76] ; [0x1a14] = 0xffffff
        0x000019c8:    1840        @.      ADDS     r0,r0,r1
        0x000019ca:    490d        .I      LDR      r1,[pc,#52] ; [0x1a00] = 0x20000054
        0x000019cc:    6809        .h      LDR      r1,[r1,#0]
        0x000019ce:    1a44        D.      SUBS     r4,r0,r1
        0x000019d0:    210a        .!      MOVS     r1,#0xa
        0x000019d2:    4620         F      MOV      r0,r4
        0x000019d4:    f7fefdca    ....    BL       __aeabi_uidiv ; 0x56c
        0x000019d8:    4606        .F      MOV      r6,r0
        0x000019da:    f7fffc79    ..y.    BL       STL_CheckPeriod ; 0x12d0
        0x000019de:    2807        .(      CMP      r0,#7
        0x000019e0:    d101        ..      BNE      0x19e6 ; STL_MainClockTest + 138
        0x000019e2:    2507        .%      MOVS     r5,#7
        0x000019e4:    e002        ..      B        0x19ec ; STL_MainClockTest + 144
        0x000019e6:    2504        .%      MOVS     r5,#4
        0x000019e8:    e000        ..      B        0x19ec ; STL_MainClockTest + 144
        0x000019ea:    2505        .%      MOVS     r5,#5
        0x000019ec:    4808        .H      LDR      r0,[pc,#32] ; [0x1a10] = 0x20000080
        0x000019ee:    6800        .h      LDR      r0,[r0,#0]
        0x000019f0:    381d        .8      SUBS     r0,r0,#0x1d
        0x000019f2:    4907        .I      LDR      r1,[pc,#28] ; [0x1a10] = 0x20000080
        0x000019f4:    6008        .`      STR      r0,[r1,#0]
        0x000019f6:    4628        (F      MOV      r0,r5
        0x000019f8:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000019fa:    0000        ..      DCW    0
        0x000019fc:    20000040    @..     DCD    536870976
        0x00001a00:    20000054    T..     DCD    536870996
        0x00001a04:    20000094    ...     DCD    536871060
        0x00001a08:    20000050    P..     DCD    536870992
        0x00001a0c:    20000090    ...     DCD    536871056
        0x00001a10:    20000080    ...     DCD    536871040
        0x00001a14:    00ffffff    ....    DCD    16777215
    $t
    i.STL_StartUp
    STL_StartUp
        0x00001a18:    b510        ..      PUSH     {r4,lr}
        0x00001a1a:    f7fffc57    ..W.    BL       STLSystemInit ; 0x12cc
        0x00001a1e:    2002        .       MOVS     r0,#2
        0x00001a20:    4954        TI      LDR      r1,[pc,#336] ; [0x1b74] = 0x20000040
        0x00001a22:    6008        .`      STR      r0,[r1,#0]
        0x00001a24:    1ec0        ..      SUBS     r0,r0,#3
        0x00001a26:    4954        TI      LDR      r1,[pc,#336] ; [0x1b78] = 0x20000080
        0x00001a28:    6008        .`      STR      r0,[r1,#0]
        0x00001a2a:    f7fefc93    ....    BL       STL_StartUpCPUTest ; 0x354
        0x00001a2e:    2801        .(      CMP      r0,#1
        0x00001a30:    d001        ..      BEQ      0x1a36 ; STL_StartUp + 30
        0x00001a32:    f7fffb05    ....    BL       FailSafePOR ; 0x1040
        0x00001a36:    4850        PH      LDR      r0,[pc,#320] ; [0x1b78] = 0x20000080
        0x00001a38:    6800        .h      LDR      r0,[r0,#0]
        0x00001a3a:    1e80        ..      SUBS     r0,r0,#2
        0x00001a3c:    494e        NI      LDR      r1,[pc,#312] ; [0x1b78] = 0x20000080
        0x00001a3e:    6008        .`      STR      r0,[r1,#0]
        0x00001a40:    484c        LH      LDR      r0,[pc,#304] ; [0x1b74] = 0x20000040
        0x00001a42:    6800        .h      LDR      r0,[r0,#0]
        0x00001a44:    1d40        @.      ADDS     r0,r0,#5
        0x00001a46:    494b        KI      LDR      r1,[pc,#300] ; [0x1b74] = 0x20000040
        0x00001a48:    6008        .`      STR      r0,[r1,#0]
        0x00001a4a:    f000fa73    ..s.    BL       STL_WDGSelfTest ; 0x1f34
        0x00001a4e:    484a        JH      LDR      r0,[pc,#296] ; [0x1b78] = 0x20000080
        0x00001a50:    6800        .h      LDR      r0,[r0,#0]
        0x00001a52:    1f40        @.      SUBS     r0,r0,#5
        0x00001a54:    4948        HI      LDR      r1,[pc,#288] ; [0x1b78] = 0x20000080
        0x00001a56:    6008        .`      STR      r0,[r1,#0]
        0x00001a58:    4846        FH      LDR      r0,[pc,#280] ; [0x1b74] = 0x20000040
        0x00001a5a:    6800        .h      LDR      r0,[r0,#0]
        0x00001a5c:    300b        .0      ADDS     r0,r0,#0xb
        0x00001a5e:    4945        EI      LDR      r1,[pc,#276] ; [0x1b74] = 0x20000040
        0x00001a60:    6008        .`      STR      r0,[r1,#0]
        0x00001a62:    2200        ."      MOVS     r2,#0
        0x00001a64:    4945        EI      LDR      r1,[pc,#276] ; [0x1b7c] = 0x3180
        0x00001a66:    4610        .F      MOV      r0,r2
        0x00001a68:    f7fffac6    ....    BL       CRC_CalcBlockCrc ; 0xff8
        0x00001a6c:    4944        DI      LDR      r1,[pc,#272] ; [0x1b80] = 0x20000070
        0x00001a6e:    6008        .`      STR      r0,[r1,#0]
        0x00001a70:    4608        .F      MOV      r0,r1
        0x00001a72:    6800        .h      LDR      r0,[r0,#0]
        0x00001a74:    4941        AI      LDR      r1,[pc,#260] ; [0x1b7c] = 0x3180
        0x00001a76:    6809        .h      LDR      r1,[r1,#0]
        0x00001a78:    4288        .B      CMP      r0,r1
        0x00001a7a:    d001        ..      BEQ      0x1a80 ; STL_StartUp + 104
        0x00001a7c:    f7fffae0    ....    BL       FailSafePOR ; 0x1040
        0x00001a80:    483f        ?H      LDR      r0,[pc,#252] ; [0x1b80] = 0x20000070
        0x00001a82:    6800        .h      LDR      r0,[r0,#0]
        0x00001a84:    493f        ?I      LDR      r1,[pc,#252] ; [0x1b84] = 0x40000080
        0x00001a86:    6108        .a      STR      r0,[r1,#0x10]
        0x00001a88:    483d        =H      LDR      r0,[pc,#244] ; [0x1b80] = 0x20000070
        0x00001a8a:    6800        .h      LDR      r0,[r0,#0]
        0x00001a8c:    43c0        .C      MVNS     r0,r0
        0x00001a8e:    6148        Ha      STR      r0,[r1,#0x14]
        0x00001a90:    4839        9H      LDR      r0,[pc,#228] ; [0x1b78] = 0x20000080
        0x00001a92:    6800        .h      LDR      r0,[r0,#0]
        0x00001a94:    380b        .8      SUBS     r0,r0,#0xb
        0x00001a96:    4938        8I      LDR      r1,[pc,#224] ; [0x1b78] = 0x20000080
        0x00001a98:    6008        .`      STR      r0,[r1,#0]
        0x00001a9a:    4836        6H      LDR      r0,[pc,#216] ; [0x1b74] = 0x20000040
        0x00001a9c:    6800        .h      LDR      r0,[r0,#0]
        0x00001a9e:    6809        .h      LDR      r1,[r1,#0]
        0x00001aa0:    4048        H@      EORS     r0,r0,r1
        0x00001aa2:    1c40        @.      ADDS     r0,r0,#1
        0x00001aa4:    2800        .(      CMP      r0,#0
        0x00001aa6:    d103        ..      BNE      0x1ab0 ; STL_StartUp + 152
        0x00001aa8:    4832        2H      LDR      r0,[pc,#200] ; [0x1b74] = 0x20000040
        0x00001aaa:    6800        .h      LDR      r0,[r0,#0]
        0x00001aac:    2822        "(      CMP      r0,#0x22
        0x00001aae:    d001        ..      BEQ      0x1ab4 ; STL_StartUp + 156
        0x00001ab0:    f7fffac6    ....    BL       FailSafePOR ; 0x1040
        0x00001ab4:    f7fffe0e    ....    BL       STL_FullRamMarchC ; 0x16d4
        0x00001ab8:    2801        .(      CMP      r0,#1
        0x00001aba:    d001        ..      BEQ      0x1ac0 ; STL_StartUp + 168
        0x00001abc:    f7fffac0    ....    BL       FailSafePOR ; 0x1040
        0x00001ac0:    4830        0H      LDR      r0,[pc,#192] ; [0x1b84] = 0x40000080
        0x00001ac2:    6900        .i      LDR      r0,[r0,#0x10]
        0x00001ac4:    492f        /I      LDR      r1,[pc,#188] ; [0x1b84] = 0x40000080
        0x00001ac6:    6949        Ii      LDR      r1,[r1,#0x14]
        0x00001ac8:    4048        H@      EORS     r0,r0,r1
        0x00001aca:    1c40        @.      ADDS     r0,r0,#1
        0x00001acc:    2800        .(      CMP      r0,#0
        0x00001ace:    d109        ..      BNE      0x1ae4 ; STL_StartUp + 204
        0x00001ad0:    482c        ,H      LDR      r0,[pc,#176] ; [0x1b84] = 0x40000080
        0x00001ad2:    6900        .i      LDR      r0,[r0,#0x10]
        0x00001ad4:    492c        ,I      LDR      r1,[pc,#176] ; [0x1b88] = 0x20000068
        0x00001ad6:    6008        .`      STR      r0,[r1,#0]
        0x00001ad8:    4608        .F      MOV      r0,r1
        0x00001ada:    6800        .h      LDR      r0,[r0,#0]
        0x00001adc:    43c0        .C      MVNS     r0,r0
        0x00001ade:    492b        +I      LDR      r1,[pc,#172] ; [0x1b8c] = 0x200000a8
        0x00001ae0:    6008        .`      STR      r0,[r1,#0]
        0x00001ae2:    e001        ..      B        0x1ae8 ; STL_StartUp + 208
        0x00001ae4:    f7fffaac    ....    BL       FailSafePOR ; 0x1040
        0x00001ae8:    4822        "H      LDR      r0,[pc,#136] ; [0x1b74] = 0x20000040
        0x00001aea:    6800        .h      LDR      r0,[r0,#0]
        0x00001aec:    3017        .0      ADDS     r0,r0,#0x17
        0x00001aee:    4921        !I      LDR      r1,[pc,#132] ; [0x1b74] = 0x20000040
        0x00001af0:    6008        .`      STR      r0,[r1,#0]
        0x00001af2:    f7fffc63    ..c.    BL       STL_ClockStartUpTest ; 0x13bc
        0x00001af6:    0003        ..      MOVS     r3,r0
        0x00001af8:    f000ff45    ..E.    BL       __ARM_common_switch8 ; 0x2986
    $d
        0x00001afc:    0a080608    ....    DCD    168297992
        0x00001b00:    0e0e0c0f    ....    DCD    235801615
        0x00001b04:    0e05        ..      DCW    3589
    $t
        0x00001b06:    e00a        ..      B        0x1b1e ; STL_StartUp + 262
        0x00001b08:    f7fffa9a    ....    BL       FailSafePOR ; 0x1040
        0x00001b0c:    f7fffa98    ....    BL       FailSafePOR ; 0x1040
        0x00001b10:    f7fffa96    ....    BL       FailSafePOR ; 0x1040
        0x00001b14:    f7fffa94    ....    BL       FailSafePOR ; 0x1040
        0x00001b18:    bf00        ..      NOP      
        0x00001b1a:    f7fffa91    ....    BL       FailSafePOR ; 0x1040
        0x00001b1e:    bf00        ..      NOP      
        0x00001b20:    4815        .H      LDR      r0,[pc,#84] ; [0x1b78] = 0x20000080
        0x00001b22:    6800        .h      LDR      r0,[r0,#0]
        0x00001b24:    3817        .8      SUBS     r0,r0,#0x17
        0x00001b26:    4914        .I      LDR      r1,[pc,#80] ; [0x1b78] = 0x20000080
        0x00001b28:    6008        .`      STR      r0,[r1,#0]
        0x00001b2a:    4812        .H      LDR      r0,[pc,#72] ; [0x1b74] = 0x20000040
        0x00001b2c:    6800        .h      LDR      r0,[r0,#0]
        0x00001b2e:    3035        50      ADDS     r0,r0,#0x35
        0x00001b30:    4910        .I      LDR      r1,[pc,#64] ; [0x1b74] = 0x20000040
        0x00001b32:    6008        .`      STR      r0,[r1,#0]
        0x00001b34:    4816        .H      LDR      r0,[pc,#88] ; [0x1b90] = 0xaaaaaaaa
