Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00001b36:    4917        .I      LDR      r1,[pc,#92] ; [0x1b94] = 0x20003000
        0x00001b38:    6008        .`      STR      r0,[r1,#0]
        0x00001b3a:    4817        .H      LDR      r0,[pc,#92] ; [0x1b98] = 0xbbbbbbbb
        0x00001b3c:    6048        H`      STR      r0,[r1,#4]
        0x00001b3e:    4817        .H      LDR      r0,[pc,#92] ; [0x1b9c] = 0xcccccccc
        0x00001b40:    6088        .`      STR      r0,[r1,#8]
        0x00001b42:    4817        .H      LDR      r0,[pc,#92] ; [0x1ba0] = 0xdddddddd
        0x00001b44:    60c8        .`      STR      r0,[r1,#0xc]
        0x00001b46:    480c        .H      LDR      r0,[pc,#48] ; [0x1b78] = 0x20000080
        0x00001b48:    6800        .h      LDR      r0,[r0,#0]
        0x00001b4a:    3835        58      SUBS     r0,r0,#0x35
        0x00001b4c:    490a        .I      LDR      r1,[pc,#40] ; [0x1b78] = 0x20000080
        0x00001b4e:    6008        .`      STR      r0,[r1,#0]
        0x00001b50:    4808        .H      LDR      r0,[pc,#32] ; [0x1b74] = 0x20000040
        0x00001b52:    6800        .h      LDR      r0,[r0,#0]
        0x00001b54:    6809        .h      LDR      r1,[r1,#0]
        0x00001b56:    4048        H@      EORS     r0,r0,r1
        0x00001b58:    1c40        @.      ADDS     r0,r0,#1
        0x00001b5a:    2800        .(      CMP      r0,#0
        0x00001b5c:    d105        ..      BNE      0x1b6a ; STL_StartUp + 338
        0x00001b5e:    4805        .H      LDR      r0,[pc,#20] ; [0x1b74] = 0x20000040
        0x00001b60:    6800        .h      LDR      r0,[r0,#0]
        0x00001b62:    21ff        .!      MOVS     r1,#0xff
        0x00001b64:    3131        11      ADDS     r1,r1,#0x31
        0x00001b66:    4288        .B      CMP      r0,r1
        0x00001b68:    d001        ..      BEQ      0x1b6e ; STL_StartUp + 342
        0x00001b6a:    f7fffa69    ..i.    BL       FailSafePOR ; 0x1040
        0x00001b6e:    f7fefaf1    ....    BL       Reset_Handler ; 0x154
        0x00001b72:    bd10        ..      POP      {r4,pc}
    $d
        0x00001b74:    20000040    @..     DCD    536870976
        0x00001b78:    20000080    ...     DCD    536871040
        0x00001b7c:    00003180    .1..    DCD    12672
        0x00001b80:    20000070    p..     DCD    536871024
        0x00001b84:    40000080    ...@    DCD    1073741952
        0x00001b88:    20000068    h..     DCD    536871016
        0x00001b8c:    200000a8    ...     DCD    536871080
        0x00001b90:    aaaaaaaa    ....    DCD    2863311530
        0x00001b94:    20003000    .0.     DCD    536883200
        0x00001b98:    bbbbbbbb    ....    DCD    3149642683
        0x00001b9c:    cccccccc    ....    DCD    3435973836
        0x00001ba0:    dddddddd    ....    DCD    3722304989
    $t
    i.STL_SwitchToExtClockSrc
    STL_SwitchToExtClockSrc
        0x00001ba4:    2000        .       MOVS     r0,#0
        0x00001ba6:    490a        .I      LDR      r1,[pc,#40] ; [0x1bd0] = 0x20000040
        0x00001ba8:    6809        .h      LDR      r1,[r1,#0]
        0x00001baa:    312f        /1      ADDS     r1,r1,#0x2f
        0x00001bac:    4a08        .J      LDR      r2,[pc,#32] ; [0x1bd0] = 0x20000040
        0x00001bae:    6011        .`      STR      r1,[r2,#0]
        0x00001bb0:    2101        .!      MOVS     r1,#1
        0x00001bb2:    4a08        .J      LDR      r2,[pc,#32] ; [0x1bd4] = 0x400aa000
        0x00001bb4:    6011        .`      STR      r1,[r2,#0]
        0x00001bb6:    0789        ..      LSLS     r1,r1,#30
        0x00001bb8:    6809        .h      LDR      r1,[r1,#0]
        0x00001bba:    2201        ."      MOVS     r2,#1
        0x00001bbc:    4311        .C      ORRS     r1,r1,r2
        0x00001bbe:    0792        ..      LSLS     r2,r2,#30
        0x00001bc0:    6011        .`      STR      r1,[r2,#0]
        0x00001bc2:    2001        .       MOVS     r0,#1
        0x00001bc4:    4904        .I      LDR      r1,[pc,#16] ; [0x1bd8] = 0x20000080
        0x00001bc6:    6809        .h      LDR      r1,[r1,#0]
        0x00001bc8:    392f        /9      SUBS     r1,r1,#0x2f
        0x00001bca:    4a03        .J      LDR      r2,[pc,#12] ; [0x1bd8] = 0x20000080
        0x00001bcc:    6011        .`      STR      r1,[r2,#0]
        0x00001bce:    4770        pG      BX       lr
    $d
        0x00001bd0:    20000040    @..     DCD    536870976
        0x00001bd4:    400aa000    ...@    DCD    1074438144
        0x00001bd8:    20000080    ...     DCD    536871040
    $t
    i.STL_SysTickConfig
    STL_SysTickConfig
        0x00001bdc:    b510        ..      PUSH     {r4,lr}
        0x00001bde:    2001        .       MOVS     r0,#1
        0x00001be0:    43c0        .C      MVNS     r0,r0
        0x00001be2:    f000fa5f    .._.    BL       SysTick_CounterCmd ; 0x20a4
        0x00001be6:    2000        .       MOVS     r0,#0
        0x00001be8:    f000fa5c    ..\.    BL       SysTick_CounterCmd ; 0x20a4
        0x00001bec:    4804        .H      LDR      r0,[pc,#16] ; [0x1c00] = 0x5dc0
        0x00001bee:    f000fb21    ..!.    BL       SysTick_SetReload ; 0x2234
        0x00001bf2:    2001        .       MOVS     r0,#1
        0x00001bf4:    f000fb0c    ....    BL       SysTick_ITConfig ; 0x2210
        0x00001bf8:    2001        .       MOVS     r0,#1
        0x00001bfa:    f000fa53    ..S.    BL       SysTick_CounterCmd ; 0x20a4
        0x00001bfe:    bd10        ..      POP      {r4,pc}
    $d
        0x00001c00:    00005dc0    .]..    DCD    24000
    $t
    i.STL_SysTickInit
    STL_SysTickInit
        0x00001c04:    b510        ..      PUSH     {r4,lr}
        0x00001c06:    480a        .H      LDR      r0,[pc,#40] ; [0x1c30] = 0x20000040
        0x00001c08:    6800        .h      LDR      r0,[r0,#0]
        0x00001c0a:    302b        +0      ADDS     r0,r0,#0x2b
        0x00001c0c:    4908        .I      LDR      r1,[pc,#32] ; [0x1c30] = 0x20000040
        0x00001c0e:    6008        .`      STR      r0,[r1,#0]
        0x00001c10:    4808        .H      LDR      r0,[pc,#32] ; [0x1c34] = 0x5dc0
        0x00001c12:    f000fb0f    ....    BL       SysTick_SetReload ; 0x2234
        0x00001c16:    2000        .       MOVS     r0,#0
        0x00001c18:    f000fa44    ..D.    BL       SysTick_CounterCmd ; 0x20a4
        0x00001c1c:    2001        .       MOVS     r0,#1
        0x00001c1e:    f000fa41    ..A.    BL       SysTick_CounterCmd ; 0x20a4
        0x00001c22:    4805        .H      LDR      r0,[pc,#20] ; [0x1c38] = 0x20000080
        0x00001c24:    6800        .h      LDR      r0,[r0,#0]
        0x00001c26:    382b        +8      SUBS     r0,r0,#0x2b
        0x00001c28:    4903        .I      LDR      r1,[pc,#12] ; [0x1c38] = 0x20000080
        0x00001c2a:    6008        .`      STR      r0,[r1,#0]
        0x00001c2c:    bd10        ..      POP      {r4,pc}
    $d
        0x00001c2e:    0000        ..      DCW    0
        0x00001c30:    20000040    @..     DCD    536870976
        0x00001c34:    00005dc0    .]..    DCD    24000
        0x00001c38:    20000080    ...     DCD    536871040
    $t
    i.STL_TranspMarchC
    STL_TranspMarchC
        0x00001c3c:    b530        0.      PUSH     {r4,r5,lr}
        0x00001c3e:    2000        .       MOVS     r0,#0
        0x00001c40:    4bad        .K      LDR      r3,[pc,#692] ; [0x1ef8] = 0x20000044
        0x00001c42:    681b        .h      LDR      r3,[r3,#0]
        0x00001c44:    330b        .3      ADDS     r3,r3,#0xb
        0x00001c46:    4cac        .L      LDR      r4,[pc,#688] ; [0x1ef8] = 0x20000044
        0x00001c48:    6023        #`      STR      r3,[r4,#0]
        0x00001c4a:    4bac        .K      LDR      r3,[pc,#688] ; [0x1efc] = 0x20000030
        0x00001c4c:    681b        .h      LDR      r3,[r3,#0]
        0x00001c4e:    4cac        .L      LDR      r4,[pc,#688] ; [0x1f00] = 0x20000034
        0x00001c50:    6824        $h      LDR      r4,[r4,#0]
        0x00001c52:    4063        c@      EORS     r3,r3,r4
        0x00001c54:    1c5b        [.      ADDS     r3,r3,#1
        0x00001c56:    2b00        .+      CMP      r3,#0
        0x00001c58:    d17e        ~.      BNE      0x1d58 ; STL_TranspMarchC + 284
        0x00001c5a:    4ba8        .K      LDR      r3,[pc,#672] ; [0x1efc] = 0x20000030
        0x00001c5c:    681b        .h      LDR      r3,[r3,#0]
        0x00001c5e:    4ca9        .L      LDR      r4,[pc,#676] ; [0x1f04] = 0x20000100
        0x00001c60:    42a3        .B      CMP      r3,r4
        0x00001c62:    d37a        z.      BCC      0x1d5a ; STL_TranspMarchC + 286
        0x00001c64:    4ba8        .K      LDR      r3,[pc,#672] ; [0x1f08] = 0x20000004
        0x00001c66:    4ca5        .L      LDR      r4,[pc,#660] ; [0x1efc] = 0x20000030
        0x00001c68:    6023        #`      STR      r3,[r4,#0]
        0x00001c6a:    43db        .C      MVNS     r3,r3
        0x00001c6c:    4ca4        .L      LDR      r4,[pc,#656] ; [0x1f00] = 0x20000034
        0x00001c6e:    6023        #`      STR      r3,[r4,#0]
        0x00001c70:    49a6        .I      LDR      r1,[pc,#664] ; [0x1f0c] = 0x30fe
        0x00001c72:    bf00        ..      NOP      
        0x00001c74:    2300        .#      MOVS     r3,#0
        0x00001c76:    56cc        .V      LDRSB    r4,[r1,r3]
        0x00001c78:    00a4        ..      LSLS     r4,r4,#2
        0x00001c7a:    4da0        .M      LDR      r5,[pc,#640] ; [0x1efc] = 0x20000030
        0x00001c7c:    682d        -h      LDR      r5,[r5,#0]
        0x00001c7e:    512b        +Q      STR      r3,[r5,r4]
        0x00001c80:    1c49        I.      ADDS     r1,r1,#1
        0x00001c82:    4ba2        .K      LDR      r3,[pc,#648] ; [0x1f0c] = 0x30fe
        0x00001c84:    3309        .3      ADDS     r3,r3,#9
        0x00001c86:    4299        .B      CMP      r1,r3
        0x00001c88:    d3f4        ..      BCC      0x1c74 ; STL_TranspMarchC + 56
        0x00001c8a:    49a0        .I      LDR      r1,[pc,#640] ; [0x1f0c] = 0x30fe
        0x00001c8c:    bf00        ..      NOP      
        0x00001c8e:    2300        .#      MOVS     r3,#0
        0x00001c90:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001c92:    009b        ..      LSLS     r3,r3,#2
        0x00001c94:    4c99        .L      LDR      r4,[pc,#612] ; [0x1efc] = 0x20000030
        0x00001c96:    6824        $h      LDR      r4,[r4,#0]
        0x00001c98:    58e3        .X      LDR      r3,[r4,r3]
        0x00001c9a:    2b00        .+      CMP      r3,#0
        0x00001c9c:    d000        ..      BEQ      0x1ca0 ; STL_TranspMarchC + 100
        0x00001c9e:    2003        .       MOVS     r0,#3
        0x00001ca0:    2300        .#      MOVS     r3,#0
        0x00001ca2:    43db        .C      MVNS     r3,r3
        0x00001ca4:    2400        .$      MOVS     r4,#0
        0x00001ca6:    570c        .W      LDRSB    r4,[r1,r4]
        0x00001ca8:    00a4        ..      LSLS     r4,r4,#2
        0x00001caa:    4d94        .M      LDR      r5,[pc,#592] ; [0x1efc] = 0x20000030
        0x00001cac:    682d        -h      LDR      r5,[r5,#0]
        0x00001cae:    512b        +Q      STR      r3,[r5,r4]
        0x00001cb0:    1c49        I.      ADDS     r1,r1,#1
        0x00001cb2:    4b96        .K      LDR      r3,[pc,#600] ; [0x1f0c] = 0x30fe
        0x00001cb4:    3309        .3      ADDS     r3,r3,#9
        0x00001cb6:    4299        .B      CMP      r1,r3
        0x00001cb8:    d3e9        ..      BCC      0x1c8e ; STL_TranspMarchC + 82
        0x00001cba:    4994        .I      LDR      r1,[pc,#592] ; [0x1f0c] = 0x30fe
        0x00001cbc:    bf00        ..      NOP      
        0x00001cbe:    2300        .#      MOVS     r3,#0
        0x00001cc0:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001cc2:    009b        ..      LSLS     r3,r3,#2
        0x00001cc4:    4c8d        .L      LDR      r4,[pc,#564] ; [0x1efc] = 0x20000030
        0x00001cc6:    6824        $h      LDR      r4,[r4,#0]
        0x00001cc8:    58e3        .X      LDR      r3,[r4,r3]
        0x00001cca:    1c5b        [.      ADDS     r3,r3,#1
        0x00001ccc:    2b00        .+      CMP      r3,#0
        0x00001cce:    d000        ..      BEQ      0x1cd2 ; STL_TranspMarchC + 150
        0x00001cd0:    2003        .       MOVS     r0,#3
        0x00001cd2:    2300        .#      MOVS     r3,#0
        0x00001cd4:    56cc        .V      LDRSB    r4,[r1,r3]
        0x00001cd6:    00a4        ..      LSLS     r4,r4,#2
        0x00001cd8:    4d88        .M      LDR      r5,[pc,#544] ; [0x1efc] = 0x20000030
        0x00001cda:    682d        -h      LDR      r5,[r5,#0]
        0x00001cdc:    512b        +Q      STR      r3,[r5,r4]
        0x00001cde:    1c49        I.      ADDS     r1,r1,#1
        0x00001ce0:    4b8a        .K      LDR      r3,[pc,#552] ; [0x1f0c] = 0x30fe
        0x00001ce2:    3309        .3      ADDS     r3,r3,#9
        0x00001ce4:    4299        .B      CMP      r1,r3
        0x00001ce6:    d3ea        ..      BCC      0x1cbe ; STL_TranspMarchC + 130
        0x00001ce8:    1e59        Y.      SUBS     r1,r3,#1
        0x00001cea:    bf00        ..      NOP      
        0x00001cec:    2300        .#      MOVS     r3,#0
        0x00001cee:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001cf0:    009b        ..      LSLS     r3,r3,#2
        0x00001cf2:    4c82        .L      LDR      r4,[pc,#520] ; [0x1efc] = 0x20000030
        0x00001cf4:    6824        $h      LDR      r4,[r4,#0]
        0x00001cf6:    58e3        .X      LDR      r3,[r4,r3]
        0x00001cf8:    2b00        .+      CMP      r3,#0
        0x00001cfa:    d000        ..      BEQ      0x1cfe ; STL_TranspMarchC + 194
        0x00001cfc:    2003        .       MOVS     r0,#3
        0x00001cfe:    2300        .#      MOVS     r3,#0
        0x00001d00:    43db        .C      MVNS     r3,r3
        0x00001d02:    2400        .$      MOVS     r4,#0
        0x00001d04:    570c        .W      LDRSB    r4,[r1,r4]
        0x00001d06:    00a4        ..      LSLS     r4,r4,#2
        0x00001d08:    4d7c        |M      LDR      r5,[pc,#496] ; [0x1efc] = 0x20000030
        0x00001d0a:    682d        -h      LDR      r5,[r5,#0]
        0x00001d0c:    512b        +Q      STR      r3,[r5,r4]
        0x00001d0e:    1e49        I.      SUBS     r1,r1,#1
        0x00001d10:    4b7e        ~K      LDR      r3,[pc,#504] ; [0x1f0c] = 0x30fe
        0x00001d12:    4299        .B      CMP      r1,r3
        0x00001d14:    d2ea        ..      BCS      0x1cec ; STL_TranspMarchC + 176
        0x00001d16:    4619        .F      MOV      r1,r3
        0x00001d18:    3108        .1      ADDS     r1,r1,#8
        0x00001d1a:    bf00        ..      NOP      
        0x00001d1c:    2300        .#      MOVS     r3,#0
        0x00001d1e:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001d20:    009b        ..      LSLS     r3,r3,#2
        0x00001d22:    4c76        vL      LDR      r4,[pc,#472] ; [0x1efc] = 0x20000030
        0x00001d24:    6824        $h      LDR      r4,[r4,#0]
        0x00001d26:    58e3        .X      LDR      r3,[r4,r3]
        0x00001d28:    1c5b        [.      ADDS     r3,r3,#1
        0x00001d2a:    2b00        .+      CMP      r3,#0
        0x00001d2c:    d000        ..      BEQ      0x1d30 ; STL_TranspMarchC + 244
        0x00001d2e:    2003        .       MOVS     r0,#3
        0x00001d30:    2400        .$      MOVS     r4,#0
        0x00001d32:    570b        .W      LDRSB    r3,[r1,r4]
        0x00001d34:    009b        ..      LSLS     r3,r3,#2
        0x00001d36:    4d71        qM      LDR      r5,[pc,#452] ; [0x1efc] = 0x20000030
        0x00001d38:    682d        -h      LDR      r5,[r5,#0]
        0x00001d3a:    50ec        .P      STR      r4,[r5,r3]
        0x00001d3c:    1e49        I.      SUBS     r1,r1,#1
        0x00001d3e:    4b73        sK      LDR      r3,[pc,#460] ; [0x1f0c] = 0x30fe
        0x00001d40:    4299        .B      CMP      r1,r3
        0x00001d42:    d2eb        ..      BCS      0x1d1c ; STL_TranspMarchC + 224
        0x00001d44:    4619        .F      MOV      r1,r3
        0x00001d46:    bf00        ..      NOP      
        0x00001d48:    2300        .#      MOVS     r3,#0
        0x00001d4a:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001d4c:    009b        ..      LSLS     r3,r3,#2
        0x00001d4e:    4c6b        kL      LDR      r4,[pc,#428] ; [0x1efc] = 0x20000030
        0x00001d50:    6824        $h      LDR      r4,[r4,#0]
        0x00001d52:    58e3        .X      LDR      r3,[r4,r3]
        0x00001d54:    2b00        .+      CMP      r3,#0
        0x00001d56:    e001        ..      B        0x1d5c ; STL_TranspMarchC + 288
        0x00001d58:    e0c7        ..      B        0x1eea ; STL_TranspMarchC + 686
        0x00001d5a:    e01d        ..      B        0x1d98 ; STL_TranspMarchC + 348
        0x00001d5c:    d000        ..      BEQ      0x1d60 ; STL_TranspMarchC + 292
        0x00001d5e:    2003        .       MOVS     r0,#3
        0x00001d60:    1c49        I.      ADDS     r1,r1,#1
        0x00001d62:    4b6a        jK      LDR      r3,[pc,#424] ; [0x1f0c] = 0x30fe
        0x00001d64:    3309        .3      ADDS     r3,r3,#9
        0x00001d66:    4299        .B      CMP      r1,r3
        0x00001d68:    d3ee        ..      BCC      0x1d48 ; STL_TranspMarchC + 268
        0x00001d6a:    4b64        dK      LDR      r3,[pc,#400] ; [0x1efc] = 0x20000030
        0x00001d6c:    681b        .h      LDR      r3,[r3,#0]
        0x00001d6e:    4c64        dL      LDR      r4,[pc,#400] ; [0x1f00] = 0x20000034
        0x00001d70:    6824        $h      LDR      r4,[r4,#0]
        0x00001d72:    4063        c@      EORS     r3,r3,r4
        0x00001d74:    1c5b        [.      ADDS     r3,r3,#1
        0x00001d76:    2b00        .+      CMP      r3,#0
        0x00001d78:    d10c        ..      BNE      0x1d94 ; STL_TranspMarchC + 344
        0x00001d7a:    4b62        bK      LDR      r3,[pc,#392] ; [0x1f04] = 0x20000100
        0x00001d7c:    3bc0        .;      SUBS     r3,r3,#0xc0
        0x00001d7e:    4c5f        _L      LDR      r4,[pc,#380] ; [0x1efc] = 0x20000030
        0x00001d80:    6023        #`      STR      r3,[r4,#0]
        0x00001d82:    43db        .C      MVNS     r3,r3
        0x00001d84:    4c5e        ^L      LDR      r4,[pc,#376] ; [0x1f00] = 0x20000034
        0x00001d86:    6023        #`      STR      r3,[r4,#0]
        0x00001d88:    2800        .(      CMP      r0,#0
        0x00001d8a:    d101        ..      BNE      0x1d90 ; STL_TranspMarchC + 340
        0x00001d8c:    2004        .       MOVS     r0,#4
        0x00001d8e:    e0ad        ..      B        0x1eec ; STL_TranspMarchC + 688
        0x00001d90:    2003        .       MOVS     r0,#3
        0x00001d92:    e0ab        ..      B        0x1eec ; STL_TranspMarchC + 688
        0x00001d94:    2001        .       MOVS     r0,#1
        0x00001d96:    e0a9        ..      B        0x1eec ; STL_TranspMarchC + 688
        0x00001d98:    495d        ]I      LDR      r1,[pc,#372] ; [0x1f10] = 0x30f8
        0x00001d9a:    2200        ."      MOVS     r2,#0
        0x00001d9c:    bf00        ..      NOP      
        0x00001d9e:    2300        .#      MOVS     r3,#0
        0x00001da0:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001da2:    009b        ..      LSLS     r3,r3,#2
        0x00001da4:    4c55        UL      LDR      r4,[pc,#340] ; [0x1efc] = 0x20000030
        0x00001da6:    6824        $h      LDR      r4,[r4,#0]
        0x00001da8:    58e5        .X      LDR      r5,[r4,r3]
        0x00001daa:    4613        .F      MOV      r3,r2
        0x00001dac:    1c52        R.      ADDS     r2,r2,#1
        0x00001dae:    009b        ..      LSLS     r3,r3,#2
        0x00001db0:    4c55        UL      LDR      r4,[pc,#340] ; [0x1f08] = 0x20000004
        0x00001db2:    50e5        .P      STR      r5,[r4,r3]
        0x00001db4:    2300        .#      MOVS     r3,#0
        0x00001db6:    56cc        .V      LDRSB    r4,[r1,r3]
        0x00001db8:    00a4        ..      LSLS     r4,r4,#2
        0x00001dba:    4d50        PM      LDR      r5,[pc,#320] ; [0x1efc] = 0x20000030
        0x00001dbc:    682d        -h      LDR      r5,[r5,#0]
        0x00001dbe:    512b        +Q      STR      r3,[r5,r4]
        0x00001dc0:    1c49        I.      ADDS     r1,r1,#1
        0x00001dc2:    4b53        SK      LDR      r3,[pc,#332] ; [0x1f10] = 0x30f8
        0x00001dc4:    1d9b        ..      ADDS     r3,r3,#6
        0x00001dc6:    4299        .B      CMP      r1,r3
        0x00001dc8:    d3e9        ..      BCC      0x1d9e ; STL_TranspMarchC + 354
        0x00001dca:    1f99        ..      SUBS     r1,r3,#6
        0x00001dcc:    bf00        ..      NOP      
        0x00001dce:    2300        .#      MOVS     r3,#0
        0x00001dd0:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001dd2:    009b        ..      LSLS     r3,r3,#2
        0x00001dd4:    4c49        IL      LDR      r4,[pc,#292] ; [0x1efc] = 0x20000030
        0x00001dd6:    6824        $h      LDR      r4,[r4,#0]
        0x00001dd8:    58e3        .X      LDR      r3,[r4,r3]
        0x00001dda:    2b00        .+      CMP      r3,#0
        0x00001ddc:    d000        ..      BEQ      0x1de0 ; STL_TranspMarchC + 420
        0x00001dde:    2003        .       MOVS     r0,#3
        0x00001de0:    2300        .#      MOVS     r3,#0
        0x00001de2:    43db        .C      MVNS     r3,r3
        0x00001de4:    2400        .$      MOVS     r4,#0
        0x00001de6:    570c        .W      LDRSB    r4,[r1,r4]
        0x00001de8:    00a4        ..      LSLS     r4,r4,#2
        0x00001dea:    4d44        DM      LDR      r5,[pc,#272] ; [0x1efc] = 0x20000030
        0x00001dec:    682d        -h      LDR      r5,[r5,#0]
        0x00001dee:    512b        +Q      STR      r3,[r5,r4]
        0x00001df0:    1c49        I.      ADDS     r1,r1,#1
        0x00001df2:    4b47        GK      LDR      r3,[pc,#284] ; [0x1f10] = 0x30f8
        0x00001df4:    1d9b        ..      ADDS     r3,r3,#6
        0x00001df6:    4299        .B      CMP      r1,r3
        0x00001df8:    d3e9        ..      BCC      0x1dce ; STL_TranspMarchC + 402
        0x00001dfa:    1f99        ..      SUBS     r1,r3,#6
        0x00001dfc:    bf00        ..      NOP      
        0x00001dfe:    2300        .#      MOVS     r3,#0
        0x00001e00:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001e02:    009b        ..      LSLS     r3,r3,#2
        0x00001e04:    4c3d        =L      LDR      r4,[pc,#244] ; [0x1efc] = 0x20000030
        0x00001e06:    6824        $h      LDR      r4,[r4,#0]
        0x00001e08:    58e3        .X      LDR      r3,[r4,r3]
        0x00001e0a:    1c5b        [.      ADDS     r3,r3,#1
        0x00001e0c:    2b00        .+      CMP      r3,#0
        0x00001e0e:    d000        ..      BEQ      0x1e12 ; STL_TranspMarchC + 470
        0x00001e10:    2003        .       MOVS     r0,#3
        0x00001e12:    2400        .$      MOVS     r4,#0
        0x00001e14:    570b        .W      LDRSB    r3,[r1,r4]
        0x00001e16:    009b        ..      LSLS     r3,r3,#2
        0x00001e18:    4d38        8M      LDR      r5,[pc,#224] ; [0x1efc] = 0x20000030
        0x00001e1a:    682d        -h      LDR      r5,[r5,#0]
        0x00001e1c:    50ec        .P      STR      r4,[r5,r3]
        0x00001e1e:    1c49        I.      ADDS     r1,r1,#1
        0x00001e20:    4b3b        ;K      LDR      r3,[pc,#236] ; [0x1f10] = 0x30f8
        0x00001e22:    1d9b        ..      ADDS     r3,r3,#6
        0x00001e24:    4299        .B      CMP      r1,r3
        0x00001e26:    d3ea        ..      BCC      0x1dfe ; STL_TranspMarchC + 450
        0x00001e28:    1e59        Y.      SUBS     r1,r3,#1
        0x00001e2a:    bf00        ..      NOP      
        0x00001e2c:    2300        .#      MOVS     r3,#0
