Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00001e2e:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001e30:    009b        ..      LSLS     r3,r3,#2
        0x00001e32:    4c32        2L      LDR      r4,[pc,#200] ; [0x1efc] = 0x20000030
        0x00001e34:    6824        $h      LDR      r4,[r4,#0]
        0x00001e36:    58e3        .X      LDR      r3,[r4,r3]
        0x00001e38:    2b00        .+      CMP      r3,#0
        0x00001e3a:    d000        ..      BEQ      0x1e3e ; STL_TranspMarchC + 514
        0x00001e3c:    2003        .       MOVS     r0,#3
        0x00001e3e:    2400        .$      MOVS     r4,#0
        0x00001e40:    43e4        .C      MVNS     r4,r4
        0x00001e42:    2300        .#      MOVS     r3,#0
        0x00001e44:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001e46:    009b        ..      LSLS     r3,r3,#2
        0x00001e48:    4d2c        ,M      LDR      r5,[pc,#176] ; [0x1efc] = 0x20000030
        0x00001e4a:    682d        -h      LDR      r5,[r5,#0]
        0x00001e4c:    50ec        .P      STR      r4,[r5,r3]
        0x00001e4e:    1e49        I.      SUBS     r1,r1,#1
        0x00001e50:    4b2f        /K      LDR      r3,[pc,#188] ; [0x1f10] = 0x30f8
        0x00001e52:    4299        .B      CMP      r1,r3
        0x00001e54:    d2ea        ..      BCS      0x1e2c ; STL_TranspMarchC + 496
        0x00001e56:    1d59        Y.      ADDS     r1,r3,#5
        0x00001e58:    bf00        ..      NOP      
        0x00001e5a:    2300        .#      MOVS     r3,#0
        0x00001e5c:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001e5e:    009b        ..      LSLS     r3,r3,#2
        0x00001e60:    4c26        &L      LDR      r4,[pc,#152] ; [0x1efc] = 0x20000030
        0x00001e62:    6824        $h      LDR      r4,[r4,#0]
        0x00001e64:    58e3        .X      LDR      r3,[r4,r3]
        0x00001e66:    1c5b        [.      ADDS     r3,r3,#1
        0x00001e68:    2b00        .+      CMP      r3,#0
        0x00001e6a:    d000        ..      BEQ      0x1e6e ; STL_TranspMarchC + 562
        0x00001e6c:    2003        .       MOVS     r0,#3
        0x00001e6e:    2300        .#      MOVS     r3,#0
        0x00001e70:    56cc        .V      LDRSB    r4,[r1,r3]
        0x00001e72:    00a4        ..      LSLS     r4,r4,#2
        0x00001e74:    4d21        !M      LDR      r5,[pc,#132] ; [0x1efc] = 0x20000030
        0x00001e76:    682d        -h      LDR      r5,[r5,#0]
        0x00001e78:    512b        +Q      STR      r3,[r5,r4]
        0x00001e7a:    1e49        I.      SUBS     r1,r1,#1
        0x00001e7c:    4b24        $K      LDR      r3,[pc,#144] ; [0x1f10] = 0x30f8
        0x00001e7e:    4299        .B      CMP      r1,r3
        0x00001e80:    d2eb        ..      BCS      0x1e5a ; STL_TranspMarchC + 542
        0x00001e82:    4619        .F      MOV      r1,r3
        0x00001e84:    2200        ."      MOVS     r2,#0
        0x00001e86:    bf00        ..      NOP      
        0x00001e88:    2300        .#      MOVS     r3,#0
        0x00001e8a:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001e8c:    009b        ..      LSLS     r3,r3,#2
        0x00001e8e:    4c1b        .L      LDR      r4,[pc,#108] ; [0x1efc] = 0x20000030
        0x00001e90:    6824        $h      LDR      r4,[r4,#0]
        0x00001e92:    58e3        .X      LDR      r3,[r4,r3]
        0x00001e94:    2b00        .+      CMP      r3,#0
        0x00001e96:    d000        ..      BEQ      0x1e9a ; STL_TranspMarchC + 606
        0x00001e98:    2003        .       MOVS     r0,#3
        0x00001e9a:    4613        .F      MOV      r3,r2
        0x00001e9c:    1c52        R.      ADDS     r2,r2,#1
        0x00001e9e:    009b        ..      LSLS     r3,r3,#2
        0x00001ea0:    4c19        .L      LDR      r4,[pc,#100] ; [0x1f08] = 0x20000004
        0x00001ea2:    58e4        .X      LDR      r4,[r4,r3]
        0x00001ea4:    2300        .#      MOVS     r3,#0
        0x00001ea6:    56cb        .V      LDRSB    r3,[r1,r3]
        0x00001ea8:    009b        ..      LSLS     r3,r3,#2
        0x00001eaa:    4d14        .M      LDR      r5,[pc,#80] ; [0x1efc] = 0x20000030
        0x00001eac:    682d        -h      LDR      r5,[r5,#0]
        0x00001eae:    50ec        .P      STR      r4,[r5,r3]
        0x00001eb0:    1c49        I.      ADDS     r1,r1,#1
        0x00001eb2:    4b17        .K      LDR      r3,[pc,#92] ; [0x1f10] = 0x30f8
        0x00001eb4:    1d9b        ..      ADDS     r3,r3,#6
        0x00001eb6:    4299        .B      CMP      r1,r3
        0x00001eb8:    d3e6        ..      BCC      0x1e88 ; STL_TranspMarchC + 588
        0x00001eba:    4b10        .K      LDR      r3,[pc,#64] ; [0x1efc] = 0x20000030
        0x00001ebc:    681b        .h      LDR      r3,[r3,#0]
        0x00001ebe:    4c10        .L      LDR      r4,[pc,#64] ; [0x1f00] = 0x20000034
        0x00001ec0:    6824        $h      LDR      r4,[r4,#0]
        0x00001ec2:    4063        c@      EORS     r3,r3,r4
        0x00001ec4:    1c5b        [.      ADDS     r3,r3,#1
        0x00001ec6:    2b00        .+      CMP      r3,#0
        0x00001ec8:    d10d        ..      BNE      0x1ee6 ; STL_TranspMarchC + 682
        0x00001eca:    4b0c        .K      LDR      r3,[pc,#48] ; [0x1efc] = 0x20000030
        0x00001ecc:    681b        .h      LDR      r3,[r3,#0]
        0x00001ece:    3310        .3      ADDS     r3,r3,#0x10
        0x00001ed0:    4c0a        .L      LDR      r4,[pc,#40] ; [0x1efc] = 0x20000030
        0x00001ed2:    6023        #`      STR      r3,[r4,#0]
        0x00001ed4:    4623        #F      MOV      r3,r4
        0x00001ed6:    681b        .h      LDR      r3,[r3,#0]
        0x00001ed8:    43db        .C      MVNS     r3,r3
        0x00001eda:    4c09        .L      LDR      r4,[pc,#36] ; [0x1f00] = 0x20000034
        0x00001edc:    6023        #`      STR      r3,[r4,#0]
        0x00001ede:    2800        .(      CMP      r0,#0
        0x00001ee0:    d004        ..      BEQ      0x1eec ; STL_TranspMarchC + 688
        0x00001ee2:    2003        .       MOVS     r0,#3
        0x00001ee4:    e002        ..      B        0x1eec ; STL_TranspMarchC + 688
        0x00001ee6:    2001        .       MOVS     r0,#1
        0x00001ee8:    e000        ..      B        0x1eec ; STL_TranspMarchC + 688
        0x00001eea:    2001        .       MOVS     r0,#1
        0x00001eec:    4b09        .K      LDR      r3,[pc,#36] ; [0x1f14] = 0x20000084
        0x00001eee:    681b        .h      LDR      r3,[r3,#0]
        0x00001ef0:    3b0b        .;      SUBS     r3,r3,#0xb
        0x00001ef2:    4c08        .L      LDR      r4,[pc,#32] ; [0x1f14] = 0x20000084
        0x00001ef4:    6023        #`      STR      r3,[r4,#0]
        0x00001ef6:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x00001ef8:    20000044    D..     DCD    536870980
        0x00001efc:    20000030    0..     DCD    536870960
        0x00001f00:    20000034    4..     DCD    536870964
        0x00001f04:    20000100    ...     DCD    536871168
        0x00001f08:    20000004    ...     DCD    536870916
        0x00001f0c:    000030fe    .0..    DCD    12542
        0x00001f10:    000030f8    .0..    DCD    12536
        0x00001f14:    20000084    ...     DCD    536871044
    $t
    i.STL_TranspMarchCInit
    STL_TranspMarchCInit
        0x00001f18:    4803        .H      LDR      r0,[pc,#12] ; [0x1f28] = 0x20000040
        0x00001f1a:    4904        .I      LDR      r1,[pc,#16] ; [0x1f2c] = 0x20000030
        0x00001f1c:    6008        .`      STR      r0,[r1,#0]
        0x00001f1e:    43c0        .C      MVNS     r0,r0
        0x00001f20:    4903        .I      LDR      r1,[pc,#12] ; [0x1f30] = 0x20000034
        0x00001f22:    6008        .`      STR      r0,[r1,#0]
        0x00001f24:    4770        pG      BX       lr
    $d
        0x00001f26:    0000        ..      DCW    0
        0x00001f28:    20000040    @..     DCD    536870976
        0x00001f2c:    20000030    0..     DCD    536870960
        0x00001f30:    20000034    4..     DCD    536870964
    $t
    i.STL_WDGSelfTest
    STL_WDGSelfTest
        0x00001f34:    b510        ..      PUSH     {r4,lr}
        0x00001f36:    2001        .       MOVS     r0,#1
        0x00001f38:    0780        ..      LSLS     r0,r0,#30
        0x00001f3a:    6a40        @j      LDR      r0,[r0,#0x24]
        0x00001f3c:    07c0        ..      LSLS     r0,r0,#31
        0x00001f3e:    0fc0        ..      LSRS     r0,r0,#31
        0x00001f40:    2800        .(      CMP      r0,#0
        0x00001f42:    d010        ..      BEQ      0x1f66 ; STL_WDGSelfTest + 50
        0x00001f44:    2001        .       MOVS     r0,#1
        0x00001f46:    0780        ..      LSLS     r0,r0,#30
        0x00001f48:    6a40        @j      LDR      r0,[r0,#0x24]
        0x00001f4a:    2102        .!      MOVS     r1,#2
        0x00001f4c:    4008        .@      ANDS     r0,r0,r1
        0x00001f4e:    2800        .(      CMP      r0,#0
        0x00001f50:    d109        ..      BNE      0x1f66 ; STL_WDGSelfTest + 50
        0x00001f52:    2264        d"      MOVS     r2,#0x64
        0x00001f54:    2100        .!      MOVS     r1,#0
        0x00001f56:    4806        .H      LDR      r0,[pc,#24] ; [0x1f70] = 0x400a0800
        0x00001f58:    f000fcda    ....    BL       WDT_Init ; 0x2910
        0x00001f5c:    4804        .H      LDR      r0,[pc,#16] ; [0x1f70] = 0x400a0800
        0x00001f5e:    f000fd0d    ....    BL       WDT_Start ; 0x297c
        0x00001f62:    bf00        ..      NOP      
        0x00001f64:    e7fe        ..      B        0x1f64 ; STL_WDGSelfTest + 48
        0x00001f66:    2001        .       MOVS     r0,#1
        0x00001f68:    0780        ..      LSLS     r0,r0,#30
        0x00001f6a:    6a40        @j      LDR      r0,[r0,#0x24]
        0x00001f6c:    bd10        ..      POP      {r4,pc}
    $d
        0x00001f6e:    0000        ..      DCW    0
        0x00001f70:    400a0800    ...@    DCD    1074399232
    $t
    i.STL_crc32Run
    STL_crc32Run
        0x00001f74:    b570        p.      PUSH     {r4-r6,lr}
        0x00001f76:    2402        .$      MOVS     r4,#2
        0x00001f78:    4829        )H      LDR      r0,[pc,#164] ; [0x2020] = 0x20000040
        0x00001f7a:    6800        .h      LDR      r0,[r0,#0]
        0x00001f7c:    3047        G0      ADDS     r0,r0,#0x47
        0x00001f7e:    4928        (I      LDR      r1,[pc,#160] ; [0x2020] = 0x20000040
        0x00001f80:    6008        .`      STR      r0,[r1,#0]
        0x00001f82:    4828        (H      LDR      r0,[pc,#160] ; [0x2024] = 0x20000064
        0x00001f84:    6800        .h      LDR      r0,[r0,#0]
        0x00001f86:    4928        (I      LDR      r1,[pc,#160] ; [0x2028] = 0x200000a4
        0x00001f88:    6809        .h      LDR      r1,[r1,#0]
        0x00001f8a:    4048        H@      EORS     r0,r0,r1
        0x00001f8c:    1c40        @.      ADDS     r0,r0,#1
        0x00001f8e:    2800        .(      CMP      r0,#0
        0x00001f90:    d13d        =.      BNE      0x200e ; STL_crc32Run + 154
        0x00001f92:    4824        $H      LDR      r0,[pc,#144] ; [0x2024] = 0x20000064
        0x00001f94:    6801        .h      LDR      r1,[r0,#0]
        0x00001f96:    4825        %H      LDR      r0,[pc,#148] ; [0x202c] = 0x317f
        0x00001f98:    4281        .B      CMP      r1,r0
        0x00001f9a:    d222        ".      BCS      0x1fe2 ; STL_crc32Run + 110
        0x00001f9c:    1c40        @.      ADDS     r0,r0,#1
        0x00001f9e:    0981        ..      LSRS     r1,r0,#6
        0x00001fa0:    f7fefae4    ....    BL       __aeabi_uidiv ; 0x56c
        0x00001fa4:    4605        .F      MOV      r5,r0
        0x00001fa6:    4822        "H      LDR      r0,[pc,#136] ; [0x2030] = 0x20000070
        0x00001fa8:    4629        )F      MOV      r1,r5
        0x00001faa:    6802        .h      LDR      r2,[r0,#0]
        0x00001fac:    481d        .H      LDR      r0,[pc,#116] ; [0x2024] = 0x20000064
        0x00001fae:    6800        .h      LDR      r0,[r0,#0]
        0x00001fb0:    f7fff822    ..".    BL       CRC_CalcBlockCrc ; 0xff8
        0x00001fb4:    491e        .I      LDR      r1,[pc,#120] ; [0x2030] = 0x20000070
        0x00001fb6:    6008        .`      STR      r0,[r1,#0]
        0x00001fb8:    4608        .F      MOV      r0,r1
        0x00001fba:    6800        .h      LDR      r0,[r0,#0]
        0x00001fbc:    43c0        .C      MVNS     r0,r0
        0x00001fbe:    491d        .I      LDR      r1,[pc,#116] ; [0x2034] = 0x200000b0
        0x00001fc0:    6008        .`      STR      r0,[r1,#0]
        0x00001fc2:    481d        .H      LDR      r0,[pc,#116] ; [0x2038] = 0x3180
        0x00001fc4:    0981        ..      LSRS     r1,r0,#6
        0x00001fc6:    f7fefad1    ....    BL       __aeabi_uidiv ; 0x56c
        0x00001fca:    4916        .I      LDR      r1,[pc,#88] ; [0x2024] = 0x20000064
        0x00001fcc:    6809        .h      LDR      r1,[r1,#0]
        0x00001fce:    1840        @.      ADDS     r0,r0,r1
        0x00001fd0:    4914        .I      LDR      r1,[pc,#80] ; [0x2024] = 0x20000064
        0x00001fd2:    6008        .`      STR      r0,[r1,#0]
        0x00001fd4:    4608        .F      MOV      r0,r1
        0x00001fd6:    6800        .h      LDR      r0,[r0,#0]
        0x00001fd8:    43c0        .C      MVNS     r0,r0
        0x00001fda:    4913        .I      LDR      r1,[pc,#76] ; [0x2028] = 0x200000a4
        0x00001fdc:    6008        .`      STR      r0,[r1,#0]
        0x00001fde:    2400        .$      MOVS     r4,#0
        0x00001fe0:    e016        ..      B        0x2010 ; STL_crc32Run + 156
        0x00001fe2:    4816        .H      LDR      r0,[pc,#88] ; [0x203c] = 0x20000068
        0x00001fe4:    6800        .h      LDR      r0,[r0,#0]
        0x00001fe6:    4916        .I      LDR      r1,[pc,#88] ; [0x2040] = 0x200000a8
        0x00001fe8:    6809        .h      LDR      r1,[r1,#0]
        0x00001fea:    4048        H@      EORS     r0,r0,r1
        0x00001fec:    1c40        @.      ADDS     r0,r0,#1
        0x00001fee:    2800        .(      CMP      r0,#0
        0x00001ff0:    d10b        ..      BNE      0x200a ; STL_crc32Run + 150
        0x00001ff2:    480f        .H      LDR      r0,[pc,#60] ; [0x2030] = 0x20000070
        0x00001ff4:    6800        .h      LDR      r0,[r0,#0]
        0x00001ff6:    4911        .I      LDR      r1,[pc,#68] ; [0x203c] = 0x20000068
        0x00001ff8:    6809        .h      LDR      r1,[r1,#0]
        0x00001ffa:    4288        .B      CMP      r0,r1
        0x00001ffc:    d101        ..      BNE      0x2002 ; STL_crc32Run + 142
        0x00001ffe:    2404        .$      MOVS     r4,#4
        0x00002000:    e000        ..      B        0x2004 ; STL_crc32Run + 144
        0x00002002:    2403        .$      MOVS     r4,#3
        0x00002004:    f7fffb50    ..P.    BL       STL_FlashCrc32Init ; 0x16a8
        0x00002008:    e002        ..      B        0x2010 ; STL_crc32Run + 156
        0x0000200a:    2401        .$      MOVS     r4,#1
        0x0000200c:    e000        ..      B        0x2010 ; STL_crc32Run + 156
        0x0000200e:    2401        .$      MOVS     r4,#1
        0x00002010:    480c        .H      LDR      r0,[pc,#48] ; [0x2044] = 0x20000080
        0x00002012:    6800        .h      LDR      r0,[r0,#0]
        0x00002014:    3847        G8      SUBS     r0,r0,#0x47
        0x00002016:    490b        .I      LDR      r1,[pc,#44] ; [0x2044] = 0x20000080
        0x00002018:    6008        .`      STR      r0,[r1,#0]
        0x0000201a:    4620         F      MOV      r0,r4
        0x0000201c:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0000201e:    0000        ..      DCW    0
        0x00002020:    20000040    @..     DCD    536870976
        0x00002024:    20000064    d..     DCD    536871012
        0x00002028:    200000a4    ...     DCD    536871076
        0x0000202c:    0000317f    .1..    DCD    12671
        0x00002030:    20000070    p..     DCD    536871024
        0x00002034:    200000b0    ...     DCD    536871088
        0x00002038:    00003180    .1..    DCD    12672
        0x0000203c:    20000068    h..     DCD    536871016
        0x00002040:    200000a8    ...     DCD    536871080
        0x00002044:    20000080    ...     DCD    536871040
    $t
    i.SerialInit
    SerialInit
        0x00002048:    b51f        ..      PUSH     {r0-r4,lr}
        0x0000204a:    2300        .#      MOVS     r3,#0
        0x0000204c:    2202        ."      MOVS     r2,#2
        0x0000204e:    210d        .!      MOVS     r1,#0xd
        0x00002050:    4812        .H      LDR      r0,[pc,#72] ; [0x209c] = 0x400a0020
        0x00002052:    f7fff8fb    ....    BL       PORT_Init ; 0x124c
        0x00002056:    2301        .#      MOVS     r3,#1
        0x00002058:    2202        ."      MOVS     r2,#2
        0x0000205a:    210e        .!      MOVS     r1,#0xe
        0x0000205c:    480f        .H      LDR      r0,[pc,#60] ; [0x209c] = 0x400a0020
        0x0000205e:    f7fff8f5    ....    BL       PORT_Init ; 0x124c
        0x00002062:    20e1        .       MOVS     r0,#0xe1
        0x00002064:    0200        ..      LSLS     r0,r0,#8
        0x00002066:    9000        ..      STR      r0,[sp,#0]
        0x00002068:    2100        .!      MOVS     r1,#0
        0x0000206a:    4668        hF      MOV      r0,sp
        0x0000206c:    7101        .q      STRB     r1,[r0,#4]
        0x0000206e:    7141        Aq      STRB     r1,[r0,#5]
        0x00002070:    7181        .q      STRB     r1,[r0,#6]
        0x00002072:    2103        .!      MOVS     r1,#3
        0x00002074:    71c1        .q      STRB     r1,[r0,#7]
        0x00002076:    2100        .!      MOVS     r1,#0
        0x00002078:    7201        .r      STRB     r1,[r0,#8]
        0x0000207a:    2103        .!      MOVS     r1,#3
        0x0000207c:    7241        Ar      STRB     r1,[r0,#9]
        0x0000207e:    2100        .!      MOVS     r1,#0
        0x00002080:    7281        .r      STRB     r1,[r0,#0xa]
        0x00002082:    210a        .!      MOVS     r1,#0xa
        0x00002084:    72c1        .r      STRB     r1,[r0,#0xb]
        0x00002086:    2100        .!      MOVS     r1,#0
        0x00002088:    7301        .s      STRB     r1,[r0,#0xc]
        0x0000208a:    4669        iF      MOV      r1,sp
        0x0000208c:    4804        .H      LDR      r0,[pc,#16] ; [0x20a0] = 0x40042000
        0x0000208e:    f000fb01    ....    BL       UART_Init ; 0x2694
        0x00002092:    4803        .H      LDR      r0,[pc,#12] ; [0x20a0] = 0x40042000
        0x00002094:    f000fc2c    ..,.    BL       UART_Open ; 0x28f0
        0x00002098:    bd1f        ..      POP      {r0-r4,pc}
    $d
        0x0000209a:    0000        ..      DCW    0
        0x0000209c:    400a0020     ..@    DCD    1074397216
        0x000020a0:    40042000    . .@    DCD    1074012160
    $t
    i.SysTick_CounterCmd
    SysTick_CounterCmd
        0x000020a4:    2800        .(      CMP      r0,#0
        0x000020a6:    d103        ..      BNE      0x20b0 ; SysTick_CounterCmd + 12
        0x000020a8:    2100        .!      MOVS     r1,#0
        0x000020aa:    4a09        .J      LDR      r2,[pc,#36] ; [0x20d0] = 0xe000e000
        0x000020ac:    6191        .a      STR      r1,[r2,#0x18]
        0x000020ae:    e00e        ..      B        0x20ce ; SysTick_CounterCmd + 42
        0x000020b0:    2801        .(      CMP      r0,#1
        0x000020b2:    d106        ..      BNE      0x20c2 ; SysTick_CounterCmd + 30
        0x000020b4:    4906        .I      LDR      r1,[pc,#24] ; [0x20d0] = 0xe000e000
        0x000020b6:    6909        .i      LDR      r1,[r1,#0x10]
        0x000020b8:    2201        ."      MOVS     r2,#1
        0x000020ba:    4311        .C      ORRS     r1,r1,r2
        0x000020bc:    4a04        .J      LDR      r2,[pc,#16] ; [0x20d0] = 0xe000e000
        0x000020be:    6111        .a      STR      r1,[r2,#0x10]
        0x000020c0:    e005        ..      B        0x20ce ; SysTick_CounterCmd + 42
        0x000020c2:    4903        .I      LDR      r1,[pc,#12] ; [0x20d0] = 0xe000e000
        0x000020c4:    6909        .i      LDR      r1,[r1,#0x10]
        0x000020c6:    0849        I.      LSRS     r1,r1,#1
        0x000020c8:    0049        I.      LSLS     r1,r1,#1
        0x000020ca:    4a01        .J      LDR      r2,[pc,#4] ; [0x20d0] = 0xe000e000
        0x000020cc:    6111        .a      STR      r1,[r2,#0x10]
        0x000020ce:    4770        pG      BX       lr
    $d
        0x000020d0:    e000e000    ....    DCD    3758153728
    $t
    i.SysTick_Handler
    SysTick_Handler
        0x000020d4:    b510        ..      PUSH     {r4,lr}
        0x000020d6:    4843        CH      LDR      r0,[pc,#268] ; [0x21e4] = 0x20000058
        0x000020d8:    6800        .h      LDR      r0,[r0,#0]
        0x000020da:    4943        CI      LDR      r1,[pc,#268] ; [0x21e8] = 0x20000098
        0x000020dc:    6809        .h      LDR      r1,[r1,#0]
        0x000020de:    4048        H@      EORS     r0,r0,r1
        0x000020e0:    1c40        @.      ADDS     r0,r0,#1
        0x000020e2:    2800        .(      CMP      r0,#0
        0x000020e4:    d17a        z.      BNE      0x21dc ; SysTick_Handler + 264
        0x000020e6:    483f        ?H      LDR      r0,[pc,#252] ; [0x21e4] = 0x20000058
        0x000020e8:    6800        .h      LDR      r0,[r0,#0]
        0x000020ea:    1c40        @.      ADDS     r0,r0,#1
        0x000020ec:    493d        =I      LDR      r1,[pc,#244] ; [0x21e4] = 0x20000058
        0x000020ee:    6008        .`      STR      r0,[r1,#0]
        0x000020f0:    4608        .F      MOV      r0,r1
        0x000020f2:    6800        .h      LDR      r0,[r0,#0]
        0x000020f4:    43c0        .C      MVNS     r0,r0
        0x000020f6:    493c        <I      LDR      r1,[pc,#240] ; [0x21e8] = 0x20000098
        0x000020f8:    6008        .`      STR      r0,[r1,#0]
        0x000020fa:    483a        :H      LDR      r0,[pc,#232] ; [0x21e4] = 0x20000058
        0x000020fc:    6800        .h      LDR      r0,[r0,#0]
        0x000020fe:    280a        .(      CMP      r0,#0xa
        0x00002100:    d36e        n.      BCC      0x21e0 ; SysTick_Handler + 268
        0x00002102:    2000        .       MOVS     r0,#0
        0x00002104:    4937        7I      LDR      r1,[pc,#220] ; [0x21e4] = 0x20000058
        0x00002106:    6008        .`      STR      r0,[r1,#0]
        0x00002108:    1e40        @.      SUBS     r0,r0,#1
        0x0000210a:    4937        7I      LDR      r1,[pc,#220] ; [0x21e8] = 0x20000098
        0x0000210c:    6008        .`      STR      r0,[r1,#0]
        0x0000210e:    4837        7H      LDR      r0,[pc,#220] ; [0x21ec] = 0xaaaaaaaa
        0x00002110:    4937        7I      LDR      r1,[pc,#220] ; [0x21f0] = 0x2000005c
        0x00002112:    6008        .`      STR      r0,[r1,#0]
        0x00002114:    0840        @.      LSRS     r0,r0,#1
        0x00002116:    4937        7I      LDR      r1,[pc,#220] ; [0x21f4] = 0x2000009c
        0x00002118:    6008        .`      STR      r0,[r1,#0]
        0x0000211a:    4837        7H      LDR      r0,[pc,#220] ; [0x21f8] = 0x20000054
        0x0000211c:    6800        .h      LDR      r0,[r0,#0]
        0x0000211e:    4937        7I      LDR      r1,[pc,#220] ; [0x21fc] = 0x20000094
        0x00002120:    6809        .h      LDR      r1,[r1,#0]
        0x00002122:    4048        H@      EORS     r0,r0,r1
        0x00002124:    1c40        @.      ADDS     r0,r0,#1
        0x00002126:    2800        .(      CMP      r0,#0
        0x00002128:    d11b        ..      BNE      0x2162 ; SysTick_Handler + 142
        0x0000212a:    4835        5H      LDR      r0,[pc,#212] ; [0x2200] = 0x20000044
