Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x0000212c:    6800        .h      LDR      r0,[r0,#0]
        0x0000212e:    1c80        ..      ADDS     r0,r0,#2
        0x00002130:    4933        3I      LDR      r1,[pc,#204] ; [0x2200] = 0x20000044
        0x00002132:    6008        .`      STR      r0,[r1,#0]
        0x00002134:    4830        0H      LDR      r0,[pc,#192] ; [0x21f8] = 0x20000054
        0x00002136:    6800        .h      LDR      r0,[r0,#0]
        0x00002138:    4932        2I      LDR      r1,[pc,#200] ; [0x2204] = 0x20000050
        0x0000213a:    6008        .`      STR      r0,[r1,#0]
        0x0000213c:    f7fff8c0    ....    BL       RTC_GetSubSecond ; 0x12c0
        0x00002140:    492d        -I      LDR      r1,[pc,#180] ; [0x21f8] = 0x20000054
        0x00002142:    6008        .`      STR      r0,[r1,#0]
        0x00002144:    482f        /H      LDR      r0,[pc,#188] ; [0x2204] = 0x20000050
        0x00002146:    6800        .h      LDR      r0,[r0,#0]
        0x00002148:    43c0        .C      MVNS     r0,r0
        0x0000214a:    492f        /I      LDR      r1,[pc,#188] ; [0x2208] = 0x20000090
        0x0000214c:    6008        .`      STR      r0,[r1,#0]
        0x0000214e:    482a        *H      LDR      r0,[pc,#168] ; [0x21f8] = 0x20000054
        0x00002150:    6800        .h      LDR      r0,[r0,#0]
        0x00002152:    43c0        .C      MVNS     r0,r0
        0x00002154:    4929        )I      LDR      r1,[pc,#164] ; [0x21fc] = 0x20000094
        0x00002156:    6008        .`      STR      r0,[r1,#0]
        0x00002158:    482c        ,H      LDR      r0,[pc,#176] ; [0x220c] = 0x20000084
        0x0000215a:    6800        .h      LDR      r0,[r0,#0]
        0x0000215c:    1e80        ..      SUBS     r0,r0,#2
        0x0000215e:    492b        +I      LDR      r1,[pc,#172] ; [0x220c] = 0x20000084
        0x00002160:    6008        .`      STR      r0,[r1,#0]
        0x00002162:    4827        'H      LDR      r0,[pc,#156] ; [0x2200] = 0x20000044
        0x00002164:    6800        .h      LDR      r0,[r0,#0]
        0x00002166:    1dc0        ..      ADDS     r0,r0,#7
        0x00002168:    4925        %I      LDR      r1,[pc,#148] ; [0x2200] = 0x20000044
        0x0000216a:    6008        .`      STR      r0,[r1,#0]
        0x0000216c:    f7fffd66    ..f.    BL       STL_TranspMarchC ; 0x1c3c
        0x00002170:    4604        .F      MOV      r4,r0
        0x00002172:    4826        &H      LDR      r0,[pc,#152] ; [0x220c] = 0x20000084
        0x00002174:    6800        .h      LDR      r0,[r0,#0]
        0x00002176:    1fc0        ..      SUBS     r0,r0,#7
        0x00002178:    4924        $I      LDR      r1,[pc,#144] ; [0x220c] = 0x20000084
        0x0000217a:    6008        .`      STR      r0,[r1,#0]
        0x0000217c:    2c00        .,      CMP      r4,#0
        0x0000217e:    d006        ..      BEQ      0x218e ; SysTick_Handler + 186
        0x00002180:    2c01        .,      CMP      r4,#1
        0x00002182:    d008        ..      BEQ      0x2196 ; SysTick_Handler + 194
        0x00002184:    2c03        .,      CMP      r4,#3
        0x00002186:    d005        ..      BEQ      0x2194 ; SysTick_Handler + 192
        0x00002188:    2c04        .,      CMP      r4,#4
        0x0000218a:    d102        ..      BNE      0x2192 ; SysTick_Handler + 190
        0x0000218c:    e000        ..      B        0x2190 ; SysTick_Handler + 188
        0x0000218e:    e005        ..      B        0x219c ; SysTick_Handler + 200
        0x00002190:    e004        ..      B        0x219c ; SysTick_Handler + 200
        0x00002192:    bf00        ..      NOP      
        0x00002194:    bf00        ..      NOP      
        0x00002196:    f7feff53    ..S.    BL       FailSafePOR ; 0x1040
        0x0000219a:    bf00        ..      NOP      
        0x0000219c:    bf00        ..      NOP      
        0x0000219e:    4818        .H      LDR      r0,[pc,#96] ; [0x2200] = 0x20000044
        0x000021a0:    6800        .h      LDR      r0,[r0,#0]
        0x000021a2:    491a        .I      LDR      r1,[pc,#104] ; [0x220c] = 0x20000084
        0x000021a4:    6809        .h      LDR      r1,[r1,#0]
        0x000021a6:    4048        H@      EORS     r0,r0,r1
        0x000021a8:    1c40        @.      ADDS     r0,r0,#1
        0x000021aa:    2800        .(      CMP      r0,#0
        0x000021ac:    d113        ..      BNE      0x21d6 ; SysTick_Handler + 258
        0x000021ae:    2c04        .,      CMP      r4,#4
        0x000021b0:    d113        ..      BNE      0x21da ; SysTick_Handler + 262
        0x000021b2:    4813        .H      LDR      r0,[pc,#76] ; [0x2200] = 0x20000044
        0x000021b4:    6800        .h      LDR      r0,[r0,#0]
        0x000021b6:    21ff        .!      MOVS     r1,#0xff
        0x000021b8:    3105        .1      ADDS     r1,#5
        0x000021ba:    4288        .B      CMP      r0,r1
        0x000021bc:    d002        ..      BEQ      0x21c4 ; SysTick_Handler + 240
        0x000021be:    f7feff3f    ..?.    BL       FailSafePOR ; 0x1040
        0x000021c2:    e00a        ..      B        0x21da ; SysTick_Handler + 262
        0x000021c4:    2000        .       MOVS     r0,#0
        0x000021c6:    490e        .I      LDR      r1,[pc,#56] ; [0x2200] = 0x20000044
        0x000021c8:    6008        .`      STR      r0,[r1,#0]
        0x000021ca:    1e40        @.      SUBS     r0,r0,#1
        0x000021cc:    490f        .I      LDR      r1,[pc,#60] ; [0x220c] = 0x20000084
        0x000021ce:    6008        .`      STR      r0,[r1,#0]
        0x000021d0:    e003        ..      B        0x21da ; SysTick_Handler + 262
        0x000021d2:    e003        ..      B        0x21dc ; SysTick_Handler + 264
        0x000021d4:    e004        ..      B        0x21e0 ; SysTick_Handler + 268
        0x000021d6:    f7feff33    ..3.    BL       FailSafePOR ; 0x1040
        0x000021da:    e001        ..      B        0x21e0 ; SysTick_Handler + 268
        0x000021dc:    f7feff30    ..0.    BL       FailSafePOR ; 0x1040
        0x000021e0:    bd10        ..      POP      {r4,pc}
    $d
        0x000021e2:    0000        ..      DCW    0
        0x000021e4:    20000058    X..     DCD    536871000
        0x000021e8:    20000098    ...     DCD    536871064
        0x000021ec:    aaaaaaaa    ....    DCD    2863311530
        0x000021f0:    2000005c    \..     DCD    536871004
        0x000021f4:    2000009c    ...     DCD    536871068
        0x000021f8:    20000054    T..     DCD    536870996
        0x000021fc:    20000094    ...     DCD    536871060
        0x00002200:    20000044    D..     DCD    536870980
        0x00002204:    20000050    P..     DCD    536870992
        0x00002208:    20000090    ...     DCD    536871056
        0x0000220c:    20000084    ...     DCD    536871044
    $t
    i.SysTick_ITConfig
    SysTick_ITConfig
        0x00002210:    2800        .(      CMP      r0,#0
        0x00002212:    d006        ..      BEQ      0x2222 ; SysTick_ITConfig + 18
        0x00002214:    4906        .I      LDR      r1,[pc,#24] ; [0x2230] = 0xe000e000
        0x00002216:    6909        .i      LDR      r1,[r1,#0x10]
        0x00002218:    2202        ."      MOVS     r2,#2
        0x0000221a:    4311        .C      ORRS     r1,r1,r2
        0x0000221c:    4a04        .J      LDR      r2,[pc,#16] ; [0x2230] = 0xe000e000
        0x0000221e:    6111        .a      STR      r1,[r2,#0x10]
        0x00002220:    e005        ..      B        0x222e ; SysTick_ITConfig + 30
        0x00002222:    4903        .I      LDR      r1,[pc,#12] ; [0x2230] = 0xe000e000
        0x00002224:    6909        .i      LDR      r1,[r1,#0x10]
        0x00002226:    2202        ."      MOVS     r2,#2
        0x00002228:    4391        .C      BICS     r1,r1,r2
        0x0000222a:    4a01        .J      LDR      r2,[pc,#4] ; [0x2230] = 0xe000e000
        0x0000222c:    6111        .a      STR      r1,[r2,#0x10]
        0x0000222e:    4770        pG      BX       lr
    $d
        0x00002230:    e000e000    ....    DCD    3758153728
    $t
    i.SysTick_SetReload
    SysTick_SetReload
        0x00002234:    4901        .I      LDR      r1,[pc,#4] ; [0x223c] = 0xe000e000
        0x00002236:    6148        Ha      STR      r0,[r1,#0x14]
        0x00002238:    4770        pG      BX       lr
    $d
        0x0000223a:    0000        ..      DCW    0
        0x0000223c:    e000e000    ....    DCD    3758153728
    $t
    i.SystemCoreClockUpdate
    SystemCoreClockUpdate
        0x00002240:    b510        ..      PUSH     {r4,lr}
        0x00002242:    2001        .       MOVS     r0,#1
        0x00002244:    0780        ..      LSLS     r0,r0,#30
        0x00002246:    6800        .h      LDR      r0,[r0,#0]
        0x00002248:    07c0        ..      LSLS     r0,r0,#31
        0x0000224a:    0fc0        ..      LSRS     r0,r0,#31
        0x0000224c:    2800        .(      CMP      r0,#0
        0x0000224e:    d00d        ..      BEQ      0x226c ; SystemCoreClockUpdate + 44
        0x00002250:    4839        9H      LDR      r0,[pc,#228] ; [0x2338] = 0x400aa000
        0x00002252:    6800        .h      LDR      r0,[r0,#0]
        0x00002254:    2102        .!      MOVS     r1,#2
        0x00002256:    4008        .@      ANDS     r0,r0,r1
        0x00002258:    2800        .(      CMP      r0,#0
        0x0000225a:    d003        ..      BEQ      0x2264 ; SystemCoreClockUpdate + 36
        0x0000225c:    4837        7H      LDR      r0,[pc,#220] ; [0x233c] = 0x2dc6c00
        0x0000225e:    4938        8I      LDR      r1,[pc,#224] ; [0x2340] = 0x200000c0
        0x00002260:    6008        .`      STR      r0,[r1,#0]
        0x00002262:    e054        T.      B        0x230e ; SystemCoreClockUpdate + 206
        0x00002264:    4837        7H      LDR      r0,[pc,#220] ; [0x2344] = 0x16e3600
        0x00002266:    4936        6I      LDR      r1,[pc,#216] ; [0x2340] = 0x200000c0
        0x00002268:    6008        .`      STR      r0,[r1,#0]
        0x0000226a:    e050        P.      B        0x230e ; SystemCoreClockUpdate + 206
        0x0000226c:    2001        .       MOVS     r0,#1
        0x0000226e:    0780        ..      LSLS     r0,r0,#30
        0x00002270:    6800        .h      LDR      r0,[r0,#0]
        0x00002272:    211c        .!      MOVS     r1,#0x1c
        0x00002274:    4008        .@      ANDS     r0,r0,r1
        0x00002276:    0880        ..      LSRS     r0,r0,#2
        0x00002278:    0003        ..      MOVS     r3,r0
        0x0000227a:    f000fb84    ....    BL       __ARM_common_switch8 ; 0x2986
    $d
        0x0000227e:    0405        ..      DCW    1029
        0x00002280:    2c282309    .#(,    DCD    740827913
        0x00002284:    003b        ;.      DCW    59
    $t
        0x00002286:    207d        }       MOVS     r0,#0x7d
        0x00002288:    0200        ..      LSLS     r0,r0,#8
        0x0000228a:    492d        -I      LDR      r1,[pc,#180] ; [0x2340] = 0x200000c0
        0x0000228c:    6008        .`      STR      r0,[r1,#0]
        0x0000228e:    e031        1.      B        0x22f4 ; SystemCoreClockUpdate + 180
        0x00002290:    4829        )H      LDR      r0,[pc,#164] ; [0x2338] = 0x400aa000
        0x00002292:    3040        @0      ADDS     r0,r0,#0x40
        0x00002294:    6800        .h      LDR      r0,[r0,#0]
        0x00002296:    2102        .!      MOVS     r1,#2
        0x00002298:    4008        .@      ANDS     r0,r0,r1
        0x0000229a:    2800        .(      CMP      r0,#0
        0x0000229c:    d003        ..      BEQ      0x22a6 ; SystemCoreClockUpdate + 102
        0x0000229e:    4829        )H      LDR      r0,[pc,#164] ; [0x2344] = 0x16e3600
        0x000022a0:    4927        'I      LDR      r1,[pc,#156] ; [0x2340] = 0x200000c0
        0x000022a2:    6008        .`      STR      r0,[r1,#0]
        0x000022a4:    e002        ..      B        0x22ac ; SystemCoreClockUpdate + 108
        0x000022a6:    4827        'H      LDR      r0,[pc,#156] ; [0x2344] = 0x16e3600
        0x000022a8:    4925        %I      LDR      r1,[pc,#148] ; [0x2340] = 0x200000c0
        0x000022aa:    6008        .`      STR      r0,[r1,#0]
        0x000022ac:    2106        .!      MOVS     r1,#6
        0x000022ae:    4824        $H      LDR      r0,[pc,#144] ; [0x2340] = 0x200000c0
        0x000022b0:    6800        .h      LDR      r0,[r0,#0]
        0x000022b2:    f7fef95b    ..[.    BL       __aeabi_uidiv ; 0x56c
        0x000022b6:    211e        .!      MOVS     r1,#0x1e
        0x000022b8:    4348        HC      MULS     r0,r1,r0
        0x000022ba:    0080        ..      LSLS     r0,r0,#2
        0x000022bc:    08c0        ..      LSRS     r0,r0,#3
        0x000022be:    4920         I      LDR      r1,[pc,#128] ; [0x2340] = 0x200000c0
        0x000022c0:    6008        .`      STR      r0,[r1,#0]
        0x000022c2:    e017        ..      B        0x22f4 ; SystemCoreClockUpdate + 180
        0x000022c4:    207d        }       MOVS     r0,#0x7d
        0x000022c6:    0200        ..      LSLS     r0,r0,#8
        0x000022c8:    491d        .I      LDR      r1,[pc,#116] ; [0x2340] = 0x200000c0
        0x000022ca:    6008        .`      STR      r0,[r1,#0]
        0x000022cc:    e012        ..      B        0x22f4 ; SystemCoreClockUpdate + 180
        0x000022ce:    481d        .H      LDR      r0,[pc,#116] ; [0x2344] = 0x16e3600
        0x000022d0:    491b        .I      LDR      r1,[pc,#108] ; [0x2340] = 0x200000c0
        0x000022d2:    6008        .`      STR      r0,[r1,#0]
        0x000022d4:    e00e        ..      B        0x22f4 ; SystemCoreClockUpdate + 180
        0x000022d6:    481b        .H      LDR      r0,[pc,#108] ; [0x2344] = 0x16e3600
        0x000022d8:    4919        .I      LDR      r1,[pc,#100] ; [0x2340] = 0x200000c0
        0x000022da:    6008        .`      STR      r0,[r1,#0]
        0x000022dc:    4816        .H      LDR      r0,[pc,#88] ; [0x2338] = 0x400aa000
        0x000022de:    6800        .h      LDR      r0,[r0,#0]
        0x000022e0:    2102        .!      MOVS     r1,#2
        0x000022e2:    4008        .@      ANDS     r0,r0,r1
        0x000022e4:    2800        .(      CMP      r0,#0
        0x000022e6:    d004        ..      BEQ      0x22f2 ; SystemCoreClockUpdate + 178
        0x000022e8:    4815        .H      LDR      r0,[pc,#84] ; [0x2340] = 0x200000c0
        0x000022ea:    6800        .h      LDR      r0,[r0,#0]
        0x000022ec:    0040        @.      LSLS     r0,r0,#1
        0x000022ee:    4914        .I      LDR      r1,[pc,#80] ; [0x2340] = 0x200000c0
        0x000022f0:    6008        .`      STR      r0,[r1,#0]
        0x000022f2:    bf00        ..      NOP      
        0x000022f4:    bf00        ..      NOP      
        0x000022f6:    2001        .       MOVS     r0,#1
        0x000022f8:    0780        ..      LSLS     r0,r0,#30
        0x000022fa:    6800        .h      LDR      r0,[r0,#0]
        0x000022fc:    2102        .!      MOVS     r1,#2
        0x000022fe:    4008        .@      ANDS     r0,r0,r1
        0x00002300:    2800        .(      CMP      r0,#0
        0x00002302:    d004        ..      BEQ      0x230e ; SystemCoreClockUpdate + 206
        0x00002304:    480e        .H      LDR      r0,[pc,#56] ; [0x2340] = 0x200000c0
        0x00002306:    6800        .h      LDR      r0,[r0,#0]
        0x00002308:    08c0        ..      LSRS     r0,r0,#3
        0x0000230a:    490d        .I      LDR      r1,[pc,#52] ; [0x2340] = 0x200000c0
        0x0000230c:    6008        .`      STR      r0,[r1,#0]
        0x0000230e:    480c        .H      LDR      r0,[pc,#48] ; [0x2340] = 0x200000c0
        0x00002310:    6800        .h      LDR      r0,[r0,#0]
        0x00002312:    490a        .I      LDR      r1,[pc,#40] ; [0x233c] = 0x2dc6c00
        0x00002314:    4288        .B      CMP      r0,r1
        0x00002316:    d906        ..      BLS      0x2326 ; SystemCoreClockUpdate + 230
        0x00002318:    480b        .H      LDR      r0,[pc,#44] ; [0x2348] = 0x4004a000
        0x0000231a:    6900        .i      LDR      r0,[r0,#0x10]
        0x0000231c:    2101        .!      MOVS     r1,#1
        0x0000231e:    0449        I.      LSLS     r1,r1,#17
        0x00002320:    4308        .C      ORRS     r0,r0,r1
        0x00002322:    4909        .I      LDR      r1,[pc,#36] ; [0x2348] = 0x4004a000
        0x00002324:    6108        .a      STR      r0,[r1,#0x10]
        0x00002326:    4909        .I      LDR      r1,[pc,#36] ; [0x234c] = 0xf4240
        0x00002328:    4805        .H      LDR      r0,[pc,#20] ; [0x2340] = 0x200000c0
        0x0000232a:    6800        .h      LDR      r0,[r0,#0]
        0x0000232c:    f7fef91e    ....    BL       __aeabi_uidiv ; 0x56c
        0x00002330:    4907        .I      LDR      r1,[pc,#28] ; [0x2350] = 0x200000c4
        0x00002332:    6008        .`      STR      r0,[r1,#0]
        0x00002334:    bd10        ..      POP      {r4,pc}
    $d
        0x00002336:    0000        ..      DCW    0
        0x00002338:    400aa000    ...@    DCD    1074438144
        0x0000233c:    02dc6c00    .l..    DCD    48000000
        0x00002340:    200000c0    ...     DCD    536871104
        0x00002344:    016e3600    .6n.    DCD    24000000
        0x00002348:    4004a000    ...@    DCD    1074044928
        0x0000234c:    000f4240    @B..    DCD    1000000
        0x00002350:    200000c4    ...     DCD    536871108
    $t
    i.SystemInit
    SystemInit
        0x00002354:    b510        ..      PUSH     {r4,lr}
        0x00002356:    2001        .       MOVS     r0,#1
        0x00002358:    0780        ..      LSLS     r0,r0,#30
        0x0000235a:    6880        .h      LDR      r0,[r0,#8]
        0x0000235c:    2101        .!      MOVS     r1,#1
        0x0000235e:    0649        I.      LSLS     r1,r1,#25
        0x00002360:    4308        .C      ORRS     r0,r0,r1
        0x00002362:    0149        I.      LSLS     r1,r1,#5
        0x00002364:    6088        .`      STR      r0,[r1,#8]
        0x00002366:    2002        .       MOVS     r0,#2
        0x00002368:    0003        ..      MOVS     r3,r0
        0x0000236a:    f000fb0c    ....    BL       __ARM_common_switch8 ; 0x2986
    $d
        0x0000236e:    060a        ..      DCW    1546
        0x00002370:    120f0c09    ....    DCD    302976009
        0x00002374:    221e1a16    ..."    DCD    572398102
        0x00002378:    2825        %(      DCW    10277
    $t
        0x0000237a:    f000fb89    ....    BL       switchTo24MHz ; 0x2a90
        0x0000237e:    e01e        ..      B        0x23be ; SystemInit + 106
        0x00002380:    f000fbb2    ....    BL       switchTo3MHz ; 0x2ae8
        0x00002384:    e01b        ..      B        0x23be ; SystemInit + 106
        0x00002386:    f000fbcf    ....    BL       switchTo48MHz ; 0x2b28
        0x0000238a:    e018        ..      B        0x23be ; SystemInit + 106
        0x0000238c:    f000fbd8    ....    BL       switchTo6MHz ; 0x2b40
        0x00002390:    e015        ..      B        0x23be ; SystemInit + 106
        0x00002392:    2000        .       MOVS     r0,#0
        0x00002394:    f000fc22    ..".    BL       switchToXTAL ; 0x2bdc
        0x00002398:    e011        ..      B        0x23be ; SystemInit + 106
        0x0000239a:    2001        .       MOVS     r0,#1
        0x0000239c:    f000fc1e    ....    BL       switchToXTAL ; 0x2bdc
        0x000023a0:    e00d        ..      B        0x23be ; SystemInit + 106
        0x000023a2:    2000        .       MOVS     r0,#0
        0x000023a4:    f000fbeb    ....    BL       switchToPLL ; 0x2b7e
        0x000023a8:    e009        ..      B        0x23be ; SystemInit + 106
        0x000023aa:    2001        .       MOVS     r0,#1
        0x000023ac:    f000fbe7    ....    BL       switchToPLL ; 0x2b7e
        0x000023b0:    e005        ..      B        0x23be ; SystemInit + 106
        0x000023b2:    f000fb79    ..y.    BL       switchTo32KHz ; 0x2aa8
        0x000023b6:    e002        ..      B        0x23be ; SystemInit + 106
        0x000023b8:    f000fc5e    ..^.    BL       switchToXTAL_32K ; 0x2c78
        0x000023bc:    bf00        ..      NOP      
        0x000023be:    bf00        ..      NOP      
        0x000023c0:    f7ffff3e    ..>.    BL       SystemCoreClockUpdate ; 0x2240
        0x000023c4:    bd10        ..      POP      {r4,pc}
        0x000023c6:    0000        ..      MOVS     r0,r0
    i.TIMR_Init
    TIMR_Init
        0x000023c8:    b5ff        ..      PUSH     {r0-r7,lr}
        0x000023ca:    b081        ..      SUB      sp,sp,#4
        0x000023cc:    4604        .F      MOV      r4,r0
        0x000023ce:    460f        .F      MOV      r7,r1
        0x000023d0:    461e        .F      MOV      r6,r3
        0x000023d2:    9d0a        ..      LDR      r5,[sp,#0x28]
        0x000023d4:    484f        OH      LDR      r0,[pc,#316] ; [0x2514] = 0x40046800
        0x000023d6:    4284        .B      CMP      r4,r0
        0x000023d8:    d00b        ..      BEQ      0x23f2 ; TIMR_Init + 42
        0x000023da:    484e        NH      LDR      r0,[pc,#312] ; [0x2514] = 0x40046800
        0x000023dc:    3040        @0      ADDS     r0,r0,#0x40
        0x000023de:    4284        .B      CMP      r4,r0
        0x000023e0:    d007        ..      BEQ      0x23f2 ; TIMR_Init + 42
        0x000023e2:    484c        LH      LDR      r0,[pc,#304] ; [0x2514] = 0x40046800
        0x000023e4:    3080        .0      ADDS     r0,r0,#0x80
        0x000023e6:    4284        .B      CMP      r4,r0
        0x000023e8:    d003        ..      BEQ      0x23f2 ; TIMR_Init + 42
        0x000023ea:    484a        JH      LDR      r0,[pc,#296] ; [0x2514] = 0x40046800
        0x000023ec:    30c0        .0      ADDS     r0,r0,#0xc0
        0x000023ee:    4284        .B      CMP      r4,r0
        0x000023f0:    d123        #.      BNE      0x243a ; TIMR_Init + 114
        0x000023f2:    2001        .       MOVS     r0,#1
        0x000023f4:    0780        ..      LSLS     r0,r0,#30
        0x000023f6:    6880        .h      LDR      r0,[r0,#8]
        0x000023f8:    2101        .!      MOVS     r1,#1
        0x000023fa:    02c9        ..      LSLS     r1,r1,#11
        0x000023fc:    4308        .C      ORRS     r0,r0,r1
        0x000023fe:    04c9        ..      LSLS     r1,r1,#19
        0x00002400:    6088        .`      STR      r0,[r1,#8]
        0x00002402:    4620         F      MOV      r0,r4
        0x00002404:    f000f8e6    ....    BL       TIMR_Stop ; 0x25d4
        0x00002408:    68a0        .h      LDR      r0,[r4,#8]
        0x0000240a:    0900        ..      LSRS     r0,r0,#4
        0x0000240c:    0100        ..      LSLS     r0,r0,#4
        0x0000240e:    60a0        .`      STR      r0,[r4,#8]
        0x00002410:    68a0        .h      LDR      r0,[r4,#8]
        0x00002412:    4338        8C      ORRS     r0,r0,r7
        0x00002414:    60a0        .`      STR      r0,[r4,#8]
        0x00002416:    1e70        p.      SUBS     r0,r6,#1
        0x00002418:    6020         `      STR      r0,[r4,#0]
        0x0000241a:    201f        .       MOVS     r0,#0x1f
        0x0000241c:    60e0        .`      STR      r0,[r4,#0xc]
        0x0000241e:    2001        .       MOVS     r0,#1
        0x00002420:    6160        `a      STR      r0,[r4,#0x14]
        0x00002422:    2d00        .-      CMP      r5,#0
        0x00002424:    d004        ..      BEQ      0x2430 ; TIMR_Init + 104
        0x00002426:    6920         i      LDR      r0,[r4,#0x10]
        0x00002428:    0840        @.      LSRS     r0,r0,#1
        0x0000242a:    0040        @.      LSLS     r0,r0,#1
        0x0000242c:    6120         a      STR      r0,[r4,#0x10]
        0x0000242e:    e026        &.      B        0x247e ; TIMR_Init + 182
        0x00002430:    6920         i      LDR      r0,[r4,#0x10]
        0x00002432:    2101        .!      MOVS     r1,#1
