Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00002434:    4308        .C      ORRS     r0,r0,r1
        0x00002436:    6120         a      STR      r0,[r4,#0x10]
        0x00002438:    e021        !.      B        0x247e ; TIMR_Init + 182
        0x0000243a:    4837        7H      LDR      r0,[pc,#220] ; [0x2518] = 0x40048800
        0x0000243c:    4284        .B      CMP      r4,r0
        0x0000243e:    d00b        ..      BEQ      0x2458 ; TIMR_Init + 144
        0x00002440:    4835        5H      LDR      r0,[pc,#212] ; [0x2518] = 0x40048800
        0x00002442:    3040        @0      ADDS     r0,r0,#0x40
        0x00002444:    4284        .B      CMP      r4,r0
        0x00002446:    d007        ..      BEQ      0x2458 ; TIMR_Init + 144
        0x00002448:    4833        3H      LDR      r0,[pc,#204] ; [0x2518] = 0x40048800
        0x0000244a:    3080        .0      ADDS     r0,r0,#0x80
        0x0000244c:    4284        .B      CMP      r4,r0
        0x0000244e:    d003        ..      BEQ      0x2458 ; TIMR_Init + 144
        0x00002450:    4831        1H      LDR      r0,[pc,#196] ; [0x2518] = 0x40048800
        0x00002452:    30c0        .0      ADDS     r0,r0,#0xc0
        0x00002454:    4284        .B      CMP      r4,r0
        0x00002456:    d112        ..      BNE      0x247e ; TIMR_Init + 182
        0x00002458:    2001        .       MOVS     r0,#1
        0x0000245a:    0780        ..      LSLS     r0,r0,#30
        0x0000245c:    68c0        .h      LDR      r0,[r0,#0xc]
        0x0000245e:    2101        .!      MOVS     r1,#1
        0x00002460:    0589        ..      LSLS     r1,r1,#22
        0x00002462:    4308        .C      ORRS     r0,r0,r1
        0x00002464:    0209        ..      LSLS     r1,r1,#8
        0x00002466:    60c8        .`      STR      r0,[r1,#0xc]
        0x00002468:    4620         F      MOV      r0,r4
        0x0000246a:    f000f8b3    ....    BL       TIMR_Stop ; 0x25d4
        0x0000246e:    1e70        p.      SUBS     r0,r6,#1
        0x00002470:    6020         `      STR      r0,[r4,#0]
        0x00002472:    9803        ..      LDR      r0,[sp,#0xc]
        0x00002474:    1e40        @.      SUBS     r0,r0,#1
        0x00002476:    60a0        .`      STR      r0,[r4,#8]
        0x00002478:    2001        .       MOVS     r0,#1
        0x0000247a:    60e0        .`      STR      r0,[r4,#0xc]
        0x0000247c:    6160        `a      STR      r0,[r4,#0x14]
        0x0000247e:    4926        &I      LDR      r1,[pc,#152] ; [0x2518] = 0x40048800
        0x00002480:    1a60        `.      SUBS     r0,r4,r1
        0x00002482:    428c        .B      CMP      r4,r1
        0x00002484:    d02a        *.      BEQ      0x24dc ; TIMR_Init + 276
        0x00002486:    dc0a        ..      BGT      0x249e ; TIMR_Init + 214
        0x00002488:    4824        $H      LDR      r0,[pc,#144] ; [0x251c] = 0xbffb9800
        0x0000248a:    1820         .      ADDS     r0,r4,r0
        0x0000248c:    2800        .(      CMP      r0,#0
        0x0000248e:    d00d        ..      BEQ      0x24ac ; TIMR_Init + 228
        0x00002490:    2840        @(      CMP      r0,#0x40
        0x00002492:    d011        ..      BEQ      0x24b8 ; TIMR_Init + 240
        0x00002494:    2880        .(      CMP      r0,#0x80
        0x00002496:    d015        ..      BEQ      0x24c4 ; TIMR_Init + 252
        0x00002498:    28c0        .(      CMP      r0,#0xc0
        0x0000249a:    d137        7.      BNE      0x250c ; TIMR_Init + 324
        0x0000249c:    e018        ..      B        0x24d0 ; TIMR_Init + 264
        0x0000249e:    2840        @(      CMP      r0,#0x40
        0x000024a0:    d022        ".      BEQ      0x24e8 ; TIMR_Init + 288
        0x000024a2:    2880        .(      CMP      r0,#0x80
        0x000024a4:    d026        &.      BEQ      0x24f4 ; TIMR_Init + 300
        0x000024a6:    28c0        .(      CMP      r0,#0xc0
        0x000024a8:    d130        0.      BNE      0x250c ; TIMR_Init + 324
        0x000024aa:    e029        ).      B        0x2500 ; TIMR_Init + 312
        0x000024ac:    2d00        .-      CMP      r5,#0
        0x000024ae:    d002        ..      BEQ      0x24b6 ; TIMR_Init + 238
        0x000024b0:    2001        .       MOVS     r0,#1
        0x000024b2:    f7fefe81    ....    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024b6:    e029        ).      B        0x250c ; TIMR_Init + 324
        0x000024b8:    2d00        .-      CMP      r5,#0
        0x000024ba:    d002        ..      BEQ      0x24c2 ; TIMR_Init + 250
        0x000024bc:    2005        .       MOVS     r0,#5
        0x000024be:    f7fefe7b    ..{.    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024c2:    e023        #.      B        0x250c ; TIMR_Init + 324
        0x000024c4:    2d00        .-      CMP      r5,#0
        0x000024c6:    d002        ..      BEQ      0x24ce ; TIMR_Init + 262
        0x000024c8:    2009        .       MOVS     r0,#9
        0x000024ca:    f7fefe75    ..u.    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024ce:    e01d        ..      B        0x250c ; TIMR_Init + 324
        0x000024d0:    2d00        .-      CMP      r5,#0
        0x000024d2:    d002        ..      BEQ      0x24da ; TIMR_Init + 274
        0x000024d4:    200a        .       MOVS     r0,#0xa
        0x000024d6:    f7fefe6f    ..o.    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024da:    e017        ..      B        0x250c ; TIMR_Init + 324
        0x000024dc:    2d00        .-      CMP      r5,#0
        0x000024de:    d002        ..      BEQ      0x24e6 ; TIMR_Init + 286
        0x000024e0:    2008        .       MOVS     r0,#8
        0x000024e2:    f7fefe69    ..i.    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024e6:    e011        ..      B        0x250c ; TIMR_Init + 324
        0x000024e8:    2d00        .-      CMP      r5,#0
        0x000024ea:    d002        ..      BEQ      0x24f2 ; TIMR_Init + 298
        0x000024ec:    200f        .       MOVS     r0,#0xf
        0x000024ee:    f7fefe63    ..c.    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024f2:    e00b        ..      B        0x250c ; TIMR_Init + 324
        0x000024f4:    2d00        .-      CMP      r5,#0
        0x000024f6:    d002        ..      BEQ      0x24fe ; TIMR_Init + 310
        0x000024f8:    2019        .       MOVS     r0,#0x19
        0x000024fa:    f7fefe5d    ..].    BL       NVIC_EnableIRQ ; 0x11b8
        0x000024fe:    e005        ..      B        0x250c ; TIMR_Init + 324
        0x00002500:    2d00        .-      CMP      r5,#0
        0x00002502:    d002        ..      BEQ      0x250a ; TIMR_Init + 322
        0x00002504:    201f        .       MOVS     r0,#0x1f
        0x00002506:    f7fefe57    ..W.    BL       NVIC_EnableIRQ ; 0x11b8
        0x0000250a:    bf00        ..      NOP      
        0x0000250c:    bf00        ..      NOP      
        0x0000250e:    b005        ..      ADD      sp,sp,#0x14
        0x00002510:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x00002512:    0000        ..      DCW    0
        0x00002514:    40046800    .h.@    DCD    1074030592
        0x00002518:    40048800    ...@    DCD    1074038784
        0x0000251c:    bffb9800    ....    DCD    3220936704
    $t
    i.TIMR_Start
    TIMR_Start
        0x00002520:    4a28        (J      LDR      r2,[pc,#160] ; [0x25c4] = 0x40048800
        0x00002522:    1a81        ..      SUBS     r1,r0,r2
        0x00002524:    4290        .B      CMP      r0,r2
        0x00002526:    d02e        ..      BEQ      0x2586 ; TIMR_Start + 102
        0x00002528:    dc0a        ..      BGT      0x2540 ; TIMR_Start + 32
        0x0000252a:    4927        'I      LDR      r1,[pc,#156] ; [0x25c8] = 0xbffb9800
        0x0000252c:    1841        A.      ADDS     r1,r0,r1
        0x0000252e:    2900        .)      CMP      r1,#0
        0x00002530:    d00d        ..      BEQ      0x254e ; TIMR_Start + 46
        0x00002532:    2940        @)      CMP      r1,#0x40
        0x00002534:    d012        ..      BEQ      0x255c ; TIMR_Start + 60
        0x00002536:    2980        .)      CMP      r1,#0x80
        0x00002538:    d017        ..      BEQ      0x256a ; TIMR_Start + 74
        0x0000253a:    29c0        .)      CMP      r1,#0xc0
        0x0000253c:    d13f        ?.      BNE      0x25be ; TIMR_Start + 158
        0x0000253e:    e01b        ..      B        0x2578 ; TIMR_Start + 88
        0x00002540:    2940        @)      CMP      r1,#0x40
        0x00002542:    d027        '.      BEQ      0x2594 ; TIMR_Start + 116
        0x00002544:    2980        .)      CMP      r1,#0x80
        0x00002546:    d02c        ,.      BEQ      0x25a2 ; TIMR_Start + 130
        0x00002548:    29c0        .)      CMP      r1,#0xc0
        0x0000254a:    d138        8.      BNE      0x25be ; TIMR_Start + 158
        0x0000254c:    e030        0.      B        0x25b0 ; TIMR_Start + 144
        0x0000254e:    491f        .I      LDR      r1,[pc,#124] ; [0x25cc] = 0x40046c40
        0x00002550:    6809        .h      LDR      r1,[r1,#0]
        0x00002552:    2201        ."      MOVS     r2,#1
        0x00002554:    4311        .C      ORRS     r1,r1,r2
        0x00002556:    4a1d        .J      LDR      r2,[pc,#116] ; [0x25cc] = 0x40046c40
        0x00002558:    6011        .`      STR      r1,[r2,#0]
        0x0000255a:    e030        0.      B        0x25be ; TIMR_Start + 158
        0x0000255c:    491b        .I      LDR      r1,[pc,#108] ; [0x25cc] = 0x40046c40
        0x0000255e:    6809        .h      LDR      r1,[r1,#0]
        0x00002560:    2202        ."      MOVS     r2,#2
        0x00002562:    4311        .C      ORRS     r1,r1,r2
        0x00002564:    4a19        .J      LDR      r2,[pc,#100] ; [0x25cc] = 0x40046c40
        0x00002566:    6011        .`      STR      r1,[r2,#0]
        0x00002568:    e029        ).      B        0x25be ; TIMR_Start + 158
        0x0000256a:    4918        .I      LDR      r1,[pc,#96] ; [0x25cc] = 0x40046c40
        0x0000256c:    6809        .h      LDR      r1,[r1,#0]
        0x0000256e:    2204        ."      MOVS     r2,#4
        0x00002570:    4311        .C      ORRS     r1,r1,r2
        0x00002572:    4a16        .J      LDR      r2,[pc,#88] ; [0x25cc] = 0x40046c40
        0x00002574:    6011        .`      STR      r1,[r2,#0]
        0x00002576:    e022        ".      B        0x25be ; TIMR_Start + 158
        0x00002578:    4914        .I      LDR      r1,[pc,#80] ; [0x25cc] = 0x40046c40
        0x0000257a:    6809        .h      LDR      r1,[r1,#0]
        0x0000257c:    2208        ."      MOVS     r2,#8
        0x0000257e:    4311        .C      ORRS     r1,r1,r2
        0x00002580:    4a12        .J      LDR      r2,[pc,#72] ; [0x25cc] = 0x40046c40
        0x00002582:    6011        .`      STR      r1,[r2,#0]
        0x00002584:    e01b        ..      B        0x25be ; TIMR_Start + 158
        0x00002586:    4912        .I      LDR      r1,[pc,#72] ; [0x25d0] = 0x40048c40
        0x00002588:    6809        .h      LDR      r1,[r1,#0]
        0x0000258a:    2201        ."      MOVS     r2,#1
        0x0000258c:    4311        .C      ORRS     r1,r1,r2
        0x0000258e:    4a10        .J      LDR      r2,[pc,#64] ; [0x25d0] = 0x40048c40
        0x00002590:    6011        .`      STR      r1,[r2,#0]
        0x00002592:    e014        ..      B        0x25be ; TIMR_Start + 158
        0x00002594:    490e        .I      LDR      r1,[pc,#56] ; [0x25d0] = 0x40048c40
        0x00002596:    6809        .h      LDR      r1,[r1,#0]
        0x00002598:    2202        ."      MOVS     r2,#2
        0x0000259a:    4311        .C      ORRS     r1,r1,r2
        0x0000259c:    4a0c        .J      LDR      r2,[pc,#48] ; [0x25d0] = 0x40048c40
        0x0000259e:    6011        .`      STR      r1,[r2,#0]
        0x000025a0:    e00d        ..      B        0x25be ; TIMR_Start + 158
        0x000025a2:    490b        .I      LDR      r1,[pc,#44] ; [0x25d0] = 0x40048c40
        0x000025a4:    6809        .h      LDR      r1,[r1,#0]
        0x000025a6:    2204        ."      MOVS     r2,#4
        0x000025a8:    4311        .C      ORRS     r1,r1,r2
        0x000025aa:    4a09        .J      LDR      r2,[pc,#36] ; [0x25d0] = 0x40048c40
        0x000025ac:    6011        .`      STR      r1,[r2,#0]
        0x000025ae:    e006        ..      B        0x25be ; TIMR_Start + 158
        0x000025b0:    4907        .I      LDR      r1,[pc,#28] ; [0x25d0] = 0x40048c40
        0x000025b2:    6809        .h      LDR      r1,[r1,#0]
        0x000025b4:    2208        ."      MOVS     r2,#8
        0x000025b6:    4311        .C      ORRS     r1,r1,r2
        0x000025b8:    4a05        .J      LDR      r2,[pc,#20] ; [0x25d0] = 0x40048c40
        0x000025ba:    6011        .`      STR      r1,[r2,#0]
        0x000025bc:    bf00        ..      NOP      
        0x000025be:    bf00        ..      NOP      
        0x000025c0:    4770        pG      BX       lr
    $d
        0x000025c2:    0000        ..      DCW    0
        0x000025c4:    40048800    ...@    DCD    1074038784
        0x000025c8:    bffb9800    ....    DCD    3220936704
        0x000025cc:    40046c40    @l.@    DCD    1074031680
        0x000025d0:    40048c40    @..@    DCD    1074039872
    $t
    i.TIMR_Stop
    TIMR_Stop
        0x000025d4:    4a28        (J      LDR      r2,[pc,#160] ; [0x2678] = 0x40048800
        0x000025d6:    1a81        ..      SUBS     r1,r0,r2
        0x000025d8:    4290        .B      CMP      r0,r2
        0x000025da:    d02e        ..      BEQ      0x263a ; TIMR_Stop + 102
        0x000025dc:    dc0a        ..      BGT      0x25f4 ; TIMR_Stop + 32
        0x000025de:    4927        'I      LDR      r1,[pc,#156] ; [0x267c] = 0xbffb9800
        0x000025e0:    1841        A.      ADDS     r1,r0,r1
        0x000025e2:    2900        .)      CMP      r1,#0
        0x000025e4:    d00d        ..      BEQ      0x2602 ; TIMR_Stop + 46
        0x000025e6:    2940        @)      CMP      r1,#0x40
        0x000025e8:    d012        ..      BEQ      0x2610 ; TIMR_Stop + 60
        0x000025ea:    2980        .)      CMP      r1,#0x80
        0x000025ec:    d017        ..      BEQ      0x261e ; TIMR_Stop + 74
        0x000025ee:    29c0        .)      CMP      r1,#0xc0
        0x000025f0:    d13f        ?.      BNE      0x2672 ; TIMR_Stop + 158
        0x000025f2:    e01b        ..      B        0x262c ; TIMR_Stop + 88
        0x000025f4:    2940        @)      CMP      r1,#0x40
        0x000025f6:    d027        '.      BEQ      0x2648 ; TIMR_Stop + 116
        0x000025f8:    2980        .)      CMP      r1,#0x80
        0x000025fa:    d02c        ,.      BEQ      0x2656 ; TIMR_Stop + 130
        0x000025fc:    29c0        .)      CMP      r1,#0xc0
        0x000025fe:    d138        8.      BNE      0x2672 ; TIMR_Stop + 158
        0x00002600:    e030        0.      B        0x2664 ; TIMR_Stop + 144
        0x00002602:    491f        .I      LDR      r1,[pc,#124] ; [0x2680] = 0x40046c40
        0x00002604:    6809        .h      LDR      r1,[r1,#0]
        0x00002606:    0849        I.      LSRS     r1,r1,#1
        0x00002608:    0049        I.      LSLS     r1,r1,#1
        0x0000260a:    4a1d        .J      LDR      r2,[pc,#116] ; [0x2680] = 0x40046c40
        0x0000260c:    6011        .`      STR      r1,[r2,#0]
        0x0000260e:    e030        0.      B        0x2672 ; TIMR_Stop + 158
        0x00002610:    491b        .I      LDR      r1,[pc,#108] ; [0x2680] = 0x40046c40
        0x00002612:    6809        .h      LDR      r1,[r1,#0]
        0x00002614:    2202        ."      MOVS     r2,#2
        0x00002616:    4391        .C      BICS     r1,r1,r2
        0x00002618:    4a19        .J      LDR      r2,[pc,#100] ; [0x2680] = 0x40046c40
        0x0000261a:    6011        .`      STR      r1,[r2,#0]
        0x0000261c:    e029        ).      B        0x2672 ; TIMR_Stop + 158
        0x0000261e:    4918        .I      LDR      r1,[pc,#96] ; [0x2680] = 0x40046c40
        0x00002620:    6809        .h      LDR      r1,[r1,#0]
        0x00002622:    2204        ."      MOVS     r2,#4
        0x00002624:    4391        .C      BICS     r1,r1,r2
        0x00002626:    4a16        .J      LDR      r2,[pc,#88] ; [0x2680] = 0x40046c40
        0x00002628:    6011        .`      STR      r1,[r2,#0]
        0x0000262a:    e022        ".      B        0x2672 ; TIMR_Stop + 158
        0x0000262c:    4914        .I      LDR      r1,[pc,#80] ; [0x2680] = 0x40046c40
        0x0000262e:    6809        .h      LDR      r1,[r1,#0]
        0x00002630:    2208        ."      MOVS     r2,#8
        0x00002632:    4391        .C      BICS     r1,r1,r2
        0x00002634:    4a12        .J      LDR      r2,[pc,#72] ; [0x2680] = 0x40046c40
        0x00002636:    6011        .`      STR      r1,[r2,#0]
        0x00002638:    e01b        ..      B        0x2672 ; TIMR_Stop + 158
        0x0000263a:    4912        .I      LDR      r1,[pc,#72] ; [0x2684] = 0x40048c40
        0x0000263c:    6809        .h      LDR      r1,[r1,#0]
        0x0000263e:    0849        I.      LSRS     r1,r1,#1
        0x00002640:    0049        I.      LSLS     r1,r1,#1
        0x00002642:    4a10        .J      LDR      r2,[pc,#64] ; [0x2684] = 0x40048c40
        0x00002644:    6011        .`      STR      r1,[r2,#0]
        0x00002646:    e014        ..      B        0x2672 ; TIMR_Stop + 158
        0x00002648:    490e        .I      LDR      r1,[pc,#56] ; [0x2684] = 0x40048c40
        0x0000264a:    6809        .h      LDR      r1,[r1,#0]
        0x0000264c:    2202        ."      MOVS     r2,#2
        0x0000264e:    4391        .C      BICS     r1,r1,r2
        0x00002650:    4a0c        .J      LDR      r2,[pc,#48] ; [0x2684] = 0x40048c40
        0x00002652:    6011        .`      STR      r1,[r2,#0]
        0x00002654:    e00d        ..      B        0x2672 ; TIMR_Stop + 158
        0x00002656:    490b        .I      LDR      r1,[pc,#44] ; [0x2684] = 0x40048c40
        0x00002658:    6809        .h      LDR      r1,[r1,#0]
        0x0000265a:    2204        ."      MOVS     r2,#4
        0x0000265c:    4391        .C      BICS     r1,r1,r2
        0x0000265e:    4a09        .J      LDR      r2,[pc,#36] ; [0x2684] = 0x40048c40
        0x00002660:    6011        .`      STR      r1,[r2,#0]
        0x00002662:    e006        ..      B        0x2672 ; TIMR_Stop + 158
        0x00002664:    4907        .I      LDR      r1,[pc,#28] ; [0x2684] = 0x40048c40
        0x00002666:    6809        .h      LDR      r1,[r1,#0]
        0x00002668:    2208        ."      MOVS     r2,#8
        0x0000266a:    4391        .C      BICS     r1,r1,r2
        0x0000266c:    4a05        .J      LDR      r2,[pc,#20] ; [0x2684] = 0x40048c40
        0x0000266e:    6011        .`      STR      r1,[r2,#0]
        0x00002670:    bf00        ..      NOP      
        0x00002672:    bf00        ..      NOP      
        0x00002674:    4770        pG      BX       lr
    $d
        0x00002676:    0000        ..      DCW    0
        0x00002678:    40048800    ...@    DCD    1074038784
        0x0000267c:    bffb9800    ....    DCD    3220936704
        0x00002680:    40046c40    @l.@    DCD    1074031680
        0x00002684:    40048c40    @..@    DCD    1074039872
    $t
    i.UART_Close
    UART_Close
        0x00002688:    6841        Ah      LDR      r1,[r0,#4]
        0x0000268a:    2201        ."      MOVS     r2,#1
        0x0000268c:    0252        R.      LSLS     r2,r2,#9
        0x0000268e:    4391        .C      BICS     r1,r1,r2
        0x00002690:    6041        A`      STR      r1,[r0,#4]
        0x00002692:    4770        pG      BX       lr
    i.UART_Init
    UART_Init
        0x00002694:    b570        p.      PUSH     {r4-r6,lr}
        0x00002696:    4604        .F      MOV      r4,r0
        0x00002698:    460d        .F      MOV      r5,r1
        0x0000269a:    4983        .I      LDR      r1,[pc,#524] ; [0x28a8] = 0x40043000
        0x0000269c:    1a60        `.      SUBS     r0,r4,r1
        0x0000269e:    428c        .B      CMP      r4,r1
        0x000026a0:    d022        ".      BEQ      0x26e8 ; UART_Init + 84
        0x000026a2:    dc08        ..      BGT      0x26b6 ; UART_Init + 34
        0x000026a4:    4881        .H      LDR      r0,[pc,#516] ; [0x28ac] = 0xbffbe000
        0x000026a6:    1820         .      ADDS     r0,r4,r0
        0x000026a8:    2800        .(      CMP      r0,#0
        0x000026aa:    d00d        ..      BEQ      0x26c8 ; UART_Init + 52
        0x000026ac:    2101        .!      MOVS     r1,#1
        0x000026ae:    02c9        ..      LSLS     r1,r1,#11
        0x000026b0:    1a40        @.      SUBS     r0,r0,r1
        0x000026b2:    d133        3.      BNE      0x271c ; UART_Init + 136
        0x000026b4:    e010        ..      B        0x26d8 ; UART_Init + 68
        0x000026b6:    2101        .!      MOVS     r1,#1
        0x000026b8:    02c9        ..      LSLS     r1,r1,#11
        0x000026ba:    1a40        @.      SUBS     r0,r0,r1
        0x000026bc:    d01d        ..      BEQ      0x26fa ; UART_Init + 102
        0x000026be:    21bf        .!      MOVS     r1,#0xbf
        0x000026c0:    02c9        ..      LSLS     r1,r1,#11
        0x000026c2:    1a40        @.      SUBS     r0,r0,r1
        0x000026c4:    d12a        *.      BNE      0x271c ; UART_Init + 136
        0x000026c6:    e021        !.      B        0x270c ; UART_Init + 120
        0x000026c8:    2001        .       MOVS     r0,#1
        0x000026ca:    0780        ..      LSLS     r0,r0,#30
        0x000026cc:    6880        .h      LDR      r0,[r0,#8]
        0x000026ce:    2140        @!      MOVS     r1,#0x40
        0x000026d0:    4308        .C      ORRS     r0,r0,r1
        0x000026d2:    0609        ..      LSLS     r1,r1,#24
        0x000026d4:    6088        .`      STR      r0,[r1,#8]
        0x000026d6:    e021        !.      B        0x271c ; UART_Init + 136
        0x000026d8:    2001        .       MOVS     r0,#1
        0x000026da:    0780        ..      LSLS     r0,r0,#30
        0x000026dc:    6880        .h      LDR      r0,[r0,#8]
        0x000026de:    2180        .!      MOVS     r1,#0x80
        0x000026e0:    4308        .C      ORRS     r0,r0,r1
        0x000026e2:    05c9        ..      LSLS     r1,r1,#23
        0x000026e4:    6088        .`      STR      r0,[r1,#8]
        0x000026e6:    e019        ..      B        0x271c ; UART_Init + 136
        0x000026e8:    2001        .       MOVS     r0,#1
        0x000026ea:    0780        ..      LSLS     r0,r0,#30
        0x000026ec:    6880        .h      LDR      r0,[r0,#8]
        0x000026ee:    21ff        .!      MOVS     r1,#0xff
        0x000026f0:    3101        .1      ADDS     r1,#1
        0x000026f2:    4308        .C      ORRS     r0,r0,r1
        0x000026f4:    0589        ..      LSLS     r1,r1,#22
        0x000026f6:    6088        .`      STR      r0,[r1,#8]
        0x000026f8:    e010        ..      B        0x271c ; UART_Init + 136
        0x000026fa:    2001        .       MOVS     r0,#1
        0x000026fc:    0780        ..      LSLS     r0,r0,#30
        0x000026fe:    6880        .h      LDR      r0,[r0,#8]
        0x00002700:    2101        .!      MOVS     r1,#1
        0x00002702:    0249        I.      LSLS     r1,r1,#9
        0x00002704:    4308        .C      ORRS     r0,r0,r1
        0x00002706:    0549        I.      LSLS     r1,r1,#21
        0x00002708:    6088        .`      STR      r0,[r1,#8]
        0x0000270a:    e007        ..      B        0x271c ; UART_Init + 136
        0x0000270c:    2001        .       MOVS     r0,#1
        0x0000270e:    0780        ..      LSLS     r0,r0,#30
        0x00002710:    68c0        .h      LDR      r0,[r0,#0xc]
        0x00002712:    2110        .!      MOVS     r1,#0x10
        0x00002714:    4308        .C      ORRS     r0,r0,r1
