Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00002716:    0689        ..      LSLS     r1,r1,#26
        0x00002718:    60c8        .`      STR      r0,[r1,#0xc]
        0x0000271a:    bf00        ..      NOP      
        0x0000271c:    bf00        ..      NOP      
        0x0000271e:    4620         F      MOV      r0,r4
        0x00002720:    f7ffffb2    ....    BL       UART_Close ; 0x2688
        0x00002724:    6860        `h      LDR      r0,[r4,#4]
        0x00002726:    2101        .!      MOVS     r1,#1
        0x00002728:    0349        I.      LSLS     r1,r1,#13
        0x0000272a:    4308        .C      ORRS     r0,r0,r1
        0x0000272c:    6060        ``      STR      r0,[r4,#4]
        0x0000272e:    68a0        .h      LDR      r0,[r4,#8]
        0x00002730:    0b80        ..      LSRS     r0,r0,#14
        0x00002732:    0380        ..      LSLS     r0,r0,#14
        0x00002734:    60a0        .`      STR      r0,[r4,#8]
        0x00002736:    485d        ]H      LDR      r0,[pc,#372] ; [0x28ac] = 0xbffbe000
        0x00002738:    4240        @B      RSBS     r0,r0,#0
        0x0000273a:    4284        .B      CMP      r4,r0
        0x0000273c:    d008        ..      BEQ      0x2750 ; UART_Init + 188
        0x0000273e:    485c        \H      LDR      r0,[pc,#368] ; [0x28b0] = 0x40042800
        0x00002740:    4284        .B      CMP      r4,r0
        0x00002742:    d005        ..      BEQ      0x2750 ; UART_Init + 188
        0x00002744:    4858        XH      LDR      r0,[pc,#352] ; [0x28a8] = 0x40043000
        0x00002746:    4284        .B      CMP      r4,r0
        0x00002748:    d002        ..      BEQ      0x2750 ; UART_Init + 188
        0x0000274a:    485a        ZH      LDR      r0,[pc,#360] ; [0x28b4] = 0x40043800
        0x0000274c:    4284        .B      CMP      r4,r0
        0x0000274e:    d10a        ..      BNE      0x2766 ; UART_Init + 210
        0x00002750:    4a59        YJ      LDR      r2,[pc,#356] ; [0x28b8] = 0x200000c0
        0x00002752:    6829        )h      LDR      r1,[r5,#0]
        0x00002754:    6812        .h      LDR      r2,[r2,#0]
        0x00002756:    0910        ..      LSRS     r0,r2,#4
        0x00002758:    f7fdff08    ....    BL       __aeabi_uidiv ; 0x56c
        0x0000275c:    1e40        @.      SUBS     r0,r0,#1
        0x0000275e:    68a1        .h      LDR      r1,[r4,#8]
        0x00002760:    4308        .C      ORRS     r0,r0,r1
        0x00002762:    60a0        .`      STR      r0,[r4,#8]
        0x00002764:    e009        ..      B        0x277a ; UART_Init + 230
        0x00002766:    4a54        TJ      LDR      r2,[pc,#336] ; [0x28b8] = 0x200000c0
        0x00002768:    6829        )h      LDR      r1,[r5,#0]
        0x0000276a:    6812        .h      LDR      r2,[r2,#0]
        0x0000276c:    0950        P.      LSRS     r0,r2,#5
        0x0000276e:    f7fdfefd    ....    BL       __aeabi_uidiv ; 0x56c
        0x00002772:    1e40        @.      SUBS     r0,r0,#1
        0x00002774:    68a1        .h      LDR      r1,[r4,#8]
        0x00002776:    4308        .C      ORRS     r0,r0,r1
        0x00002778:    60a0        .`      STR      r0,[r4,#8]
        0x0000277a:    6860        `h      LDR      r0,[r4,#4]
        0x0000277c:    213f        ?!      MOVS     r1,#0x3f
        0x0000277e:    0489        ..      LSLS     r1,r1,#18
        0x00002780:    4388        .C      BICS     r0,r0,r1
        0x00002782:    6060        ``      STR      r0,[r4,#4]
        0x00002784:    7928        (y      LDRB     r0,[r5,#4]
        0x00002786:    0480        ..      LSLS     r0,r0,#18
        0x00002788:    7969        iy      LDRB     r1,[r5,#5]
        0x0000278a:    04c9        ..      LSLS     r1,r1,#19
        0x0000278c:    4308        .C      ORRS     r0,r0,r1
        0x0000278e:    79a9        .y      LDRB     r1,[r5,#6]
        0x00002790:    0589        ..      LSLS     r1,r1,#22
        0x00002792:    4308        .C      ORRS     r0,r0,r1
        0x00002794:    6861        ah      LDR      r1,[r4,#4]
        0x00002796:    4308        .C      ORRS     r0,r0,r1
        0x00002798:    6060        ``      STR      r0,[r4,#4]
        0x0000279a:    68e0        .h      LDR      r0,[r4,#0xc]
        0x0000279c:    b280        ..      UXTH     r0,r0
        0x0000279e:    60e0        .`      STR      r0,[r4,#0xc]
        0x000027a0:    79e8        .y      LDRB     r0,[r5,#7]
        0x000027a2:    0400        ..      LSLS     r0,r0,#16
        0x000027a4:    7a69        iz      LDRB     r1,[r5,#9]
        0x000027a6:    0609        ..      LSLS     r1,r1,#24
        0x000027a8:    4308        .C      ORRS     r0,r0,r1
        0x000027aa:    68e1        .h      LDR      r1,[r4,#0xc]
        0x000027ac:    4308        .C      ORRS     r0,r0,r1
        0x000027ae:    60e0        .`      STR      r0,[r4,#0xc]
        0x000027b0:    6860        `h      LDR      r0,[r4,#4]
        0x000027b2:    0200        ..      LSLS     r0,r0,#8
        0x000027b4:    0a00        ..      LSRS     r0,r0,#8
        0x000027b6:    6060        ``      STR      r0,[r4,#4]
        0x000027b8:    6860        `h      LDR      r0,[r4,#4]
        0x000027ba:    7ae9        .z      LDRB     r1,[r5,#0xb]
        0x000027bc:    0609        ..      LSLS     r1,r1,#24
        0x000027be:    4308        .C      ORRS     r0,r0,r1
        0x000027c0:    6060        ``      STR      r0,[r4,#4]
        0x000027c2:    6860        `h      LDR      r0,[r4,#4]
        0x000027c4:    493d        =I      LDR      r1,[pc,#244] ; [0x28bc] = 0xffffbfeb
        0x000027c6:    4008        .@      ANDS     r0,r0,r1
        0x000027c8:    6060        ``      STR      r0,[r4,#4]
        0x000027ca:    7a28        (z      LDRB     r0,[r5,#8]
        0x000027cc:    0100        ..      LSLS     r0,r0,#4
        0x000027ce:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x000027d0:    0089        ..      LSLS     r1,r1,#2
        0x000027d2:    4308        .C      ORRS     r0,r0,r1
        0x000027d4:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x000027d6:    0389        ..      LSLS     r1,r1,#14
        0x000027d8:    4308        .C      ORRS     r0,r0,r1
        0x000027da:    6861        ah      LDR      r1,[r4,#4]
        0x000027dc:    4308        .C      ORRS     r0,r0,r1
        0x000027de:    6060        ``      STR      r0,[r4,#4]
        0x000027e0:    4931        1I      LDR      r1,[pc,#196] ; [0x28a8] = 0x40043000
        0x000027e2:    1a60        `.      SUBS     r0,r4,r1
        0x000027e4:    428c        .B      CMP      r4,r1
        0x000027e6:    d030        0.      BEQ      0x284a ; UART_Init + 438
        0x000027e8:    dc08        ..      BGT      0x27fc ; UART_Init + 360
        0x000027ea:    4830        0H      LDR      r0,[pc,#192] ; [0x28ac] = 0xbffbe000
        0x000027ec:    1820         .      ADDS     r0,r4,r0
        0x000027ee:    2800        .(      CMP      r0,#0
        0x000027f0:    d00d        ..      BEQ      0x280e ; UART_Init + 378
        0x000027f2:    2101        .!      MOVS     r1,#1
        0x000027f4:    02c9        ..      LSLS     r1,r1,#11
        0x000027f6:    1a40        @.      SUBS     r0,r0,r1
        0x000027f8:    d154        T.      BNE      0x28a4 ; UART_Init + 528
        0x000027fa:    e017        ..      B        0x282c ; UART_Init + 408
        0x000027fc:    2101        .!      MOVS     r1,#1
        0x000027fe:    02c9        ..      LSLS     r1,r1,#11
        0x00002800:    1a40        @.      SUBS     r0,r0,r1
        0x00002802:    d031        1.      BEQ      0x2868 ; UART_Init + 468
        0x00002804:    21bf        .!      MOVS     r1,#0xbf
        0x00002806:    02c9        ..      LSLS     r1,r1,#11
        0x00002808:    1a40        @.      SUBS     r0,r0,r1
        0x0000280a:    d14b        K.      BNE      0x28a4 ; UART_Init + 528
        0x0000280c:    e03b        ;.      B        0x2886 ; UART_Init + 498
        0x0000280e:    7a28        (z      LDRB     r0,[r5,#8]
        0x00002810:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x00002812:    4308        .C      ORRS     r0,r0,r1
        0x00002814:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x00002816:    4308        .C      ORRS     r0,r0,r1
        0x00002818:    2800        .(      CMP      r0,#0
        0x0000281a:    d003        ..      BEQ      0x2824 ; UART_Init + 400
        0x0000281c:    2000        .       MOVS     r0,#0
        0x0000281e:    f7fefcd5    ....    BL       NVIC_EnableIRQ ; 0x11cc
        0x00002822:    e002        ..      B        0x282a ; UART_Init + 406
        0x00002824:    2000        .       MOVS     r0,#0
        0x00002826:    f7fefcbd    ....    BL       NVIC_DisableIRQ ; 0x11a4
        0x0000282a:    e03b        ;.      B        0x28a4 ; UART_Init + 528
        0x0000282c:    7a28        (z      LDRB     r0,[r5,#8]
        0x0000282e:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x00002830:    4308        .C      ORRS     r0,r0,r1
        0x00002832:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x00002834:    4308        .C      ORRS     r0,r0,r1
        0x00002836:    2800        .(      CMP      r0,#0
        0x00002838:    d003        ..      BEQ      0x2842 ; UART_Init + 430
        0x0000283a:    2003        .       MOVS     r0,#3
        0x0000283c:    f7fefcc6    ....    BL       NVIC_EnableIRQ ; 0x11cc
        0x00002840:    e002        ..      B        0x2848 ; UART_Init + 436
        0x00002842:    2003        .       MOVS     r0,#3
        0x00002844:    f7fefcae    ....    BL       NVIC_DisableIRQ ; 0x11a4
        0x00002848:    e02c        ,.      B        0x28a4 ; UART_Init + 528
        0x0000284a:    7a28        (z      LDRB     r0,[r5,#8]
        0x0000284c:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x0000284e:    4308        .C      ORRS     r0,r0,r1
        0x00002850:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x00002852:    4308        .C      ORRS     r0,r0,r1
        0x00002854:    2800        .(      CMP      r0,#0
        0x00002856:    d003        ..      BEQ      0x2860 ; UART_Init + 460
        0x00002858:    2004        .       MOVS     r0,#4
        0x0000285a:    f7fefcb7    ....    BL       NVIC_EnableIRQ ; 0x11cc
        0x0000285e:    e002        ..      B        0x2866 ; UART_Init + 466
        0x00002860:    2004        .       MOVS     r0,#4
        0x00002862:    f7fefc9f    ....    BL       NVIC_DisableIRQ ; 0x11a4
        0x00002866:    e01d        ..      B        0x28a4 ; UART_Init + 528
        0x00002868:    7a28        (z      LDRB     r0,[r5,#8]
        0x0000286a:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x0000286c:    4308        .C      ORRS     r0,r0,r1
        0x0000286e:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x00002870:    4308        .C      ORRS     r0,r0,r1
        0x00002872:    2800        .(      CMP      r0,#0
        0x00002874:    d003        ..      BEQ      0x287e ; UART_Init + 490
        0x00002876:    200d        .       MOVS     r0,#0xd
        0x00002878:    f7fefca8    ....    BL       NVIC_EnableIRQ ; 0x11cc
        0x0000287c:    e002        ..      B        0x2884 ; UART_Init + 496
        0x0000287e:    200d        .       MOVS     r0,#0xd
        0x00002880:    f7fefc90    ....    BL       NVIC_DisableIRQ ; 0x11a4
        0x00002884:    e00e        ..      B        0x28a4 ; UART_Init + 528
        0x00002886:    7a28        (z      LDRB     r0,[r5,#8]
        0x00002888:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x0000288a:    4308        .C      ORRS     r0,r0,r1
        0x0000288c:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x0000288e:    4308        .C      ORRS     r0,r0,r1
        0x00002890:    2800        .(      CMP      r0,#0
        0x00002892:    d003        ..      BEQ      0x289c ; UART_Init + 520
        0x00002894:    201b        .       MOVS     r0,#0x1b
        0x00002896:    f7fefc99    ....    BL       NVIC_EnableIRQ ; 0x11cc
        0x0000289a:    e002        ..      B        0x28a2 ; UART_Init + 526
        0x0000289c:    201b        .       MOVS     r0,#0x1b
        0x0000289e:    f7fefc81    ....    BL       NVIC_DisableIRQ ; 0x11a4
        0x000028a2:    bf00        ..      NOP      
        0x000028a4:    bf00        ..      NOP      
        0x000028a6:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000028a8:    40043000    .0.@    DCD    1074016256
        0x000028ac:    bffbe000    ....    DCD    3220955136
        0x000028b0:    40042800    .(.@    DCD    1074014208
        0x000028b4:    40043800    .8.@    DCD    1074018304
        0x000028b8:    200000c0    ...     DCD    536871104
        0x000028bc:    ffffbfeb    ....    DCD    4294950891
    $t
    i.UART_IsTXBusy
    UART_IsTXBusy
        0x000028c0:    4601        .F      MOV      r1,r0
        0x000028c2:    68c8        .h      LDR      r0,[r1,#0xc]
        0x000028c4:    22ff        ."      MOVS     r2,#0xff
        0x000028c6:    0212        ..      LSLS     r2,r2,#8
        0x000028c8:    4010        .@      ANDS     r0,r0,r2
        0x000028ca:    2800        .(      CMP      r0,#0
        0x000028cc:    d001        ..      BEQ      0x28d2 ; UART_IsTXBusy + 18
        0x000028ce:    2001        .       MOVS     r0,#1
        0x000028d0:    4770        pG      BX       lr
        0x000028d2:    6888        .h      LDR      r0,[r1,#8]
        0x000028d4:    2201        ."      MOVS     r2,#1
        0x000028d6:    0392        ..      LSLS     r2,r2,#14
        0x000028d8:    4010        .@      ANDS     r0,r0,r2
        0x000028da:    2800        .(      CMP      r0,#0
        0x000028dc:    d004        ..      BEQ      0x28e8 ; UART_IsTXBusy + 40
        0x000028de:    6848        Hh      LDR      r0,[r1,#4]
        0x000028e0:    07c0        ..      LSLS     r0,r0,#31
        0x000028e2:    0fc0        ..      LSRS     r0,r0,#31
        0x000028e4:    2800        .(      CMP      r0,#0
        0x000028e6:    d101        ..      BNE      0x28ec ; UART_IsTXBusy + 44
        0x000028e8:    2001        .       MOVS     r0,#1
        0x000028ea:    e7f1        ..      B        0x28d0 ; UART_IsTXBusy + 16
        0x000028ec:    2000        .       MOVS     r0,#0
        0x000028ee:    e7ef        ..      B        0x28d0 ; UART_IsTXBusy + 16
    i.UART_Open
    UART_Open
        0x000028f0:    6841        Ah      LDR      r1,[r0,#4]
        0x000028f2:    2201        ."      MOVS     r2,#1
        0x000028f4:    0252        R.      LSLS     r2,r2,#9
        0x000028f6:    4311        .C      ORRS     r1,r1,r2
        0x000028f8:    6041        A`      STR      r1,[r0,#4]
        0x000028fa:    4770        pG      BX       lr
    i.UART_WriteByte
    UART_WriteByte
        0x000028fc:    6001        .`      STR      r1,[r0,#0]
        0x000028fe:    4770        pG      BX       lr
    i.WDT_Feed
    WDT_Feed
        0x00002900:    6881        .h      LDR      r1,[r0,#8]
        0x00002902:    07c9        ..      LSLS     r1,r1,#31
        0x00002904:    0fc9        ..      LSRS     r1,r1,#31
        0x00002906:    2900        .)      CMP      r1,#0
        0x00002908:    d001        ..      BEQ      0x290e ; WDT_Feed + 14
        0x0000290a:    2155        U!      MOVS     r1,#0x55
        0x0000290c:    6101        .a      STR      r1,[r0,#0x10]
        0x0000290e:    4770        pG      BX       lr
    i.WDT_Init
    WDT_Init
        0x00002910:    b530        0.      PUSH     {r4,r5,lr}
        0x00002912:    2301        .#      MOVS     r3,#1
        0x00002914:    079b        ..      LSLS     r3,r3,#30
        0x00002916:    689b        .h      LDR      r3,[r3,#8]
        0x00002918:    2401        .$      MOVS     r4,#1
        0x0000291a:    02a4        ..      LSLS     r4,r4,#10
        0x0000291c:    4323        #C      ORRS     r3,r3,r4
        0x0000291e:    0524        $.      LSLS     r4,r4,#20
        0x00002920:    60a3        .`      STR      r3,[r4,#8]
        0x00002922:    2900        .)      CMP      r1,#0
        0x00002924:    d10a        ..      BNE      0x293c ; WDT_Init + 44
        0x00002926:    6883        .h      LDR      r3,[r0,#8]
        0x00002928:    2404        .$      MOVS     r4,#4
        0x0000292a:    43a3        .C      BICS     r3,r3,r4
        0x0000292c:    6083        .`      STR      r3,[r0,#8]
        0x0000292e:    230b        .#      MOVS     r3,#0xb
        0x00002930:    2401        .$      MOVS     r4,#1
        0x00002932:    409c        .@      LSLS     r4,r4,r3
        0x00002934:    4d10        .M      LDR      r5,[pc,#64] ; [0x2978] = 0xe000e180
        0x00002936:    602c        ,`      STR      r4,[r5,#0]
        0x00002938:    bf00        ..      NOP      
        0x0000293a:    e00e        ..      B        0x295a ; WDT_Init + 74
        0x0000293c:    6883        .h      LDR      r3,[r0,#8]
        0x0000293e:    2404        .$      MOVS     r4,#4
        0x00002940:    4323        #C      ORRS     r3,r3,r4
        0x00002942:    6083        .`      STR      r3,[r0,#8]
        0x00002944:    6041        A`      STR      r1,[r0,#4]
        0x00002946:    2301        .#      MOVS     r3,#1
        0x00002948:    60c3        .`      STR      r3,[r0,#0xc]
        0x0000294a:    230b        .#      MOVS     r3,#0xb
        0x0000294c:    2401        .$      MOVS     r4,#1
        0x0000294e:    409c        .@      LSLS     r4,r4,r3
        0x00002950:    4d09        .M      LDR      r5,[pc,#36] ; [0x2978] = 0xe000e180
        0x00002952:    3d80        .=      SUBS     r5,r5,#0x80
        0x00002954:    602c        ,`      STR      r4,[r5,#0]
        0x00002956:    bf00        ..      NOP      
        0x00002958:    bf00        ..      NOP      
        0x0000295a:    2a00        .*      CMP      r2,#0
        0x0000295c:    d105        ..      BNE      0x296a ; WDT_Init + 90
        0x0000295e:    6883        .h      LDR      r3,[r0,#8]
        0x00002960:    2402        .$      MOVS     r4,#2
        0x00002962:    43a3        .C      BICS     r3,r3,r4
        0x00002964:    6083        .`      STR      r3,[r0,#8]
        0x00002966:    6001        .`      STR      r1,[r0,#0]
        0x00002968:    e004        ..      B        0x2974 ; WDT_Init + 100
        0x0000296a:    6883        .h      LDR      r3,[r0,#8]
        0x0000296c:    2402        .$      MOVS     r4,#2
        0x0000296e:    4323        #C      ORRS     r3,r3,r4
        0x00002970:    6083        .`      STR      r3,[r0,#8]
        0x00002972:    6002        .`      STR      r2,[r0,#0]
        0x00002974:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x00002976:    0000        ..      DCW    0
        0x00002978:    e000e180    ....    DCD    3758154112
    $t
    i.WDT_Start
    WDT_Start
        0x0000297c:    6881        .h      LDR      r1,[r0,#8]
        0x0000297e:    2201        ."      MOVS     r2,#1
        0x00002980:    4311        .C      ORRS     r1,r1,r2
        0x00002982:    6081        .`      STR      r1,[r0,#8]
        0x00002984:    4770        pG      BX       lr
    i.__ARM_common_switch8
    __ARM_common_switch8
        0x00002986:    b430        0.      PUSH     {r4,r5}
        0x00002988:    4674        tF      MOV      r4,lr
        0x0000298a:    1e64        d.      SUBS     r4,r4,#1
        0x0000298c:    7825        %x      LDRB     r5,[r4,#0]
        0x0000298e:    1c64        d.      ADDS     r4,r4,#1
        0x00002990:    42ab        .B      CMP      r3,r5
        0x00002992:    d304        ..      BCC      0x299e ; __ARM_common_switch8 + 24
        0x00002994:    5d63        c]      LDRB     r3,[r4,r5]
        0x00002996:    005b        [.      LSLS     r3,r3,#1
        0x00002998:    18e3        ..      ADDS     r3,r4,r3
        0x0000299a:    bc30        0.      POP      {r4,r5}
        0x0000299c:    4718        .G      BX       r3
        0x0000299e:    461d        .F      MOV      r5,r3
        0x000029a0:    e7f8        ..      B        0x2994 ; __ARM_common_switch8 + 14
        0x000029a2:    0000        ..      MOVS     r0,r0
    i.fputc
    fputc
        0x000029a4:    b570        p.      PUSH     {r4-r6,lr}
        0x000029a6:    4604        .F      MOV      r4,r0
        0x000029a8:    460d        .F      MOV      r5,r1
        0x000029aa:    b2e1        ..      UXTB     r1,r4
        0x000029ac:    4805        .H      LDR      r0,[pc,#20] ; [0x29c4] = 0x40042000
        0x000029ae:    f7ffffa5    ....    BL       UART_WriteByte ; 0x28fc
        0x000029b2:    bf00        ..      NOP      
        0x000029b4:    4803        .H      LDR      r0,[pc,#12] ; [0x29c4] = 0x40042000
        0x000029b6:    f7ffff83    ....    BL       UART_IsTXBusy ; 0x28c0
        0x000029ba:    2800        .(      CMP      r0,#0
        0x000029bc:    d1fa        ..      BNE      0x29b4 ; fputc + 16
        0x000029be:    4620         F      MOV      r0,r4
        0x000029c0:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000029c2:    0000        ..      DCW    0
        0x000029c4:    40042000    . .@    DCD    1074012160
    $t
    i.main
    main
        0x000029c8:    b51c        ..      PUSH     {r2-r4,lr}
        0x000029ca:    2400        .$      MOVS     r4,#0
        0x000029cc:    f7fffcc2    ....    BL       SystemInit ; 0x2354
        0x000029d0:    f7fffb3a    ..:.    BL       SerialInit ; 0x2048
        0x000029d4:    2000        .       MOVS     r0,#0
        0x000029d6:    9000        ..      STR      r0,[sp,#0]
        0x000029d8:    4603        .F      MOV      r3,r0
        0x000029da:    2201        ."      MOVS     r2,#1
        0x000029dc:    2107        .!      MOVS     r1,#7
        0x000029de:    9001        ..      STR      r0,[sp,#4]
        0x000029e0:    4817        .H      LDR      r0,[pc,#92] ; [0x2a40] = 0x40040000
        0x000029e2:    f7fefb3f    ..?.    BL       GPIO_Init ; 0x1064
        0x000029e6:    a017        ..      ADR      r0,{pc}+0x5e ; 0x2a44
        0x000029e8:    f7fdfdb2    ....    BL       __2printf ; 0x550
        0x000029ec:    2107        .!      MOVS     r1,#7
        0x000029ee:    4814        .H      LDR      r0,[pc,#80] ; [0x2a40] = 0x40040000
        0x000029f0:    f7fefbd0    ....    BL       GPIO_SetBit ; 0x1194
        0x000029f4:    f7feff2e    ....    BL       STL_InitRunTimeChecks ; 0x1854
        0x000029f8:    2107        .!      MOVS     r1,#7
        0x000029fa:    4811        .H      LDR      r0,[pc,#68] ; [0x2a40] = 0x40040000
        0x000029fc:    f7fefb2a    ..*.    BL       GPIO_ClrBit ; 0x1054
        0x00002a00:    e01c        ..      B        0x2a3c ; main + 116
        0x00002a02:    1c61        a.      ADDS     r1,r4,#1
        0x00002a04:    460c        .F      MOV      r4,r1
        0x00002a06:    4608        .F      MOV      r0,r1
        0x00002a08:    4914        .I      LDR      r1,[pc,#80] ; [0x2a5c] = 0x2710
        0x00002a0a:    f7fdfdaf    ....    BL       __aeabi_uidiv ; 0x56c
        0x00002a0e:    2900        .)      CMP      r1,#0
        0x00002a10:    d102        ..      BNE      0x2a18 ; main + 80
        0x00002a12:    a013        ..      ADR      r0,{pc}+0x4e ; 0x2a60
        0x00002a14:    f7fdfd9c    ....    BL       __2printf ; 0x550
        0x00002a18:    4815        .H      LDR      r0,[pc,#84] ; [0x2a70] = 0x2000005c
        0x00002a1a:    6800        .h      LDR      r0,[r0,#0]
        0x00002a1c:    4915        .I      LDR      r1,[pc,#84] ; [0x2a74] = 0xaaaaaaaa
        0x00002a1e:    4288        .B      CMP      r0,r1
        0x00002a20:    d10c        ..      BNE      0x2a3c ; main + 116
        0x00002a22:    f7fefd65    ..e.    BL       STL_DoRunTimeChecks ; 0x14f0
        0x00002a26:    a014        ..      ADR      r0,{pc}+0x52 ; 0x2a78
        0x00002a28:    f7fdfd92    ....    BL       __2printf ; 0x550
        0x00002a2c:    2000        .       MOVS     r0,#0
