Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00002a2e:    4910        .I      LDR      r1,[pc,#64] ; [0x2a70] = 0x2000005c
        0x00002a30:    6008        .`      STR      r0,[r1,#0]
        0x00002a32:    4608        .F      MOV      r0,r1
        0x00002a34:    6800        .h      LDR      r0,[r0,#0]
        0x00002a36:    43c0        .C      MVNS     r0,r0
        0x00002a38:    4914        .I      LDR      r1,[pc,#80] ; [0x2a8c] = 0x2000009c
        0x00002a3a:    6008        .`      STR      r0,[r1,#0]
        0x00002a3c:    e7e1        ..      B        0x2a02 ; main + 58
    $d
        0x00002a3e:    0000        ..      DCW    0
        0x00002a40:    40040000    ...@    DCD    1074003968
        0x00002a44:    49200a0d    .. I    DCD    1226836493
        0x00002a48:    30364345    EC60    DCD    808862533
        0x00002a4c:    20353333    335     DCD    540357427
        0x00002a50:    74736574    test    DCD    1953719668
        0x00002a54:    0a0d2020      ..    DCD    168632352
        0x00002a58:    00000000    ....    DCD    0
        0x00002a5c:    00002710    .'..    DCD    10000
        0x00002a60:    73206f44    Do s    DCD    1931505476
        0x00002a64:    74656d6f    omet    DCD    1952804207
        0x00002a68:    676e6968    hing    DCD    1735289192
        0x00002a6c:    000a0d2e    ....    DCD    658734
        0x00002a70:    2000005c    \..     DCD    536871004
        0x00002a74:    aaaaaaaa    ....    DCD    2863311530
        0x00002a78:    206e7572    run     DCD    544109938
        0x00002a7c:    656d6974    time    DCD    1701669236
        0x00002a80:    73657420     tes    DCD    1936028704
        0x00002a84:    0d2e7374    ts..    DCD    221148020
        0x00002a88:    0000000a    ....    DCD    10
        0x00002a8c:    2000009c    ...     DCD    536871068
    $t
    i.switchTo24MHz
    switchTo24MHz
        0x00002a90:    2001        .       MOVS     r0,#1
        0x00002a92:    4904        .I      LDR      r1,[pc,#16] ; [0x2aa4] = 0x400aa000
        0x00002a94:    6008        .`      STR      r0,[r1,#0]
        0x00002a96:    0780        ..      LSLS     r0,r0,#30
        0x00002a98:    6800        .h      LDR      r0,[r0,#0]
        0x00002a9a:    2101        .!      MOVS     r1,#1
        0x00002a9c:    4308        .C      ORRS     r0,r0,r1
        0x00002a9e:    0789        ..      LSLS     r1,r1,#30
        0x00002aa0:    6008        .`      STR      r0,[r1,#0]
        0x00002aa2:    4770        pG      BX       lr
    $d
        0x00002aa4:    400aa000    ...@    DCD    1074438144
    $t
    i.switchTo32KHz
    switchTo32KHz
        0x00002aa8:    b500        ..      PUSH     {lr}
        0x00002aaa:    f7fffff1    ....    BL       switchTo24MHz ; 0x2a90
        0x00002aae:    2001        .       MOVS     r0,#1
        0x00002ab0:    490c        .I      LDR      r1,[pc,#48] ; [0x2ae4] = 0x400aa040
        0x00002ab2:    6108        .a      STR      r0,[r1,#0x10]
        0x00002ab4:    0781        ..      LSLS     r1,r0,#30
        0x00002ab6:    6048        H`      STR      r0,[r1,#4]
        0x00002ab8:    0780        ..      LSLS     r0,r0,#30
        0x00002aba:    6800        .h      LDR      r0,[r0,#0]
        0x00002abc:    211c        .!      MOVS     r1,#0x1c
        0x00002abe:    4388        .C      BICS     r0,r0,r1
        0x00002ac0:    2101        .!      MOVS     r1,#1
        0x00002ac2:    0789        ..      LSLS     r1,r1,#30
        0x00002ac4:    6008        .`      STR      r0,[r1,#0]
        0x00002ac6:    4608        .F      MOV      r0,r1
        0x00002ac8:    6800        .h      LDR      r0,[r0,#0]
        0x00002aca:    6008        .`      STR      r0,[r1,#0]
        0x00002acc:    4608        .F      MOV      r0,r1
        0x00002ace:    6800        .h      LDR      r0,[r0,#0]
        0x00002ad0:    2102        .!      MOVS     r1,#2
        0x00002ad2:    4388        .C      BICS     r0,r0,r1
        0x00002ad4:    0749        I.      LSLS     r1,r1,#29
        0x00002ad6:    6008        .`      STR      r0,[r1,#0]
        0x00002ad8:    4608        .F      MOV      r0,r1
        0x00002ada:    6800        .h      LDR      r0,[r0,#0]
        0x00002adc:    0840        @.      LSRS     r0,r0,#1
        0x00002ade:    0040        @.      LSLS     r0,r0,#1
        0x00002ae0:    6008        .`      STR      r0,[r1,#0]
        0x00002ae2:    bd00        ..      POP      {pc}
    $d
        0x00002ae4:    400aa040    @..@    DCD    1074438208
    $t
    i.switchTo3MHz
    switchTo3MHz
        0x00002ae8:    b500        ..      PUSH     {lr}
        0x00002aea:    f7ffffd1    ....    BL       switchTo24MHz ; 0x2a90
        0x00002aee:    2001        .       MOVS     r0,#1
        0x00002af0:    0781        ..      LSLS     r1,r0,#30
        0x00002af2:    6048        H`      STR      r0,[r1,#4]
        0x00002af4:    0780        ..      LSLS     r0,r0,#30
        0x00002af6:    6800        .h      LDR      r0,[r0,#0]
        0x00002af8:    211c        .!      MOVS     r1,#0x1c
        0x00002afa:    4388        .C      BICS     r0,r0,r1
        0x00002afc:    2101        .!      MOVS     r1,#1
        0x00002afe:    0789        ..      LSLS     r1,r1,#30
        0x00002b00:    6008        .`      STR      r0,[r1,#0]
        0x00002b02:    4608        .F      MOV      r0,r1
        0x00002b04:    6800        .h      LDR      r0,[r0,#0]
        0x00002b06:    2110        .!      MOVS     r1,#0x10
        0x00002b08:    4308        .C      ORRS     r0,r0,r1
        0x00002b0a:    0689        ..      LSLS     r1,r1,#26
        0x00002b0c:    6008        .`      STR      r0,[r1,#0]
        0x00002b0e:    4608        .F      MOV      r0,r1
        0x00002b10:    6800        .h      LDR      r0,[r0,#0]
        0x00002b12:    2102        .!      MOVS     r1,#2
        0x00002b14:    4308        .C      ORRS     r0,r0,r1
        0x00002b16:    0749        I.      LSLS     r1,r1,#29
        0x00002b18:    6008        .`      STR      r0,[r1,#0]
        0x00002b1a:    4608        .F      MOV      r0,r1
        0x00002b1c:    6800        .h      LDR      r0,[r0,#0]
        0x00002b1e:    0840        @.      LSRS     r0,r0,#1
        0x00002b20:    0040        @.      LSLS     r0,r0,#1
        0x00002b22:    6008        .`      STR      r0,[r1,#0]
        0x00002b24:    bd00        ..      POP      {pc}
        0x00002b26:    0000        ..      MOVS     r0,r0
    i.switchTo48MHz
    switchTo48MHz
        0x00002b28:    2003        .       MOVS     r0,#3
        0x00002b2a:    4904        .I      LDR      r1,[pc,#16] ; [0x2b3c] = 0x400aa000
        0x00002b2c:    6008        .`      STR      r0,[r1,#0]
        0x00002b2e:    0448        H.      LSLS     r0,r1,#17
        0x00002b30:    6800        .h      LDR      r0,[r0,#0]
        0x00002b32:    2101        .!      MOVS     r1,#1
        0x00002b34:    4308        .C      ORRS     r0,r0,r1
        0x00002b36:    0789        ..      LSLS     r1,r1,#30
        0x00002b38:    6008        .`      STR      r0,[r1,#0]
        0x00002b3a:    4770        pG      BX       lr
    $d
        0x00002b3c:    400aa000    ...@    DCD    1074438144
    $t
    i.switchTo6MHz
    switchTo6MHz
        0x00002b40:    b500        ..      PUSH     {lr}
        0x00002b42:    f7fffff1    ....    BL       switchTo48MHz ; 0x2b28
        0x00002b46:    2001        .       MOVS     r0,#1
        0x00002b48:    0781        ..      LSLS     r1,r0,#30
        0x00002b4a:    6048        H`      STR      r0,[r1,#4]
        0x00002b4c:    0780        ..      LSLS     r0,r0,#30
        0x00002b4e:    6800        .h      LDR      r0,[r0,#0]
        0x00002b50:    211c        .!      MOVS     r1,#0x1c
        0x00002b52:    4388        .C      BICS     r0,r0,r1
        0x00002b54:    2101        .!      MOVS     r1,#1
        0x00002b56:    0789        ..      LSLS     r1,r1,#30
        0x00002b58:    6008        .`      STR      r0,[r1,#0]
        0x00002b5a:    4608        .F      MOV      r0,r1
        0x00002b5c:    6800        .h      LDR      r0,[r0,#0]
        0x00002b5e:    2110        .!      MOVS     r1,#0x10
        0x00002b60:    4308        .C      ORRS     r0,r0,r1
        0x00002b62:    0689        ..      LSLS     r1,r1,#26
        0x00002b64:    6008        .`      STR      r0,[r1,#0]
        0x00002b66:    4608        .F      MOV      r0,r1
        0x00002b68:    6800        .h      LDR      r0,[r0,#0]
        0x00002b6a:    2102        .!      MOVS     r1,#2
        0x00002b6c:    4308        .C      ORRS     r0,r0,r1
        0x00002b6e:    0749        I.      LSLS     r1,r1,#29
        0x00002b70:    6008        .`      STR      r0,[r1,#0]
        0x00002b72:    4608        .F      MOV      r0,r1
        0x00002b74:    6800        .h      LDR      r0,[r0,#0]
        0x00002b76:    0840        @.      LSRS     r0,r0,#1
        0x00002b78:    0040        @.      LSLS     r0,r0,#1
        0x00002b7a:    6008        .`      STR      r0,[r1,#0]
        0x00002b7c:    bd00        ..      POP      {pc}
    i.switchToPLL
    switchToPLL
        0x00002b7e:    b500        ..      PUSH     {lr}
        0x00002b80:    4602        .F      MOV      r2,r0
        0x00002b82:    f7ffff85    ....    BL       switchTo24MHz ; 0x2a90
        0x00002b86:    f7fefb2b    ..+.    BL       PLLInit ; 0x11e0
        0x00002b8a:    2001        .       MOVS     r0,#1
        0x00002b8c:    0781        ..      LSLS     r1,r0,#30
        0x00002b8e:    6048        H`      STR      r0,[r1,#4]
        0x00002b90:    0780        ..      LSLS     r0,r0,#30
        0x00002b92:    6800        .h      LDR      r0,[r0,#0]
        0x00002b94:    211c        .!      MOVS     r1,#0x1c
        0x00002b96:    4388        .C      BICS     r0,r0,r1
        0x00002b98:    2101        .!      MOVS     r1,#1
        0x00002b9a:    0789        ..      LSLS     r1,r1,#30
        0x00002b9c:    6008        .`      STR      r0,[r1,#0]
        0x00002b9e:    4608        .F      MOV      r0,r1
        0x00002ba0:    6800        .h      LDR      r0,[r0,#0]
        0x00002ba2:    2104        .!      MOVS     r1,#4
        0x00002ba4:    4308        .C      ORRS     r0,r0,r1
        0x00002ba6:    0709        ..      LSLS     r1,r1,#28
        0x00002ba8:    6008        .`      STR      r0,[r1,#0]
        0x00002baa:    2a00        .*      CMP      r2,#0
        0x00002bac:    d006        ..      BEQ      0x2bbc ; switchToPLL + 62
        0x00002bae:    4608        .F      MOV      r0,r1
        0x00002bb0:    6800        .h      LDR      r0,[r0,#0]
        0x00002bb2:    2102        .!      MOVS     r1,#2
        0x00002bb4:    4308        .C      ORRS     r0,r0,r1
        0x00002bb6:    0749        I.      LSLS     r1,r1,#29
        0x00002bb8:    6008        .`      STR      r0,[r1,#0]
        0x00002bba:    e006        ..      B        0x2bca ; switchToPLL + 76
        0x00002bbc:    2001        .       MOVS     r0,#1
        0x00002bbe:    0780        ..      LSLS     r0,r0,#30
        0x00002bc0:    6800        .h      LDR      r0,[r0,#0]
        0x00002bc2:    2102        .!      MOVS     r1,#2
        0x00002bc4:    4388        .C      BICS     r0,r0,r1
        0x00002bc6:    0749        I.      LSLS     r1,r1,#29
        0x00002bc8:    6008        .`      STR      r0,[r1,#0]
        0x00002bca:    2001        .       MOVS     r0,#1
        0x00002bcc:    0780        ..      LSLS     r0,r0,#30
        0x00002bce:    6800        .h      LDR      r0,[r0,#0]
        0x00002bd0:    0840        @.      LSRS     r0,r0,#1
        0x00002bd2:    0040        @.      LSLS     r0,r0,#1
        0x00002bd4:    2101        .!      MOVS     r1,#1
        0x00002bd6:    0789        ..      LSLS     r1,r1,#30
        0x00002bd8:    6008        .`      STR      r0,[r1,#0]
        0x00002bda:    bd00        ..      POP      {pc}
    i.switchToXTAL
    switchToXTAL
        0x00002bdc:    b570        p.      PUSH     {r4-r6,lr}
        0x00002bde:    4604        .F      MOV      r4,r0
        0x00002be0:    f7ffff56    ..V.    BL       switchTo24MHz ; 0x2a90
        0x00002be4:    2300        .#      MOVS     r3,#0
        0x00002be6:    2207        ."      MOVS     r2,#7
        0x00002be8:    2101        .!      MOVS     r1,#1
        0x00002bea:    4820         H      LDR      r0,[pc,#128] ; [0x2c6c] = 0x400a0010
        0x00002bec:    f7fefb2e    ....    BL       PORT_Init ; 0x124c
        0x00002bf0:    2300        .#      MOVS     r3,#0
        0x00002bf2:    2207        ."      MOVS     r2,#7
        0x00002bf4:    2102        .!      MOVS     r1,#2
        0x00002bf6:    481d        .H      LDR      r0,[pc,#116] ; [0x2c6c] = 0x400a0010
        0x00002bf8:    f7fefb28    ..(.    BL       PORT_Init ; 0x124c
        0x00002bfc:    481c        .H      LDR      r0,[pc,#112] ; [0x2c70] = 0x400aa000
        0x00002bfe:    6a00        .j      LDR      r0,[r0,#0x20]
        0x00002c00:    491c        .I      LDR      r1,[pc,#112] ; [0x2c74] = 0x70002
        0x00002c02:    4308        .C      ORRS     r0,r0,r1
        0x00002c04:    491a        .I      LDR      r1,[pc,#104] ; [0x2c70] = 0x400aa000
        0x00002c06:    6208        .b      STR      r0,[r1,#0x20]
        0x00002c08:    2500        .%      MOVS     r5,#0
        0x00002c0a:    e001        ..      B        0x2c10 ; switchToXTAL + 52
        0x00002c0c:    bf00        ..      NOP      
        0x00002c0e:    1c6d        m.      ADDS     r5,r5,#1
        0x00002c10:    207d        }       MOVS     r0,#0x7d
        0x00002c12:    00c0        ..      LSLS     r0,r0,#3
        0x00002c14:    4285        .B      CMP      r5,r0
        0x00002c16:    d3f9        ..      BCC      0x2c0c ; switchToXTAL + 48
        0x00002c18:    2001        .       MOVS     r0,#1
        0x00002c1a:    0781        ..      LSLS     r1,r0,#30
        0x00002c1c:    6048        H`      STR      r0,[r1,#4]
        0x00002c1e:    0780        ..      LSLS     r0,r0,#30
        0x00002c20:    6800        .h      LDR      r0,[r0,#0]
        0x00002c22:    211c        .!      MOVS     r1,#0x1c
        0x00002c24:    4388        .C      BICS     r0,r0,r1
        0x00002c26:    2101        .!      MOVS     r1,#1
        0x00002c28:    0789        ..      LSLS     r1,r1,#30
        0x00002c2a:    6008        .`      STR      r0,[r1,#0]
        0x00002c2c:    4608        .F      MOV      r0,r1
        0x00002c2e:    6800        .h      LDR      r0,[r0,#0]
        0x00002c30:    210c        .!      MOVS     r1,#0xc
        0x00002c32:    4308        .C      ORRS     r0,r0,r1
        0x00002c34:    2101        .!      MOVS     r1,#1
        0x00002c36:    0789        ..      LSLS     r1,r1,#30
        0x00002c38:    6008        .`      STR      r0,[r1,#0]
        0x00002c3a:    2c00        .,      CMP      r4,#0
        0x00002c3c:    d006        ..      BEQ      0x2c4c ; switchToXTAL + 112
        0x00002c3e:    4608        .F      MOV      r0,r1
        0x00002c40:    6800        .h      LDR      r0,[r0,#0]
        0x00002c42:    2102        .!      MOVS     r1,#2
        0x00002c44:    4308        .C      ORRS     r0,r0,r1
        0x00002c46:    0749        I.      LSLS     r1,r1,#29
        0x00002c48:    6008        .`      STR      r0,[r1,#0]
        0x00002c4a:    e006        ..      B        0x2c5a ; switchToXTAL + 126
        0x00002c4c:    2001        .       MOVS     r0,#1
        0x00002c4e:    0780        ..      LSLS     r0,r0,#30
        0x00002c50:    6800        .h      LDR      r0,[r0,#0]
        0x00002c52:    2102        .!      MOVS     r1,#2
        0x00002c54:    4388        .C      BICS     r0,r0,r1
        0x00002c56:    0749        I.      LSLS     r1,r1,#29
        0x00002c58:    6008        .`      STR      r0,[r1,#0]
        0x00002c5a:    2001        .       MOVS     r0,#1
        0x00002c5c:    0780        ..      LSLS     r0,r0,#30
        0x00002c5e:    6800        .h      LDR      r0,[r0,#0]
        0x00002c60:    0840        @.      LSRS     r0,r0,#1
        0x00002c62:    0040        @.      LSLS     r0,r0,#1
        0x00002c64:    2101        .!      MOVS     r1,#1
        0x00002c66:    0789        ..      LSLS     r1,r1,#30
        0x00002c68:    6008        .`      STR      r0,[r1,#0]
        0x00002c6a:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00002c6c:    400a0010    ...@    DCD    1074397200
        0x00002c70:    400aa000    ...@    DCD    1074438144
        0x00002c74:    00070002    ....    DCD    458754
    $t
    i.switchToXTAL_32K
    switchToXTAL_32K
        0x00002c78:    b500        ..      PUSH     {lr}
        0x00002c7a:    f7ffff09    ....    BL       switchTo24MHz ; 0x2a90
        0x00002c7e:    4815        .H      LDR      r0,[pc,#84] ; [0x2cd4] = 0x400aa000
        0x00002c80:    6a00        .j      LDR      r0,[r0,#0x20]
        0x00002c82:    21ff        .!      MOVS     r1,#0xff
        0x00002c84:    3102        .1      ADDS     r1,#2
        0x00002c86:    4308        .C      ORRS     r0,r0,r1
        0x00002c88:    4912        .I      LDR      r1,[pc,#72] ; [0x2cd4] = 0x400aa000
        0x00002c8a:    6208        .b      STR      r0,[r1,#0x20]
        0x00002c8c:    2200        ."      MOVS     r2,#0
        0x00002c8e:    e001        ..      B        0x2c94 ; switchToXTAL_32K + 28
        0x00002c90:    bf00        ..      NOP      
        0x00002c92:    1c52        R.      ADDS     r2,r2,#1
        0x00002c94:    207d        }       MOVS     r0,#0x7d
        0x00002c96:    00c0        ..      LSLS     r0,r0,#3
        0x00002c98:    4282        .B      CMP      r2,r0
        0x00002c9a:    d3f9        ..      BCC      0x2c90 ; switchToXTAL_32K + 24
        0x00002c9c:    2001        .       MOVS     r0,#1
        0x00002c9e:    0781        ..      LSLS     r1,r0,#30
        0x00002ca0:    6048        H`      STR      r0,[r1,#4]
        0x00002ca2:    0780        ..      LSLS     r0,r0,#30
        0x00002ca4:    6800        .h      LDR      r0,[r0,#0]
        0x00002ca6:    211c        .!      MOVS     r1,#0x1c
        0x00002ca8:    4388        .C      BICS     r0,r0,r1
        0x00002caa:    2101        .!      MOVS     r1,#1
        0x00002cac:    0789        ..      LSLS     r1,r1,#30
        0x00002cae:    6008        .`      STR      r0,[r1,#0]
        0x00002cb0:    4608        .F      MOV      r0,r1
        0x00002cb2:    6800        .h      LDR      r0,[r0,#0]
        0x00002cb4:    2108        .!      MOVS     r1,#8
        0x00002cb6:    4308        .C      ORRS     r0,r0,r1
        0x00002cb8:    06c9        ..      LSLS     r1,r1,#27
        0x00002cba:    6008        .`      STR      r0,[r1,#0]
        0x00002cbc:    4608        .F      MOV      r0,r1
        0x00002cbe:    6800        .h      LDR      r0,[r0,#0]
        0x00002cc0:    2102        .!      MOVS     r1,#2
        0x00002cc2:    4388        .C      BICS     r0,r0,r1
        0x00002cc4:    0749        I.      LSLS     r1,r1,#29
        0x00002cc6:    6008        .`      STR      r0,[r1,#0]
        0x00002cc8:    4608        .F      MOV      r0,r1
        0x00002cca:    6800        .h      LDR      r0,[r0,#0]
        0x00002ccc:    0840        @.      LSRS     r0,r0,#1
        0x00002cce:    0040        @.      LSLS     r0,r0,#1
        0x00002cd0:    6008        .`      STR      r0,[r1,#0]
        0x00002cd2:    bd00        ..      POP      {pc}
    $d
        0x00002cd4:    400aa000    ...@    DCD    1074438144
    $d.realdata
    .constdata
    table
        0x00002cd8:    00000000    ....    DCD    0
        0x00002cdc:    77073096    .0.w    DCD    1996959894
        0x00002ce0:    ee0e612c    ,a..    DCD    3993919788
        0x00002ce4:    990951ba    .Q..    DCD    2567524794
        0x00002ce8:    076dc419    ..m.    DCD    124634137
        0x00002cec:    706af48f    ..jp    DCD    1886057615
        0x00002cf0:    e963a535    5.c.    DCD    3915621685
        0x00002cf4:    9e6495a3    ..d.    DCD    2657392035
        0x00002cf8:    0edb8832    2...    DCD    249268274
        0x00002cfc:    79dcb8a4    ...y    DCD    2044508324
        0x00002d00:    e0d5e91e    ....    DCD    3772115230
        0x00002d04:    97d2d988    ....    DCD    2547177864
        0x00002d08:    09b64c2b    +L..    DCD    162941995
        0x00002d0c:    7eb17cbd    .|.~    DCD    2125561021
        0x00002d10:    e7b82d07    .-..    DCD    3887607047
        0x00002d14:    90bf1d91    ....    DCD    2428444049
        0x00002d18:    1db71064    d...    DCD    498536548
        0x00002d1c:    6ab020f2    . .j    DCD    1789927666
        0x00002d20:    f3b97148    Hq..    DCD    4089016648
        0x00002d24:    84be41de    .A..    DCD    2227061214
        0x00002d28:    1adad47d    }...    DCD    450548861
        0x00002d2c:    6ddde4eb    ...m    DCD    1843258603
        0x00002d30:    f4d4b551    Q...    DCD    4107580753
        0x00002d34:    83d385c7    ....    DCD    2211677639
        0x00002d38:    136c9856    V.l.    DCD    325883990
        0x00002d3c:    646ba8c0    ..kd    DCD    1684777152
        0x00002d40:    fd62f97a    z.b.    DCD    4251122042
        0x00002d44:    8a65c9ec    ..e.    DCD    2321926636
        0x00002d48:    14015c4f    O\..    DCD    335633487
        0x00002d4c:    63066cd9    .l.c    DCD    1661365465
        0x00002d50:    fa0f3d63    c=..    DCD    4195302755
        0x00002d54:    8d080df5    ....    DCD    2366115317
        0x00002d58:    3b6e20c8    . n;    DCD    997073096
        0x00002d5c:    4c69105e    ^.iL    DCD    1281953886
        0x00002d60:    d56041e4    .A`.    DCD    3579855332
        0x00002d64:    a2677172    rqg.    DCD    2724688242
        0x00002d68:    3c03e4d1    ...<    DCD    1006888145
        0x00002d6c:    4b04d447    G..K    DCD    1258607687
        0x00002d70:    d20d85fd    ....    DCD    3524101629
        0x00002d74:    a50ab56b    k...    DCD    2768942443
        0x00002d78:    35b5a8fa    ...5    DCD    901097722
        0x00002d7c:    42b2986c    l..B    DCD    1119000684
        0x00002d80:    dbbbc9d6    ....    DCD    3686517206
        0x00002d84:    acbcf940    @...    DCD    2898065728
        0x00002d88:    32d86ce3    .l.2    DCD    853044451
        0x00002d8c:    45df5c75    u\.E    DCD    1172266101
        0x00002d90:    dcd60dcf    ....    DCD    3705015759
        0x00002d94:    abd13d59    Y=..    DCD    2882616665
        0x00002d98:    26d930ac    .0.&    DCD    651767980
        0x00002d9c:    51de003a    :..Q    DCD    1373503546
        0x00002da0:    c8d75180    .Q..    DCD    3369554304
        0x00002da4:    bfd06116    .a..    DCD    3218104598
        0x00002da8:    21b4f4b5    ...!    DCD    565507253
        0x00002dac:    56b3c423    #..V    DCD    1454621731
        0x00002db0:    cfba9599    ....    DCD    3485111705
        0x00002db4:    b8bda50f    ....    DCD    3099436303
        0x00002db8:    2802b89e    ...(    DCD    671266974
        0x00002dbc:    5f058808    ..._    DCD    1594198024
        0x00002dc0:    c60cd9b2    ....    DCD    3322730930
        0x00002dc4:    b10be924    $...    DCD    2970347812
        0x00002dc8:    2f6f7c87    .|o/    DCD    795835527
        0x00002dcc:    58684c11    .LhX    DCD    1483230225
        0x00002dd0:    c1611dab    ..a.    DCD    3244367275
        0x00002dd4:    b6662d3d    =-f.    DCD    3060149565
        0x00002dd8:    76dc4190    .A.v    DCD    1994146192
        0x00002ddc:    01db7106    .q..    DCD    31158534
        0x00002de0:    98d220bc    . ..    DCD    2563907772
        0x00002de4:    efd5102a    *...    DCD    4023717930
        0x00002de8:    71b18589    ...q    DCD    1907459465
        0x00002dec:    06b6b51f    ....    DCD    112637215
        0x00002df0:    9fbfe4a5    ....    DCD    2680153253
        0x00002df4:    e8b8d433    3...    DCD    3904427059
        0x00002df8:    7807c9a2    ...x    DCD    2013776290
        0x00002dfc:    0f00f934    4...    DCD    251722036
