Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
        0x00002e00:    9609a88e    ....    DCD    2517215374
        0x00002e04:    e10e9818    ....    DCD    3775830040
        0x00002e08:    7f6a0dbb    ..j.    DCD    2137656763
        0x00002e0c:    086d3d2d    -=m.    DCD    141376813
        0x00002e10:    91646c97    .ld.    DCD    2439277719
        0x00002e14:    e6635c01    .\c.    DCD    3865271297
        0x00002e18:    6b6b51f4    .Qkk    DCD    1802195444
        0x00002e1c:    1c6c6162    bal.    DCD    476864866
        0x00002e20:    856530d8    .0e.    DCD    2238001368
        0x00002e24:    f262004e    N.b.    DCD    4066508878
        0x00002e28:    6c0695ed    ...l    DCD    1812370925
        0x00002e2c:    1b01a57b    {...    DCD    453092731
        0x00002e30:    8208f4c1    ....    DCD    2181625025
        0x00002e34:    f50fc457    W...    DCD    4111451223
        0x00002e38:    65b0d9c6    ...e    DCD    1706088902
        0x00002e3c:    12b7e950    P...    DCD    314042704
        0x00002e40:    8bbeb8ea    ....    DCD    2344532202
        0x00002e44:    fcb9887c    |...    DCD    4240017532
        0x00002e48:    62dd1ddf    ...b    DCD    1658658271
        0x00002e4c:    15da2d49    I-..    DCD    366619977
        0x00002e50:    8cd37cf3    .|..    DCD    2362670323
        0x00002e54:    fbd44c65    eL..    DCD    4224994405
        0x00002e58:    4db26158    Xa.M    DCD    1303535960
        0x00002e5c:    3ab551ce    .Q.:    DCD    984961486
        0x00002e60:    a3bc0074    t...    DCD    2747007092
        0x00002e64:    d4bb30e2    .0..    DCD    3569037538
        0x00002e68:    4adfa541    A..J    DCD    1256170817
        0x00002e6c:    3dd895d7    ...=    DCD    1037604311
        0x00002e70:    a4d1c46d    m...    DCD    2765210733
        0x00002e74:    d3d6f4fb    ....    DCD    3554079995
        0x00002e78:    4369e96a    j.iC    DCD    1131014506
        0x00002e7c:    346ed9fc    ..n4    DCD    879679996
        0x00002e80:    ad678846    F.g.    DCD    2909243462
        0x00002e84:    da60b8d0    ..`.    DCD    3663771856
        0x00002e88:    44042d73    s-.D    DCD    1141124467
        0x00002e8c:    33031de5    ...3    DCD    855842277
        0x00002e90:    aa0a4c5f    _L..    DCD    2852801631
        0x00002e94:    dd0d7cc9    .|..    DCD    3708648649
        0x00002e98:    5005713c    <q.P    DCD    1342533948
        0x00002e9c:    270241aa    .A.'    DCD    654459306
        0x00002ea0:    be0b1010    ....    DCD    3188396048
        0x00002ea4:    c90c2086    . ..    DCD    3373015174
        0x00002ea8:    5768b525    %.hW    DCD    1466479909
        0x00002eac:    206f85b3    ..o     DCD    544179635
        0x00002eb0:    b966d409    ..f.    DCD    3110523913
        0x00002eb4:    ce61e49f    ..a.    DCD    3462522015
        0x00002eb8:    5edef90e    ...^    DCD    1591671054
        0x00002ebc:    29d9c998    ...)    DCD    702138776
        0x00002ec0:    b0d09822    "...    DCD    2966460450
        0x00002ec4:    c7d7a8b4    ....    DCD    3352799412
        0x00002ec8:    59b33d17    .=.Y    DCD    1504918807
        0x00002ecc:    2eb40d81    ....    DCD    783551873
        0x00002ed0:    b7bd5c3b    ;\..    DCD    3082640443
        0x00002ed4:    c0ba6cad    .l..    DCD    3233442989
        0x00002ed8:    edb88320     ...    DCD    3988292384
        0x00002edc:    9abfb3b6    ....    DCD    2596254646
        0x00002ee0:    03b6e20c    ....    DCD    62317068
        0x00002ee4:    74b1d29a    ...t    DCD    1957810842
        0x00002ee8:    ead54739    9G..    DCD    3939845945
        0x00002eec:    9dd277af    .w..    DCD    2647816111
        0x00002ef0:    04db2615    .&..    DCD    81470997
        0x00002ef4:    73dc1683    ...s    DCD    1943803523
        0x00002ef8:    e3630b12    ..c.    DCD    3814918930
        0x00002efc:    94643b84    .;d.    DCD    2489596804
        0x00002f00:    0d6d6a3e    >jm.    DCD    225274430
        0x00002f04:    7a6a5aa8    .Zjz    DCD    2053790376
        0x00002f08:    e40ecf0b    ....    DCD    3826175755
        0x00002f0c:    9309ff9d    ....    DCD    2466906013
        0x00002f10:    0a00ae27    '...    DCD    167816743
        0x00002f14:    7d079eb1    ...}    DCD    2097651377
        0x00002f18:    f00f9344    D...    DCD    4027552580
        0x00002f1c:    8708a3d2    ....    DCD    2265490386
        0x00002f20:    1e01f268    h...    DCD    503444072
        0x00002f24:    6906c2fe    ...i    DCD    1762050814
        0x00002f28:    f762575d    ]Wb.    DCD    4150417245
        0x00002f2c:    806567cb    .ge.    DCD    2154129355
        0x00002f30:    196c3671    q6l.    DCD    426522225
        0x00002f34:    6e6b06e7    ..kn    DCD    1852507879
        0x00002f38:    fed41b76    v...    DCD    4275313526
        0x00002f3c:    89d32be0    .+..    DCD    2312317920
        0x00002f40:    10da7a5a    Zz..    DCD    282753626
        0x00002f44:    67dd4acc    .J.g    DCD    1742555852
        0x00002f48:    f9b9df6f    o...    DCD    4189708143
        0x00002f4c:    8ebeeff9    ....    DCD    2394877945
        0x00002f50:    17b7be43    C...    DCD    397917763
        0x00002f54:    60b08ed5    ...`    DCD    1622183637
        0x00002f58:    d6d6a3e8    ....    DCD    3604390888
        0x00002f5c:    a1d1937e    ~...    DCD    2714866558
        0x00002f60:    38d8c2c4    ...8    DCD    953729732
        0x00002f64:    4fdff252    R..O    DCD    1340076626
        0x00002f68:    d1bb67f1    .g..    DCD    3518719985
        0x00002f6c:    a6bc5767    gW..    DCD    2797360999
        0x00002f70:    3fb506dd    ...?    DCD    1068828381
        0x00002f74:    48b2364b    K6.H    DCD    1219638859
        0x00002f78:    d80d2bda    .+..    DCD    3624741850
        0x00002f7c:    af0a1b4c    L...    DCD    2936675148
        0x00002f80:    36034af6    .J.6    DCD    906185462
        0x00002f84:    41047a60    `z.A    DCD    1090812512
        0x00002f88:    df60efc3    ..`.    DCD    3747672003
        0x00002f8c:    a867df55    U.g.    DCD    2825379669
        0x00002f90:    316e8eef    ..n1    DCD    829329135
        0x00002f94:    4669be79    y.iF    DCD    1181335161
        0x00002f98:    cb61b38c    ..a.    DCD    3412177804
        0x00002f9c:    bc66831a    ..f.    DCD    3160834842
        0x00002fa0:    256fd2a0    ..o%    DCD    628085408
        0x00002fa4:    5268e236    6.hR    DCD    1382605366
        0x00002fa8:    cc0c7795    .w..    DCD    3423369109
        0x00002fac:    bb0b4703    .G..    DCD    3138078467
        0x00002fb0:    220216b9    ..."    DCD    570562233
        0x00002fb4:    5505262f    /&.U    DCD    1426400815
        0x00002fb8:    c5ba3bbe    .;..    DCD    3317316542
        0x00002fbc:    b2bd0b28    (...    DCD    2998733608
        0x00002fc0:    2bb45a92    .Z.+    DCD    733239954
        0x00002fc4:    5cb36a04    .j.\    DCD    1555261956
        0x00002fc8:    c2d7ffa7    ....    DCD    3268935591
        0x00002fcc:    b5d0cf31    1...    DCD    3050360625
        0x00002fd0:    2cd99e8b    ...,    DCD    752459403
        0x00002fd4:    5bdeae1d    ...[    DCD    1541320221
        0x00002fd8:    9b64c2b0    ..d.    DCD    2607071920
        0x00002fdc:    ec63f226    &.c.    DCD    3965973030
        0x00002fe0:    756aa39c    ..ju    DCD    1969922972
        0x00002fe4:    026d930a    ..m.    DCD    40735498
        0x00002fe8:    9c0906a9    ....    DCD    2617837225
        0x00002fec:    eb0e363f    ?6..    DCD    3943577151
        0x00002ff0:    72076785    .g.r    DCD    1913087877
        0x00002ff4:    05005713    .W..    DCD    83908371
        0x00002ff8:    95bf4a82    .J..    DCD    2512341634
        0x00002ffc:    e2b87a14    .z..    DCD    3803740692
        0x00003000:    7bb12bae    .+.{    DCD    2075208622
        0x00003004:    0cb61b38    8...    DCD    213261112
        0x00003008:    92d28e9b    ....    DCD    2463272603
        0x0000300c:    e5d5be0d    ....    DCD    3855990285
        0x00003010:    7cdcefb7    ...|    DCD    2094854071
        0x00003014:    0bdbdf21    !...    DCD    198958881
        0x00003018:    86d3d2d4    ....    DCD    2262029012
        0x0000301c:    f1d4e242    B...    DCD    4057260610
        0x00003020:    68ddb3f8    ...h    DCD    1759359992
        0x00003024:    1fda836e    n...    DCD    534414190
        0x00003028:    81be16cd    ....    DCD    2176718541
        0x0000302c:    f6b9265b    [&..    DCD    4139329115
        0x00003030:    6fb077e1    .w.o    DCD    1873836001
        0x00003034:    18b74777    wG..    DCD    414664567
        0x00003038:    88085ae6    .Z..    DCD    2282248934
        0x0000303c:    ff0f6a70    pj..    DCD    4279200368
        0x00003040:    66063bca    .;.f    DCD    1711684554
        0x00003044:    11010b5c    \...    DCD    285281116
        0x00003048:    8f659eff    ..e.    DCD    2405801727
        0x0000304c:    f862ae69    i.b.    DCD    4167216745
        0x00003050:    616bffd3    ..ka    DCD    1634467795
        0x00003054:    166ccf45    E.l.    DCD    376229701
        0x00003058:    a00ae278    x...    DCD    2685067896
        0x0000305c:    d70dd2ee    ....    DCD    3608007406
        0x00003060:    4e048354    T..N    DCD    1308918612
        0x00003064:    3903b3c2    ...9    DCD    956543938
        0x00003068:    a7672661    a&g.    DCD    2808555105
        0x0000306c:    d06016f7    ..`.    DCD    3495958263
        0x00003070:    4969474d    MGiI    DCD    1231636301
        0x00003074:    3e6e77db    .wn>    DCD    1047427035
        0x00003078:    aed16a4a    Jj..    DCD    2932959818
        0x0000307c:    d9d65adc    .Z..    DCD    3654703836
        0x00003080:    40df0b66    f..@    DCD    1088359270
        0x00003084:    37d83bf0    .;.7    DCD    936918000
        0x00003088:    a9bcae53    S...    DCD    2847714899
        0x0000308c:    debb9ec5    ....    DCD    3736837829
        0x00003090:    47b2cf7f    ...G    DCD    1202900863
        0x00003094:    30b5ffe9    ...0    DCD    817233897
        0x00003098:    bdbdf21c    ....    DCD    3183342108
        0x0000309c:    cabac28a    ....    DCD    3401237130
        0x000030a0:    53b39330    0..S    DCD    1404277552
        0x000030a4:    24b4a3a6    ...$    DCD    615818150
        0x000030a8:    bad03605    .6..    DCD    3134207493
        0x000030ac:    cdd70693    ....    DCD    3453421203
        0x000030b0:    54de5729    )W.T    DCD    1423857449
        0x000030b4:    23d967bf    .g.#    DCD    601450431
        0x000030b8:    b3667a2e    .zf.    DCD    3009837614
        0x000030bc:    c4614ab8    .Ja.    DCD    3294710456
        0x000030c0:    5d681b02    ..h]    DCD    1567103746
        0x000030c4:    2a6f2b94    .+o*    DCD    711928724
        0x000030c8:    b40bbe37    7...    DCD    3020668471
        0x000030cc:    c30c8ea1    ....    DCD    3272380065
        0x000030d0:    5a05df1b    ...Z    DCD    1510334235
        0x000030d4:    2d02ef8d    ...-    DCD    755167117
    .constdata
    RAM_SCRMBL
        0x000030d8:    02030100    ....    DCD    33751296
        0x000030dc:    06070504    ....    DCD    101123332
        0x000030e0:    0a0b0908    ....    DCD    168495368
        0x000030e4:    0e0f0d0c    ....    DCD    235867404
    RAM_REVSCRMBL
        0x000030e8:    03020001    ....    DCD    50462721
        0x000030ec:    07060405    ....    DCD    117834757
        0x000030f0:    0b0a0809    ....    DCD    185206793
        0x000030f4:    0f0e0c0d    ....    DCD    252578829
    .constdata
    RT_RAM_SCRMBL
        0x000030f8:    030100fe    ....    DCD    50397438
        0x000030fc:    0402        ..      DCW    1026
    RT_RAMBUF_SCRMBL
        0x000030fe:    00ff        ..      DCW    255
        0x00003100:    04030102    ....    DCD    67305730
        0x00003104:    0506        ..      DCW    1286
        0x00003106:    07          .       DCB    7
    .constdata
    __stdin_name
        0x00003107:    3a          :       DCB    58
        0x00003108:    7474        tt      DCW    29812
        0x0000310a:    00          .       DCB    0
    .constdata
    __stdout_name
        0x0000310b:    3a          :       DCB    58
        0x0000310c:    7474        tt      DCW    29812
        0x0000310e:    00          .       DCB    0
    .constdata
    __stderr_name
        0x0000310f:    3a          :       DCB    58
        0x00003110:    00007474    tt..    DCD    29812
    Region$$Table$$Base
        0x00003114:    00003184    .1..    DCD    12676
        0x00003118:    20000004    ...     DCD    536870916
        0x0000311c:    00000018    ....    DCD    24
        0x00003120:    00000104    ....    DCD    260
        0x00003124:    0000319c    .1..    DCD    12700
        0x00003128:    20000030    0..     DCD    536870960
        0x0000312c:    00000008    ....    DCD    8
        0x00003130:    00000104    ....    DCD    260
        0x00003134:    000031a4    .1..    DCD    12708
        0x00003138:    200000c0    ...     DCD    536871104
        0x0000313c:    00000014    ....    DCD    20
        0x00003140:    00000104    ....    DCD    260
    Region$$Table$$Limit
        0x00003144:    00000000    ....    DCD    0
        0x00003148:    00000000    ....    DCD    0
        0x0000314c:    00000000    ....    DCD    0
        0x00003150:    00000000    ....    DCD    0
        0x00003154:    00000000    ....    DCD    0
        0x00003158:    00000000    ....    DCD    0
        0x0000315c:    00000000    ....    DCD    0
        0x00003160:    00000000    ....    DCD    0
        0x00003164:    00000000    ....    DCD    0
        0x00003168:    00000000    ....    DCD    0
        0x0000316c:    00000000    ....    DCD    0
        0x00003170:    00000000    ....    DCD    0
        0x00003174:    00000000    ....    DCD    0
        0x00003178:    00000000    ....    DCD    0
        0x0000317c:    00000000    ....    DCD    0
    CHECKSUM
    __Check_Sum
        0x00003180:    00000000    ....    DCD    0

** Section #2 'RAM_BUF' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 24 bytes (alignment 4)
    Address: 0x20000004


** Section #3 'RAM_PNTR' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 8 bytes (alignment 4)
    Address: 0x20000030


** Section #4 'CLASSB' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 52 bytes (alignment 4)
    Address: 0x20000040


** Section #5 'CLASSB_INV' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 52 bytes (alignment 4)
    Address: 0x20000080


