Synwit-Co-Ltd/IEC60335_CLASSB/SWM260_IEC60335/Objects/SWM260_IEC60335.asm
** Section #6 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 20 bytes (alignment 4)
    Address: 0x200000c0


** Section #7 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 348 bytes (alignment 8)
    Address: 0x200000d4


** Section #8 'STACK_NO_HEAP' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 1032 bytes (alignment 8)
    Address: 0x20003000


** Section #9 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


** Section #10 '.debug_frame' (SHT_PROGBITS)
    Size   : 3836 bytes


** Section #11 '.debug_info' (SHT_PROGBITS)
    Size   : 31852 bytes


** Section #12 '.debug_line' (SHT_PROGBITS)
    Size   : 12156 bytes


** Section #13 '.debug_loc' (SHT_PROGBITS)
    Size   : 2916 bytes


** Section #14 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 60812 bytes


** Section #15 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 2672 bytes


** Section #16 '.symtab' (SHT_SYMTAB)
    Size   : 12448 bytes (alignment 4)
    String table #17 '.strtab'
    Last local symbol no. 504


** Section #17 '.strtab' (SHT_STRTAB)
    Size   : 9912 bytes


** Section #18 '.note' (SHT_NOTE)
    Size   : 48 bytes (alignment 4)


** Section #19 '.comment' (SHT_PROGBITS)
    Size   : 29068 bytes


** Section #20 '.shstrtab' (SHT_STRTAB)
    Size   : 204 bytes


address     size       variable name                            type
0x000030fe  0x9        RT_RAMBUF_SCRMBL                         array[9] of const int8_t

address     size       variable name                            type
0x000030f8  0x6        RT_RAM_SCRMBL                            array[6] of const int8_t

address     size       variable name                            type
0x20000040  0x4        CtrlFlowCnt                              uint32_t

address     size       variable name                            type
0x20000080  0x4        CtrlFlowCntInv                           uint32_t

address     size       variable name                            type
0x2000006c  0x2        CurrentCrc16                             uint16_t

address     size       variable name                            type
0x200000ac  0x2        CurrentCrc16Inv                          uint16_t

address     size       variable name                            type
0x20000070  0x4        CurrentCrc32                             uint32_t

address     size       variable name                            type
0x200000b0  0x4        CurrentCrc32Inv                          uint32_t

address     size       variable name                            type
0x20000054  0x4        CurrentHSEPeriod                         uint32_t

address     size       variable name                            type
0x20000094  0x4        CurrentHSEPeriodInv                      uint32_t

address     size       variable name                            type
0x20000044  0x4        ISRCtrlFlowCnt                           uint32_t

address     size       variable name                            type
0x20000084  0x4        ISRCtrlFlowCntInv                        uint32_t

address     size       variable name                            type
0x20000060  0x4        LastCtrlFlowCnt                          uint32_t

address     size       variable name                            type
0x200000a0  0x4        LastCtrlFlowCntInv                       uint32_t

address     size       variable name                            type
0x20000050  0x4        LastHSEPeriod                            uint32_t

address     size       variable name                            type
0x20000090  0x4        LastHSEPeriodInv                         uint32_t

address     size       variable name                            type
0x20000068  0x4        RefCrc32                                 uint32_t

address     size       variable name                            type
0x200000a8  0x4        RefCrc32Inv                              uint32_t

address     size       variable name                            type
0x2000004c  0x4        RefHSEPeriod                             uint32_t

address     size       variable name                            type
0x2000008c  0x4        RefHSEPeriodInv                          uint32_t

address     size       variable name                            type
0x20000004  0x18       RunTimeRamBuf                            array[6] of uint32_t

address     size       variable name                            type
0x20003000  0x4        StackOverFlowPtrn                        array[1] of volatile uint32_t

address     size       variable name                            type
0x20000048  0x4        StartUpClockFreq                         uint32_t

address     size       variable name                            type
0x20000088  0x4        StartUpClockFreqInv                      uint32_t

address     size       variable name                            type
0x20000058  0x4        TickCounter                              uint32_t

address     size       variable name                            type
0x20000098  0x4        TickCounterInv                           uint32_t

address     size       variable name                            type
0x2000005c  0x4        TimeBaseFlag                             volatile uint32_t

address     size       variable name                            type
0x2000009c  0x4        TimeBaseFlagInv                          volatile uint32_t

address     size       variable name                            type
0x20000064  0x4        p_RunCrc32Chk                            pointer to uint8_t

address     size       variable name                            type
0x200000a4  0x4        p_RunCrc32ChkInv                         pointer to uint8_t

address     size       variable name                            type
0x20000030  0x4        p_RunTimeRamChk                          pointer to uint32_t

address     size       variable name                            type
0x20000034  0x4        p_RunTimeRamChkInv                       pointer to uint32_t

address     size       variable name                            type
0x000030e8  0x10       RAM_REVSCRMBL                            array[16] of const uint8_t

address     size       variable name                            type
0x000030d8  0x10       RAM_SCRMBL                               array[16] of const uint8_t

address     size       variable name                            type
0x200000c4  0x4        CyclesPerUs                              uint32_t

address     size       variable name                            type
0x200000c0  0x4        SystemCoreClock                          uint32_t

